{
    "probabilidadeEEstatistica": [
      {
        "pergunta": "(CESGRANRIO/BB/2021) Responsável por entender o comportamento dos produtos oferecidos por determinado banco onde trabalhava, e preocupado com a quantidade enorme de dados disponíveis para a análise, um funcionário decidiu extrair um subconjunto desses dados.<br>Esse subconjunto é conhecido como",
        "alternativas": ["a) amostra", 
        "b) censo", 
        "c) parâmetro", 
        "d) população", 
        "e) variável"],
        "correta": "a) amostra",
        "explicacao": "A questão traz o conceito de amostra. Uma amostra é um subconjunto extraído da população para análise, que deve ser representativo. A partir das informações coletadas da amostra representativa, os resultados obtidos podem ser utilizados para generalizar, inferir ou tirar conclusões acerca da população. Portanto, o subconjunto coletado do banco de dados, que representa a população, é a amostra. <br>Vejamos as definições das demais alternativas: <br>Alternativa B: o censo, ou recenseamento, é um estudo dos dados referentes a todos os elementos de uma população. <br>Alternativa C: os parâmetros são descrições numéricas de características populacionais que raramente são conhecidas. <br>Alternativa D: uma população é um conjunto que contém todos os indivíduos, objetos ou elementos a serem estudados, que apresentam uma ou mais características em comum. <br>Alternativa E: uma variável é uma característica de relevância que é medida em cada componente da amostra ou população. As variáveis podem ter valores numéricos (variáveis quantitativas) ou não numéricos (variáveis qualitativas)."
      },
      {
        "pergunta": "(CESGRANRIO/BB/2021) Foi solicitado a um funcionário de um determinado banco que realizasse uma pesquisa, exclusivamente com variáveis do tipo qualitativa, sobre a satisfação dos clientes com os serviços oferecidos pela instituição.<br>Para atender a essa demanda utilizando os meios adequados, sua escolha de escalas de mensuração deve estar limitada às escalas",
        "alternativas": ["a) intervalares e razão", 
        "b) nominais e intervalares", 
        "c) nominais e ordinais", 
        "d) ordinais e intervalares", 
        "e) ordinais e razão"],
        "correta": "c) nominais e ordinais",
        "explicacao": "As variáveis qualitativas representam as características que não podem ser descritas de forma numérica, mas que podem ser definidas por meio de qualidades (atributos ou categorias) do indivíduo pesquisado. Elas podem ser classificadas em nominais ou ordinais: <br>I) variável qualitativa nominal (ou categórica), quando as possíveis categorias não podem ser ordenadas. Por exemplo, as cores dos olhos dos moradores de uma determinada cidade (pretos, castanhos, azuis e verdes); <br>II) variável qualitativa ordinal, as possíveis categorias podem ser ordenadas de alguma forma. Por exemplo, o grau de instrução dos funcionários de um determinado órgão (fundamental, médio e superior)."
      },
      {
        "pergunta": "(CESGRANRIO/BB/2021) Após a coleta de dados em um determinado contexto (variáveis A, B, C, … X), uma das formas mais simples e iniciais de análise é a geração e a avaliação de um histograma para uma variável selecionada (ex: X), como por exemplo, em um estudo climático, em que os dados coletados poderiam incluir a temperatura máxima observada em toda a Terra ao longo de dez anos.<br>Nesse caso, o histograma adequado é um gráfico em que são apresentadas as",
        "alternativas": ["a) últimas dez médias móveis da variável X.", 
        "b) somas das médias dos quadrados de cada valor de uma variável X.", 
        "c) variações de uma variável X ao longo do tempo.", 
        "d) médias históricas da variável X nos últimos sete dias.", 
        "e) frequências de uma variável X em intervalos de valores."],
        "correta": "e) frequências de uma variável X em intervalos de valores.",
        "explicacao": "Não tinha comentários."
      }
    ],





    "conhecimentosBancarios": [
      {
        "pergunta": "(2018/CESGRANRIO/BANCO DA AMAZÔNIA/Técnico Bancário) O SFN é composto por um conjunto de órgãos e instituições que regulamenta, supervisiona e realiza operações necessárias à circulação de moeda e de crédito na economia.<br>São órgãos normativos do Sistema Financeiro Nacional:",
        "alternativas": ["a) Conselho Monetário Nacional; Conselho Nacional de Seguros Privados; Comitê de Política Monetária (Copom).", 
        "b) Conselho Nacional de Seguros Privados; Banco Central do Brasil; Conselho Monetário Nacional.", 
        "c) Superintendência de Seguros Privados; Comitê de Política Monetária (Copom); Conselho Federal de Valores Mobiliários.", 
        "d) Banco Central do Brasil; Comissão de Valores Mobiliários; Conselho Monetário Nacional.", 
        "e) Conselho Nacional de Seguros Privados; Conselho Nacional de Previdência Complementar; Conselho Monetário Nacional."],
        "correta": "e) Conselho Nacional de Seguros Privados; Conselho Nacional de Previdência Complementar; Conselho Monetário Nacional.",
        "explicacao": "Lembre-se de que são todos “Conselhos”."
      },
      {
        "pergunta": "(2010/CESGRANRIO/BANCO DO BRASIL/Escriturário) O Sistema Financeiro Nacional (SFN) é constituído por todas as instituições financeiras públicas ou privadas existentes no país e seu órgão normativo máximo é o(a)",
        "alternativas": ["a) Banco Central do Brasil.", 
        "b) Banco Nacional de Desenvolvimento Econômico e Social.", 
        "c) Conselho Monetário Nacional.", 
        "d) Ministério da Fazenda.", 
        "e) Caixa Econômica Federal."],
        "correta": "c) Conselho Monetário Nacional.",
        "explicacao": "Apesar de discordar um pouco do enunciado, uma vez que o CNSP (Conselho Nacional de Seguros Privados) e o CNPC (Conselho Nacional de Previdência Complementar) são os órgãos normativos máximos em suas competências e também compõem o SFN, certamente, entre as alternativas, o CMN é o único órgão normativo, além de poder ser considerado o principal, fazendo de “c” nossa melhor alternativa."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BASA/Técnico Bancário) O Sistema Financeiro Nacional, em todas as partes que o compõem, foi estruturado de forma a promover o desenvolvimento equilibrado do país e a servir aos interesses da coletividade.<br>Em relação à sua composição, o Sistema Financeiro Nacional pode ser divido em",
        "alternativas": ["a) organizações governamentais, instituições públicas e instituições financeiras.", 
        "b) instituições financeiras, instituições filantrópicas e entidades operadoras.", 
        "c) órgãos normativos, entidades supervisoras e operadores.", 
        "d) instituições públicas, organizações não governamentais e instituições privadas.", 
        "e) órgãos fiscalizadores, entidades supervisoras e organizações governamentais."],
        "correta": "c) órgãos normativos, entidades supervisoras e operadores.",
        "explicacao": "A classificação do sistema financeiro consiste em dividir as entidades em três níveis:<br>Normatizadores - Estabelecem as regras gerais a serem seguidas.<br>Supervisores - Detalham as regras e asseguram seu cumprimento.<br>Operadores - Atuam no mercado financeiro de forma direta."
      },
      {
        "pergunta": "(2011/CEBRASPE-CESPE/PREVIC/Especialista em Previdência Complementar) Acerca de finanças, julgue o item. <br>O Sistema Financeiro Nacional possui um órgão máximo com funções deliberativas, denominado Conselho Monetário Nacional (CMN), e várias entidades supervisoras, que são representadas pelo Banco Central do Brasil, pela Comissão de Valores Mobiliários, pela SUSEP e pelas bolsas de mercadorias e de futuros.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "A questão ia muito bem, até mencionar as bolsas como entidades supervisoras, o que está errado, já que são operadoras do sistema."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Conformidade) A respeito das competências e atribuições da Superintendência Nacional de Previdência Complementar (Previc), Tribunal de Contas da União (TCU), Conselho Monetário Nacional (CMN), Banco Central do Brasil (Bacen), Comissão de Valores Mobiliários (CVM) e Superintendência de Seguros Privados (Susep), julgue o item a seguir.<br> O CMN tem a responsabilidade de formular a política da moeda e do crédito. Seu objetivo é a estabilidade da moeda e o desenvolvimento econômico e social do país.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "O Conselho Monetário Nacional (CMN) – criado junto com o Banco Central, pela Lei nº 4.595, de 31 de dezembro de 1964 – é o órgão superior do Sistema Financeiro Nacional (SFN). Ele formula a política monetária e de crédito, com o objetivo de garantir a estabilidade da moeda e o desenvolvimento econômico e social do país. Portanto, cabe ao CMN normatizar os mercados de moeda, crédito, capital e câmbio – nosso primeiro e principal ramo do SFN."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Conformidade) Por meio do Sistema Financeiro Nacional (SFN), viabiliza-se a relação entre agentes carentes de recursos para investimentos e agentes capazes de gerar poupança (financiando, assim, o crescimento da economia). Acerca do SFN, julgue o seguinte item.<br>O Conselho Monetário Nacional (CMN) tem como única responsabilidade a formulação da política da moeda e do crédito.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "A responsabilidade vai além disso, incluindo a estabilidade da moeda e o desenvolvimento econômico e social do país. Conforme texto abaixo:<br>O Conselho Monetário Nacional (CMN) – criado junto com o Banco Central, pela Lei nº 4.595, de 31 de dezembro de 1964 – é o órgão superior do Sistema Financeiro Nacional (SFN). Ele formula a política monetária e de crédito, com o objetivo de garantir a estabilidade da moeda e o desenvolvimento econômico e social do país. Portanto, cabe ao CMN normatizar os mercados de moeda, crédito, capital e câmbio – nosso primeiro e principal ramo do SFN."
      },
      {
        "pergunta": "(2010/INSTITUTO AOCP/BADESUL/Assistente Técnico Administrativo) Com a extinção do Conselho da Superintendência da Moeda e do Crédito, com a finalidade de formular a política da moeda e do crédito, objetivando o progresso econômico e social do País, foi criado em substituição",
        "alternativas": ["a) a Assembleia Monetária Nacional.", 
        "b) o Conselho Monetário Nacional.", 
        "c) o Conselho Nacional de Finanças.", 
        "d) o Ministério das Finanças.", 
        "e) a Coordenadoria de Finanças Públicas."],
        "correta": "b) o Conselho Monetário Nacional.",
        "explicacao": "Apesar da pegada mais histórica desta questão, sabemos que o responsável por formular a política e moeda e do crédito é o CMN."
      },
      {
        "pergunta": "(2016/CEBRASPE-CESPE/FUNPRESP/Especialista - Investimentos) Julgue o item a seguir, relativo ao Sistema Financeiro Nacional (SFN) e ao mercado de valores mobiliários.<br>Os órgãos normativos asseguram que os integrantes do sistema financeiro sigam as regras definidas pelos órgãos de crédito, de capitais e de câmbio, enquanto as entidades supervisoras determinam regras para o bom funcionamento do SFN.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Os papéis estão trocados: cabe às entidades supervisoras que asseguram a observância das regras determinadas pelos órgãos normativos."
      },
      {
        "pergunta": "(2018/FUNRIO/ALERR/Economista) Considerando o sistema financeiro do Brasil, ele é composto pelos seguintes órgãos normativos:",
        "alternativas": ["a) Conselho Monetário Nacional, Conselho Nacional de Seguros Privados e Conselho Nacional de Previdência Complementar.", 
        "b) Conselho Nacional de Seguros Privados, Banco Central e Superintendência Nacional de Previdência Complementar.", 
        "c) Conselho Nacional de Previdência Complementar, Conselho Monetário Nacional, Banco Central e Comissão de Valores Mobiliários.", 
        "d) Conselho Monetário Nacional, Comissão de Valores Mobiliários e Banco Central.", 
        "e) a Coordenadoria de Finanças Públicas."],
        "correta": "a) Conselho Monetário Nacional, Conselho Nacional de Seguros Privados e Conselho Nacional de Previdência Complementar.",
        "explicacao": "Os órgãos normativos, também denominados “normatizadores”, são o CMN, CNSP e CNPC, conforme constam na alternativa “a”.<br>Relembrando que Banco Central, CMV e Previc são supervisores, e a presença deles nas demais alternativas tornou-as incorretas. A Susep também, por sinal, mas ela não aparece na questão."
      },
      {
        "pergunta": "(2021/CESGRANRIO/BASA/Técnico Científico - Tecnologia da Informação) A entidade responsável pela execução da política cambial no Brasil é o(a):",
        "alternativas": ["a) Banco do Brasil (BB).", 
        "b) Banco Central do Brasil (Bacen).", 
        "c) Banco Nacional de Desenvolvimento Econômico e Social (BNDES).", 
        "d) Comissão de Valores Mobiliários (CVM).", 
        "e) Conselho Monetário Nacional (CMN)."],
        "correta": "b) Banco Central do Brasil (Bacen).",
        "explicacao": "A resposta é “Banco Central (b)”, mas ainda mais importante é revisarmos as atribuições do BCB:<br>• emissor de moeda: detém o monopólio de emitir papel-moeda no Brasil.<br>• executor do meio circulante: além de emitir a moeda, é responsável pela distribuição e logística desse numerário.<br>• banco dos bancos: é onde os bancos têm “conta”, e a quem podem recorrer se precisarem de recursos.<br>• banqueiro do governo: mantém a chamada “Conta Única do Tesouro Nacional”, onde são acolhidas todas as disponibilidades financeiras da União, além de ser gestor dos “Ativos de Reserva” do Brasil (basicamente ouro, moeda estrangeira e outros recursos internacionais).<br>• executor da política monetária: determina a quantidade de moeda em circulação, de acordo com as determinações do CMN.<br> • executor da política cambial: atua para controlar o preço das moedas estrangeiras, também conforme determinar o CMN.<br>• supervisor do sistema financeiro."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Conformidade) A respeito das competências e atribuições da Superintendência Nacional de Previdência Complementar (PREVIC), Tribunal de Contas da União (TCU), Conselho Monetário Nacional (CMN), Banco Central do Brasil (Bacen), Comissão de Valores Mobiliários (CVM) e Superintendência de Seguros Privados (SUSEP), julgue o item a seguir.<br>O Bacen é responsável por garantir o poder de compra da moeda nacional, sendo uma de suas principais atribuições emitir papel-moeda e moeda metálica.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "De fato, o BCB possui essas atribuições."
      },
      {
        "pergunta": "(2014/INSTITUTO AOCP/EBSERH/Analista Administrativo – Economia) Compete ao Banco Central do Brasil (Bacen), EXCETO",
        "alternativas": ["a) compensar cheques e outros papéis.", 
        "b) controlar a oferta de moeda e crédito.", 
        "c) fiscalizar as instituições financeiras.", 
        "d) emitir papel moeda e a moeda metálica.", 
        "e) executar a política cambial e administração do câmbio."],
        "correta": "a) compensar cheques e outros papéis.",
        "explicacao": "Compensar cheques e outros papéis não está entre as atribuições do Bacen."
      },
      {
        "pergunta": "(2014/INSTITUTO AOCP/EBSERH/Analista Administrativo – Economia) Um Banco Central, em geral, desempenha diversas funções, EXCETO",
        "alternativas": ["a) executor da política fiscal.", 
        "b) emissão monetária.", 
        "c) supervisor do sistema financeiro.", 
        "d) executor da política monetária.", 
        "e) depositário das reservas internacionais."],
        "correta": "a) executor da política fiscal.",
        "explicacao": "No Brasil, o Tesouro Nacional é o principal executor da política fiscal em âmbito federal."
      },
      {
        "pergunta": "(2014/INSTITUTO AOCP/EBSERH/Analista Administrativo – Economia) Na economia brasileira, qual instituição é responsável por operacionalizar e executar as diretrizes das questões monetárias e cambiais?",
        "alternativas": ["a) Ministério da Fazenda.", 
        "b) Banco do Brasil e Caixa Econômica Federal.", 
        "c) Banco Central do Brasil.", 
        "d) Casa Civil.", 
        "e) Tesouro Nacional."],
        "correta": "c) Banco Central do Brasil.",
        "explicacao": "Operacionalizar e executar é com o BCB, enquanto formular é com o CMN."
      },
      {
        "pergunta": "(2021/CESGRANRIO/BANCO DO BRASIL/Agente Comercial) No Brasil, o órgão responsável pela fiscalização do Sistema Financeiro Nacional é o",
        "alternativas": ["a) Conselho Monetário Nacional.", 
        "b) Ministério da Economia.", 
        "c) Banco Central do Brasil.", 
        "d) Banco do Brasil.", 
        "e) Banco Nacional de Desenvolvimento Econômico e Social (BNDES)."],
        "correta": "c) Banco Central do Brasil.",
        "explicacao": "A resposta é “Banco Central (c)”, mas apenas porque não há alternativa com CVM, Susep ou Previc, que também são supervisores do SFN."
      },
      {
        "pergunta": "(2009/PUC-PR/URBS/Economista) A estrutura do Sistema Financeiro Nacional – SFN – é formada por Órgãos Normativos, Entidades Supervisoras e Operadores. É CORRETO afirmar que as Entidades Supervisoras são formadas pelas seguintes instituições:",
        "alternativas": ["a) Banco Central, Comissão de Valores Mobiliários, Superintendência de Seguros Privados e Superintendência Nacional de Previdência Complementar.", 
        "b) Conselho Monetário Nacional, Conselho Nacional de Seguros Privados e Conselho de Gestão da Previdência Complementar.", 
        "c) Conselho Monetário Nacional, Banco Central e Comissão de Valores Mobiliários.", 
        "d) Conselho de Gestão da Previdência Complementar, Banco Central e Comissão de Valores Mobiliários.", 
        "e) Banco Central, Comissão de Valores Mobiliários, Superintendência de Seguros Privados e Operadores."],
        "correta": "a) Banco Central, Comissão de Valores Mobiliários, Superintendência de Seguros Privados e Superintendência Nacional de Previdência Complementar.",
        "explicacao": "Precisei adaptar esta questão porque, na época, a Superintendência Nacional de Previdência Complementar (Previc) se chamava Secretaria de Previdência Complementar, e era assim que constava na alternativa “a”, que continua sendo o gabarito após a adaptação."
      },
      {
        "pergunta": "(2018/CESGRANRIO/BASA/Técnico Bancário) Atua como operador do Sistema Financeiro Nacional a(o)",
        "alternativas": ["a) Bolsa de Mercadorias e Futuros.", 
        "b) CMN.", 
        "c) Susep.", 
        "d) Previc.", 
        "e) Banco Central do Brasil."],
        "correta": "a) Bolsa de Mercadorias e Futuros.",
        "explicacao": "a) Bolsa de Mercadorias e Futuros -> De fato, as bolsas são entidades operadoras de sistemas financeiros. A B3, no caso brasileiro, é supervisionada pela CVM e normatizada pelo CMN."
      },
      {
        "pergunta": "(2012/FCC/BANCO DO BRASIL/Escriturário) O Sistema Financeiro Nacional tem como entidades supervisoras:",
        "alternativas": ["a) Receita Federal do Brasil e Resseguradores.", 
        "b) Comissão de Valores Mobiliários e Bolsas de Mercadorias e futuros.", 
        "c) Banco Central do Brasil e Superintendência de Seguros Privados.", 
        "d) Banco do Brasil e Banco Nacional de Desenvolvimento Econômico e Social.", 
        "e) FEBRABAN e Superintendência Nacional de Previdência Complementar."],
        "correta": "c) Banco Central do Brasil e Superintendência de Seguros Privados.",
        "explicacao": "Classificamos nas alternativas:<br>a) Receita Federal do Brasil (não é parte do SFN) e Resseguradores (operadores do SFN).<br>b) Comissão de Valores Mobiliários (supervisor) e Bolsas de Mercadorias e futuros (operador, atualmente “B3”).<br>c) Banco Central do Brasil (supervisor) e Superintendência de Seguros Privados (supervisor).<br>d) Banco do Brasil (operador e executor) e Banco Nacional de Desenvolvimento Econômico e Social (operador e executor).<br>e) FEBRABAN (federação de bancos, operadores) e Superintendência Nacional de Previdência Complementar (supervisor)."
      },
      {
        "pergunta": "(2017/IADES/HEMOCENTRO-DF/Analista de Atividades - Economia) O Sistema Financeiro Nacional (SFN) compõe-se de órgãos normativos, entidades supervisoras e operadores. Assinale a alternativa que apresenta apenas os órgãos normativos do SFN.",
        "alternativas": ["a) Conselho Monetário Nacional (CMN), Banco Central do Brasil (BCB) e Comissão de Valores Mobiliários (CVM).", 
        "b) Conselho Monetário Nacional (CMN), Banco Central do Brasil (BCB, Comissão de Valores Mobiliários (CVM) e Bolsa de Valores (BOVESPA).", 
        "c) Banco Central do Brasil (BCB), Comissão de Valores Mobiliários (CVM), Superintendência de Seguros Privados (Susep) e Superintendência Nacional de Previdência Complementar (Previc).", 
        "d) Banco Central do Brasil (BCB) e Comissão de Valores Mobiliários (CVM).", 
        "e) Conselho Monetário Nacional (CMN), Conselho Nacional de Seguros Privados (CNSP) e Conselho Nacional de Previdência Complementar (CNPC)."],
        "correta": "e) Conselho Monetário Nacional (CMN), Conselho Nacional de Seguros Privados (CNSP) e Conselho Nacional de Previdência Complementar (CNPC).",
        "explicacao": "No nível mais alto, estão os órgãos normativos, que determinam regras gerais para o bom funcionamento do SFN. São os seguintes conselhos:<br>▶ Conselho Monetário Nacional (CMN)<br>▶ Conselho Nacional de Seguros Privados (CNSP)<br>▶ Conselho Nacional de Previdência Complementar (CNPC)."
      },
      {
        "pergunta": "(2018/CESGRANRIO/BASA/Técnico Bancário) Na configuração atual do Sistema Financeiro Nacional, a instância máxima de decisão é da alçada do(a).",
        "alternativas": ["a) Banco Central do Brasil.", 
        "b) Comissão de Valores Mobiliários.", 
        "c) Conselho Monetário Nacional.", 
        "d) Banco do Brasil.", 
        "e) Ministério da Fazenda."],
        "correta": "c) Conselho Monetário Nacional.",
        "explicacao": "A instância máxima de decisão do SFN é o CMN, e isso se aplica também aos demais ramos, como seguros privados e previdência complementar. <br>Não confundir com instância máxima recursal, que é o CRSFN. De toda forma, não há essa alternativa na questão."
      },
      {
        "pergunta": "(2018/FGV/BANESTES/Analista de Comunicação) Por Sistema Financeiro Nacional (SFN) entende-se o conjunto de instituições e instrumentos que possibilitam a transferência de recursos entre os agentes econômicos superavitários e os deficitários.<br>Essa transferência é possível em razão:",
        "alternativas": ["a) dos mercados monetário, de crédito, de capitais e cambial.", 
        "b) da atuação dos bancos comerciais.", 
        "c) da atuação dos bancos centrais.", 
        "d) das bolsas de valores.", 
        "e) da atuação da CVM."],
        "correta": "a) dos mercados monetário, de crédito, de capitais e cambial.",
        "explicacao": "Moeda, crédito, capital e câmbio: O principal ramo do SFN lida diretamente com quatro tipos de mercado, composto pelo conjunto de instituições e instrumentos que possibilitam a transferência de recursos entre os agentes econômicos superavitários e os deficitários."
      },
      {
        "pergunta": "(2019/FCC/BANRISUL/Escriturário) Como parte da missão de assegurar que o sistema financeiro seja sólido e eficiente, a autorização para funcionamento de instituições financeiras controladas por capitais nacionais é concedida",
        "alternativas": ["a) pelo Conselho Monetário Nacional.", 
        "b) pela Comissão de Valores Mobiliários.", 
        "c) pela Presidência da República.", 
        "d) pelo Banco Central do Brasil.", 
        "e) pelo Senado Federal."],
        "correta": "d) pelo Banco Central do Brasil.",
        "explicacao": "Cabe ao Banco Central do Brasil (BCB) a objetivo de assegurar a eficiência e o solidez do sistema financeiro.<br>Saber disso bastaria para acertar a questão, que também nos acrescenta sua competência para autorizar o funcionamento de instituições financeiras controladas por capitais nacionais."
      },
      {
        "pergunta": "(2010/FCC/BANCO DO BRASIL/Escriturário) Compete à Comissão de Valores Mobiliários – CVM disciplinar as seguintes matérias:<br>I. registro de companhias abertas.<br>II. execução da política monetária.<br>III. registro e fiscalização de fundos de investimento.<br>IV. registro de distribuições de valores mobiliários.<br>V. custódia de títulos públicos.<br>Está correto o que se afirma APENAS em:",
        "alternativas": ["a) I, II e III", 
        "b) I, II e IV", 
        "c) I, III e IV", 
        "d) II, III e V", 
        "e) III, IV e V"],
        "correta": "c) I, III e IV",
        "explicacao": "Para essa questão, vamos colocar o responsável por disciplinar cada matéria:<br>I. registro de companhias abertas. -> CVM<br>II. execução da política monetária. -> BCB<br>III. registro e fiscalização de fundos de investimento. -> CVM<br>IV. registro de distribuições de valores mobiliários. - -> CVM<br>V. custódia de títulos públicos. -> BCB"
      },
      {
        "pergunta": "(2013/CESGRANRIO/BNDES/Profissional Básico – Biblioteconomia) O órgão brasileiro responsável pelo controle da oferta monetária do país, ou seja, pelo montante total de dinheiro disponível para a população é o(a)",
        "alternativas": ["a) Ministério da Fazenda.", 
        "b) Banco Central do Brasil.", 
        "c) Conselho de Valores Mobiliários (CVM).", 
        "d) Conselho Administrativo de Defesa Econômica (CADE).", 
        "e) Federação Brasileira de Bancos (FEBRABAN)."],
        "correta": "b) Banco Central do Brasil.",
        "explicacao": "Controlar a oferta monetária significa executar a política monetária, papel que cabe ao Banco Central do Brasil."
      },
      {
        "pergunta": "(2012/CESGRANRIO/CAIXA ECONÔMICA FEDEARAL/Técnico Bancário) O Sistema Financeiro Nacional é composto por diversas entidades, dentre as quais os órgãos normativos, os operadores e as entidades supervisoras.<br>A entidade responsável pela fiscalização das instituições financeiras e pela autorização do seu funcionamento é o",
        "alternativas": ["a) Banco Central do Brasil.", 
        "b) Conselho Monetário Nacional.", 
        "c) Fundo Monetário Internacional.", 
        "d) Conselho Nacional de Seguros Privados.", 
        "e) Banco Nacional do Desenvolvimento Econômico e Social (BNDES)."],
        "correta": "a) Banco Central do Brasil.",
        "explicacao": "Aí está mais uma responsabilidade do Banco Central: autorizar o funcionamento de instituições financeiras no Brasil."
      },
      {
        "pergunta": "(2019/FCC/BANRISUL/Escriturário) O gerenciamento do meio circulante para garantir, à população, o fornecimento adequado de dinheiro em espécie é competência",
        "alternativas": ["a) da Casa da Moeda do Brasil.", 
        "b) do Sistema de Pagamentos Brasileiro.", 
        "c) do Banco Central do Brasil.", 
        "d) da Federação Brasileira de Bancos (Febraban).", 
        "e) da Secretaria do Tesouro Nacional."],
        "correta": "c) do Banco Central do Brasil.",
        "explicacao": "A gestão do meio circulante, envolvendo a logística de distribuição do numerário, é atribuição do Banco Central do Brasil."
      },
      {
        "pergunta": "(2019/FCC/METRO SP/Analista Desenvolvimento Gestão Júnior) O Banco Central do Brasil é uma autarquia federal integrante do Sistema Financeiro Nacional, sendo vinculado ao Ministério da Economia. Dentre as suas diversas funções, o Banco Central é responsável por",
        "alternativas": ["a) negociar ações de sociedades de capital aberto e outros valores mobiliários.", 
        "b) certificar os profissionais do mercado financeiro e de capitais do Brasil.", 
        "c) gerenciar as reservas cambiais do país em ouro e em moeda estrangeira.", 
        "d) fazer o registro das companhias abertas.", 
        "e) organizar o funcionamento e as operações das bolsas de valores."],
        "correta": "c) gerenciar as reservas cambiais do país em ouro e em moeda estrangeira.",
        "explicacao": "Como banqueiro do governo, o Banco Central mantém a chamada “Conta Única do Tesouro Nacional”, onde são acolhidas todas as disponibilidades financeiras da União, além de ser gestor dos “Ativos de Reserva” do Brasil (basicamente ouro, moeda estrangeira e outros recursos internacionais).<br>OBS: Agora o Bacen é vinculado ao Ministério da Fazenda."
      },
      {
        "pergunta": "(2018/FGV/BANESTES/Analista de Comunicação) Um banco central possui funções clássicas dentro de um sistema financeiro. No caso brasileiro, amparado pelo Conselho Monetário Nacional (CMN), o Banco Central do Brasil (BCB.) tem como uma de suas atribuições:",
        "alternativas": ["a) a execução da política fiscal.", 
        "b) o regramento das bolsas de valores.", 
        "c) a execução da política monetária.", 
        "d) a determinação do superávit primário.", 
        "e) o regramento de ofertas públicas iniciais."],
        "correta": "c) a execução da política monetária.",
        "explicacao": "O BCB tem diversas atribuições, das quais se destacam ser o banco dos bancos, o banqueiro do governo, o executor da política monetária, o executor da política cambial, o supervisor do sistema financeiro, entre outras."
      },
      {
        "pergunta": "(2012/CESGRANRIO/EPE/Analista de Gestão Corporativa - Finanças e Orçamento) Considere as funções de supervisão de algumas das instituições do Sistema Financeiro Nacional.<br>I - Disciplinar e fiscalizar a administração de carteiras e a custódia de valores mobiliários.<br>II - Executar os serviços do meio circulante.<br>III - Fiscalizar as atividades das entidades fechadas de previdência complementar.<br>Considerando-se as funções acima, verifica-se que o que está expresso em",
        "alternativas": ["a) I é uma função da Secretaria de Previdência Complementar.", 
        "b) II é uma função da Comissão de Valores Mobiliários.", 
        "c) II é uma função do Banco Central do Brasil.", 
        "d) III é uma função da Superintendência de Seguros Privados.", 
        "e) III é uma função do IRB – Brasil Resseguros."],
        "correta": "c) II é uma função do Banco Central do Brasil.",
        "explicacao": "Vejamos os responsáveis por cada função:<br>I - Disciplinar e fiscalizar a administração de carteiras e a custódia de valores mobiliários. -> CVM<br>II - Executar os serviços do meio circulante. -> BCB<br>III - Fiscalizar as atividades das entidades fechadas de previdência complementar. -> PREVIC"
      },
      {
        "pergunta": "(2018/CESGRANRIO/TRANSPETRO/Analista Júnior - Financeiro) A instituição legalmente responsável por prover liquidez ao sistema financeiro nacional em períodos de crise e por cumprir a chamada função de emprestador de última instância é a(o)",
        "alternativas": ["a) Caixa Econômica Federal.", 
        "b) Comissão de Valores Mobiliários (CVM).", 
        "c) Banco do Brasil.", 
        "d) Banco Central do Brasil.", 
        "e) Banco Nacional de Desenvolvimento Econômico e Social (BNDES)."],
        "correta": "d) Banco Central do Brasil.",
        "explicacao": "Como banco dos bancos, cabe ao BCB prover liquidez ao sistema financeiro, o que significa garantir que a impossibilidade pontual de um banco comercial em honrar suas obrigações não se torne uma crise de liquidez ou contamine o sistema."
      },
      {
        "pergunta": "(2019/FCC/BANRISUL/Escriturário) No âmbito do Sistema Financeiro Nacional, a atribuição da coordenação da Dívida Pública Federal externa e interna é",
        "alternativas": ["a) do Banco Central do Brasil.", 
        "b) do Ministério da Fazenda.", 
        "c) da Secretaria do Tesouro Nacional.", 
        "d) do Ministério do Planejamento, Orçamento e Gestão.", 
        "e) do Conselho Monetário Nacional."],
        "correta": "e) do Conselho Monetário Nacional.",
        "explicacao": "Como vimos, na Aula 00, a coordenação da dívida federal como atribuição do CMN."
      },
      {
        "pergunta": "(2019/FCC/BANRISUL/Escriturário) O Conselho de Recursos do Sistema Financeiro Nacional é um órgão colegiado, integrante da estrutura do Ministério da Fazenda, e que tem por finalidade julgar os recursos contra as sanções aplicadas pelo Banco Central e pela Comissão de Valores Mobiliários (CVM) e, nos processos de lavagem de dinheiro, as sanções aplicadas pelo Conselho de Controle de Atividades Financeiras (COAF) e demais autoridades competentes em",
        "alternativas": ["a) casos de interesse exclusivo de investidores estrangeiros.", 
        "b) processos de segunda instância judicial.", 
        "c) situações de litígio entre instituições financeiras estatais.", 
        "d) segundo grau e última instância administrativa.", 
        "e) arbitragens decorrentes da utilização de instrumentos financeiros derivativos."],
        "correta": "d) segundo grau e última instância administrativa.",
        "explicacao": "O Conselho de Recursos do Sistema Financeiro Nacional (CRSFN) é um órgão colegiado, de segundo grau, integrante da estrutura do Ministério da Fazenda e tem por finalidade julgar, em última instância administrativa, os recursos contra as sanções aplicadas pelo BCB e CVM e, nos processos de lavagem de dinheiro, as sanções aplicadas pelo COAF, SUSEP e demais autoridades competentes.<br>Ou seja, quando o BCB, por exemplo, aplica uma multa a um banco, este pode recorrer, esgotado o recurso à própria autarquia, ao CRSFN."
      },
      {
        "pergunta": "(2018/FGV/BANESTES/Analista de Comunicação) Dentro do Sistema Financeiro Nacional (SFN), cada entidade é responsável por funções específicas. Nesse sentido, a Comissão de Valores Mobiliários (CVM) tem por principal atribuição:",
        "alternativas": ["a) zelar pela defesa da concorrência nas emissões de títulos.", 
        "b) zelar pelo funcionamento eficiente e integridade do mercado de capitais.", 
        "c) garantir a regulação prudencial do sistema financeiro.", 
        "d) atender as normas do Banco Central do Brasil.", 
        "e) estabelecer regras para o mercado segurador."],
        "correta": "b) zelar pelo funcionamento eficiente e integridade do mercado de capitais.",
        "explicacao": "A Comissão de Valores Mobiliários (CVM) foi criada em 07/12/1976 pela Lei 6.385/76, com o objetivo de fiscalizar, normatizar, disciplinar e desenvolver o mercado de valores mobiliários no Brasil, como uma entidade autárquica em regime especial, vinculada ao Ministério da Fazenda, com personalidade jurídica e patrimônio próprios, dotada de autoridade administrativa independente, ausência de subordinação hierárquica, mandato fixo e estabilidade de seus dirigentes, e autonomia financeira e orçamentária."
      },
      {
        "pergunta": "(2012/CESGRANRIO/EPE/Analista de Gestão Corporativa - Finanças e Orçamento) O Sistema Financeiro Nacional é composto de dois subsistemas: o normativo e o de intermediação financeira.<br>São órgãos do subsistema normativo:",
        "alternativas": ["a) o Conselho Monetário Nacional e o Banco Central.", 
        "b) o Banco do Brasil e a Comissão de Valores Mobiliários.", 
        "c) o Banco Nacional de Desenvolvimento Econômico e Social e os bancos de investimento.", 
        "d) a Caixa Econômica Federal e a Superintendência de Seguros Privados.", 
        "e) a Bolsa de Valores e a Bolsa de Mercadoria e de Futuros de São Paulo."],
        "correta": "a) o Conselho Monetário Nacional e o Banco Central.",
        "explicacao": "Questão boa para treinar as classificações. Nesse caso, temos o seguinte:<br>a) o Conselho Monetário Nacional (normatizador no subsistema normativo) e o Banco Central (supervisor no subsistema normativo). E aqui está o gabarito<br>b) o Banco do Brasil (operador no subsistema de intermediação) e a Comissão de Valores Mobiliários (supervisor no subsistema normativo).<br>c) o Banco Nacional de Desenvolvimento Econômico e Social (operador no subsistema de intermediação) e os bancos de investimento (operadores no subsistema de intermediação).<br>d) a Caixa Econômica Federal (operador no subsistema de intermediação) e a Superintendência de Seguros Privados (supervisor no subsistema normativo).<br>e) a Bolsa de Valores (operador no subsistema de intermediação) e a Bolsa de Mercadoria e de Futuros de São Paulo (operador no subsistema de intermediação). Aliás, hoje são uma só instituição, a B3, resultantes de duas fusões."
      },
      {
        "pergunta": "(2011/CESGRANRIO/BNDES/Técnico de Arquivo) Integram o Sistema Financeiro Nacional:",
        "alternativas": ["a) Conselho da República e Conselho Monetário Nacional.", 
        "b) Banco do Brasil e Receita Federal.", 
        "c) Conselho da República e Banco do Brasil.", 
        "d) Banco Nacional de Desenvolvimento Econômico e Social e Receita Federal.", 
        "e) Banco Central do Brasil e Banco do Brasil."],
        "correta": "e) Banco Central do Brasil e Banco do Brasil.",
        "explicacao": "Conselho da República e Receita Federal não integram o SFN, deixando-nos apenas com a alternativa “e” válida."
      },
      {
        "pergunta": "(2010/CESGRANRIO/EPE/Analista de Gestão Corporativa - Finanças e Orçamento) Dentre as instituições citadas, a única que NÃO pertence ao subsistema normativo do Sistema Financeiro Nacional é o(a)",
        "alternativas": ["a) Banco Central do Brasil.", 
        "b) Conselho Monetário Nacional.", 
        "c) Bolsa de Valores de São Paulo.", 
        "d) Comissão de Valores Mobiliários (CVM).", 
        "e) Superintendência de Seguros Privados."],
        "correta": "b) as Instituições financeiras públicas.",
        "explicacao": "Conselho da República e Receita Federal não integram o SFN, deixando-nos apenas com a alternativa “e” válida."
      },
      {
        "pergunta": "(2007/CESGRANRIO/BNDES/Técnico de Arquivo) Além do Banco Central do Brasil e do Banco do Brasil S.A., constituem o Sistema Financeiro Nacional:<br>I - Conselho Monetário Nacional;<br>II - BNDES;<br>III - demais instituições financeiras públicas;<br>IV - demais instituições financeiras privadas.<br>Estão corretos os itens",
        "alternativas": ["a) I e II, apenas.", 
        "b) II e III, apenas.", 
        "c) III e IV, apenas.", 
        "d) I, II e IV, apenas.", 
        "e) I, II, III e IV."],
        "correta": "e) I, II, III e IV.",
        "explicacao": "Todas a entidades citadas no enunciado e nos itens fazem parte do SFN."
      },
      {
        "pergunta": "(2019/FEPESE/PREF FLORIANÓPOLIS/Economista) Dentre os órgãos de Sistema Financeiro Nacional:",
        "alternativas": ["a) Estão classificados como órgãos normativos: a Bolsa de Valores e o Banco Central do Brasil.", 
        "b) A Superintendência de Seguros Privados (SUSEP) é responsável pela fiscalização de mercados de seguros privados e de mercados de seguros públicos obrigatórios.", 
        "c) O Conselho Monetário Nacional (CMN) tem a responsabilidade de formular a política monetária do país e o presidente do CMN é o próprio Presidente da República.", 
        "d) O Conselho Monetário Nacional (CMN) tem como função executar a estratégia estabelecida pelo Banco Central para manter a inflação baixa.", 
        "e) A Comissão de Valores Mobiliários (CVM) provê empréstimos aos membros do sistema financeiro com a intenção de regular a liquidez e evitar falências."],
        "correta": "b) A Superintendência de Seguros Privados (SUSEP) é responsável pela fiscalização de mercados de seguros privados e de mercados de seguros públicos obrigatórios.",
        "explicacao": "As outras alternativas estão incorretas."
      },
      {
        "pergunta": "(2014/CESGRANRIO/BANCO DA AMAZÔNIA/Técnico Bancário) Atualmente, o Sistema Financeiro Nacional é composto por órgãos normativos, entidades supervisoras e por operadores.<br>Um dos órgãos normativos que compõe o Sistema Financeiro Nacional é o(a):",
        "alternativas": ["a) Banco Nacional de Desenvolvimento Econômico e Social – BNDES.", 
        "b) Banco Comercial.", 
        "c) Conselho Monetário Nacional.", 
        "d) Bolsa de Valores.", 
        "e) Superintendência de Seguros Privados – SUSEP."],
        "correta": "c) Conselho Monetário Nacional.",
        "explicacao": "Os órgãos normativos são os responsáveis elaborar as regras do SFN. Entre aqueles elencados nas alternativas, apenas o CMN (letra “c”) tem essa função. Os demais são operadores (BNDES, banco comercial e bolsa de valores) ou supervisor (SUSEP)."
      },
      {
        "pergunta": "(2003/FCC/CVM/Analista) O Sistema Financeiro Nacional é composto por um conjunto de instituições que",
        "alternativas": ["a) controlam o Produto Interno Bruto do setor financeiro.", 
        "b) permitem o fluxo de recursos entre poupadores e tomadores.", 
        "c) determinam o saldo do Balanço de Pagamentos.", 
        "d) definem a Política Monetária, Cambial e de Crédito.", 
        "e) administram os títulos da dívida interna."],
        "correta": "b) permitem o fluxo de recursos entre poupadores e tomadores.",
        "explicacao": "De forma geral, as instituições que constituem o SFN (normatizadores, supervisores e operadores) é permitir o fluxo de recursos entre os agentes econômicos superavitários e os deficitários, como consta na alternativa “b”."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) O uso do “dinheiro de plástico” consolidou-se nos últimos anos como uma das principais modalidades de pagamento.<br>Um tipo de “dinheiro de plástico” muito utilizado para compras à vista em estabelecimentos comerciais é o",
        "alternativas": ["a) cartão presente.", 
        "b) cartão de débito.", 
        "c) cartão de senhas.", 
        "d) talão de cheques.", 
        "e) cartão virtual."],
        "correta": "b) cartão de débito.",
        "explicacao": "Essa é para fixar que o cartão de débito é chamado dinheiro de plástico, e serve para realizar pagamentos à vista no comércio."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) O cartão de débito possui duas funções principais. Assinale-as.",
        "alternativas": ["a) Autoatendimento e comércio.", 
        "b) Parcelamento de compras e cadastramento de débito automático.", 
        "c) Comércio e garantias.", 
        "d) Transferências ao exterior e pagamentos.", 
        "e) Saques e compras à vista."],
        "correta": "a) Autoatendimento e comércio.",
        "explicacao": "Todas as operações previstas nas alternativas podem ser feitas utilizando o cartão de débito para acessar terminais de autoatendimento. Contudo, a questão pede as funções principais, que estão na letra “a”."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) De acordo com a normatização do Banco Central do Brasil e do Conselho Monetário Nacional, a emissão de segunda via de cartão de débito é",
        "alternativas": ["a) gratuita, em qualquer caso.", 
        "b) tarifada, em qualquer caso.", 
        "c) gratuita, se o motivo da substituição for imputável à instituição emissora.", 
        "d) vedada, por motivos de segurança.", 
        "e) tarifada, se o motivo da substituição não for imputável ao usuário."],
        "correta": "c) gratuita, se o motivo da substituição for imputável à instituição emissora.",
        "explicacao": "O fornecimento de segunda via de cartão de débito é gratuito, exceto nos casos de pedido de reposição formulados pelo correntista decorrentes de perda, roubo, furto, danificação e outros motivos não imputáveis à instituição emitente.<br>Ou seja, se a culpa for da instituição, não pode ocorrer a cobrança de tarifa para emissão da 2ª via."
      },
      {
        "pergunta": "(2012/CESGRANRIO/BANCO DO BRASIL/Escriturário) Nos dias de hoje, o uso do “dinheiro de plástico” está superando cada vez mais outras modalidades de pagamento, que, com o passar dos anos, estão ficando obsoletas.<br>Um tipo de “dinheiro de plástico” muito utilizado no comércio de rua é o",
        "alternativas": ["a) cartão cidadão.", 
        "b) cartão de crédito.", 
        "c) cartão de senhas.", 
        "d) talão de cheques.", 
        "e) internet banking."],
        "correta": "b) cartão de crédito.",
        "explicacao": "Sim, isso caiu no concurso. Embora o contexto da aula ainda facilite as coisas, é o tipo de questão que você não pode deixar passar, até porque o nível da prova tende a subir ao longo do tempo.<br>O uso de cartões de crédito (dinheiro de plástico) é bastante difundido no comércio, inclusive no comércio de rua, termo de difícil definição, mas que pode abarcar tudo aquilo que não ocorre em shopping centers ou aeroportos, ou apenas feiras-livres ou ambulantes. Mas a letra “b” está correta, qualquer que seja a definição adotada."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Os cartões de crédito são, às vezes, chamados de “dinheiro de plástico”. Seu uso crescente como meio de pagamento implica vários aspectos, EXCETO o(a)",
        "alternativas": ["a) ganho sobre a inflação para os possuidores de cartão, sendo os valores das compras pagos apenas no vencimento do cartão.", 
        "b) crédito automático até certo limite para os possuidores de cartão.", 
        "c) aumento da demanda de papel moeda pelos possuidores de cartão, para pagamento de suas transações.", 
        "d) aumento da segurança da transação, tanto para o comprador quanto para o vendedor.", 
        "e) indução ao crescimento de vendas para os estabelecimentos credenciados."],
        "correta": "c) aumento da demanda de papel moeda pelos possuidores de cartão, para pagamento de suas transações.",
        "explicacao": "Muitas vezes chamados de “dinheiro de plástico” pela Cesgranrio.<br>Vejamos qual característica não se aplica aos cartões de crédito.<br>a) ganho sobre a inflação para os possuidores de cartão, sendo os valores das compras pagos apenas no vencimento do cartão.<br>Isso é verdade! Em um ambiente inflacionário, você compra hoje a paga, dentro de alguns dias, o mesmo valor da data da compra, mesmo que o produto comprado esteja custando mais caro no vencimento da fatura. Isso é o que a alternativa quis dizer com “ganho sobre a inflação”.<br>b) crédito automático até certo limite para os possuidores de cartão.<br>Verdade. Esse é o conceito de limite do cartão de crédito.<br>c) aumento da demanda de papel moeda pelos possuidores de cartão, para pagamento de suas transações.<br>Errado (e gabarito). Por substituir o papel-moeda como meio de pagamento, os cartões de fato reduzem a demanda por papel-moeda. Em outras palavras, é necessário menos cédulas e moedinhas circulando para atender às necessidades do comércio.<br>d) aumento da segurança da transação, tanto para o comprador quanto para o vendedor.<br>Verdade também. Os cartões aumentam da segurança das transações, tanto para o comprador quanto para o vendedor.<br>Para o comprador, eles dispensam a necessidade de carregar grandes quantias de dinheiro, sujeitando-se a extravios ou até roubos.<br>Para o vendedor, além de diminuir a necessidade de dinheiro em caixa (sujeito aos mesmos riscos de extravio, furto ou roubo), os cartões praticamente eliminam o risco com fraudes ou falsificações.<br>e) indução ao crescimento de vendas para os estabelecimentos credenciados.<br>Sim! O aumento das vendas é proporcionado, principalmente, pela maior segurança sentida pelos clientes e, no caso dos cartões de crédito, pela possibilidade de parcelamentos."
      },
      {
        "pergunta": "(2018/CEBRASPE-CESPE/BNB/Analista Bancário) Julgue o item seguinte, acerca dos serviços de compensação de cheques e outros títulos. A Centralizadora da Compensação de Cheques (COMPE), sistema operado pelo Banco do Brasil S.A., é responsável pela compensação interbancária de cheques.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Correto. O BB opera a Compe, enquanto o BCB regula o serviço de compensação de cheques."
      },
      {
        "pergunta": "(2007/CEBRASPE-CESPE/BANCO DO BRASIL/Escriturário) O Banco do Brasil S.A. (BB) teve destacado papel na criação, estruturação e regulação do Sistema Financeiro Nacional (SFN), que ocorreram por meio das leis de Reforma Bancária (1964), do Mercado de Capitais (1965) e de Criação dos Bancos Múltiplos (1988). O SFN pode ser definido como sendo o conjunto de órgãos de regulação, instituições financeiras e instituições auxiliares, públicos ou privados, que atuam na intermediação de transferência de recursos dos agentes econômicos (pessoas, empresas ou governo) superavitários para os deficitários. Acerca das atribuições e funções do BB, julgue o item seguinte.<br>A partir da instituição do Sistema de Pagamentos Brasileiro (SPB), o BB deixou de ser responsável por executar os serviços de compensação de cheques e outros papéis.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Apenas mentira. O BB não deixou de ser responsável pelo serviço de compensação de cheques, e ainda o é, por meio da Compe."
      },
      {
        "pergunta": "(2014/INSTITUTO AOCP/EBSERH/Analista - Economia) Compete ao Banco Central do Brasil (Bacen), EXCETO",
        "alternativas": ["a) compensar cheques e outros papéis.", 
        "b) controlar a oferta de moeda e crédito.", 
        "c) fiscalizar as instituições financeiras.", 
        "d) emitir papel moeda e a moeda metálica.", 
        "e) executar a política cambial e administração do câmbio."],
        "correta": "a) compensar cheques e outros papéis.",
        "explicacao": "Veja como as bancas gostam desse tema. Apesar de esta aula não ser sobre as competências do BCB, sabemos que executar a compensação de cheques não é uma delas, tornando “a” nosso gabarito."
      },
      {
        "pergunta": "(2012/FCC/BANESE/Técnico Bancário I) As normas do Banco Central do Brasil a respeito de cheque determinam que",
        "alternativas": ["a) as pessoas, lojas e empresas são obrigadas a receber.", 
        "b) não pode ser pago pelo banco antes do dia nele indicado.", 
        "c) o correntista não tem formas de impedir o pagamento de um cheque já emitido.", 
        "d) o beneficiário está impedido de levar a protesto ou executar em juízo.", 
        "e) tem que ser nominal no caso de valor superior a R$ 100,00."],
        "correta": "e) tem que ser nominal no caso de valor superior a R$ 100,00.",
        "explicacao": "A letra “a” está errada. Devido ao risco de crédito envolvido, as pessoas podem se recusar a receber pagamentos em cheque, devendo indicar essa recusa expressamente. <br>A letra “b” está errada. A prática de “cheques pré-datados” é apenas um costume, não havendo normas do Banco Central que impeçam o pagamento do cheque antes da data indicada. Afinal, é uma ordem de pagamento à vista. <br>É possível, sim, impedir o pagamento de um cheque emitido, e por isso “c” está errada. A isso, dá-se o nome de sustação. É algo comum, por exemplo, quando o serviço contratado ou o produto adquirido não são entregues pelo vendedor. Naturalmente, sustar um cheque indevidamente pode ter consequências para o emitente. <br>Por fim, “d” também está errada. O cheque pode ser protestado ou levado a juízo em caso de não compensação nos termos acordados. <br>Nosso gabarito é a letra “e”, conforme aprendemos nesta aula: cheques superiores a R$100 não podem ser “ao portador”. "
      },
      {
        "pergunta": "(2013/CEBRASPE-CESPE/TJ-RN/Juiz de Direito Substituto) Com relação ao cheque, assinale a opção correta.",
        "alternativas": ["a) O cheque estipulado pagável a favor de pessoa nomeada, com ou sem cláusula expressa à ordem, é transmissível por via de endosso.", 
        "b) Assim como os demais títulos de crédito, o cheque deve ser apresentado para aceite, sob pena de não ser executável.", 
        "c) Quem for demandado por obrigação resultante de cheque não pode opor ao portador, em nenhuma hipótese, exceções fundadas em relações pessoais com o emitente.", 
        "d) O avalista que paga o cheque adquire todos os direitos dele resultantes contra o avalizado, ficando desonerados os obrigados para com este em virtude do cheque.", 
        "e) Após emitido o cheque, caso o seu emitente venha a falecer ou ser declarado incapaz, os efeitos do cheque serão invalidados."],
        "correta": "a) O cheque estipulado pagável a favor de pessoa nomeada, com ou sem cláusula expressa à ordem, é transmissível por via de endosso.",
        "explicacao": "Mas veja que a letra “a” está de acordo com o que aprendemos sobre o endosso. “Com ou sem cláusula expressa à ordem” significa “com ou sem concordância expressa do emitente”. Ou seja, o beneficiário do cheque não precisa de autorização do emitente para endossar o cheque. "
      },
      {
        "pergunta": "(2021/CEBRASPE-CESPE/BANESE/Técnico Bancário I) No que se refere à abertura e ao encerramento de conta-corrente, julgue o item subsecutivo. É proibida a abertura de conta-corrente para agente com inscrição no Cadastro de Emitentes de Cheques sem Fundos (CCF).",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "A abertura e encerramento de contas é regida pela Resolução CMN n° 4.753/2019. E a norma não determina proibição para abertura de conta-corrente nessas condições.<br>Sendo assim, a instituição financeira não é obrigada a abrir conta para clientes com inscrição no CCF, mas também não é proibida."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Uma das medidas adotadas para mitigar os efeitos da crise financeira de 2008 foi a ampliação do acesso ao crédito, aumentando, com isso, ainda mais, o papel dos bancos no desenvolvimento do país. <br>O Crédito Direto ao Consumidor (CDC)",
        "alternativas": ["a) é um empréstimo pessoal de operação não vinculada à aquisição de bens ou serviços.", 
        "b) exclui as compras no cartão de crédito.", 
        "c) é um crédito concedido através de bancos e instituições financeiras para aquisição de bens.", 
        "d) é um empréstimo descontado diretamente na folha de pagamento.", 
        "e) possui um prazo mínimo de 2 anos para o vencimento."],
        "correta": "c) é um crédito concedido através de bancos e instituições financeiras para aquisição de bens.",
        "explicacao": "O CDC é sim vinculado à aquisição de bens ou serviços, estando errada a letra “a”."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BASA/Técnico Bancário) Atualmente os bancos oferecem diversas modalidades de crédito. A operação de crédito concedida para a aquisição de bens e serviços, com a opção de antecipação de pagamento das parcelas com deságio, é o",
        "alternativas": ["a) leasing.", 
        "b) certificado de depósito interbancário.", 
        "c) cartão de crédito.", 
        "d) crédito direto ao consumidor.", 
        "e) hot money."],
        "correta": "d) crédito direto ao consumidor.",
        "explicacao": "O enunciado descreve corretamente o CDC."
      },
      {
        "pergunta": "(2011/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) Atenção: Para responder à questão, considere o Código de Defesa do Consumidor Bancário.<br>As Instituições Financeiras, nas operações de crédito pessoal e de crédito direto ao consumidor, realizadas com seus clientes, devem assegurar o direito à liquidação antecipada do débito",
        "alternativas": ["a) total ou parcial, sem redução proporcional dos juros.", 
        "b) total ou parcial, mediante redução proporcional dos juros.", 
        "c) total, exclusivamente, mediante redução proporcional dos juros.", 
        "d) total, exclusivamente, sem redução proporcional dos juros.", 
        "e) parcial, exclusivamente, com redução proporcional dos juros."],
        "correta": "b) total ou parcial, mediante redução proporcional dos juros.",
        "explicacao": "A instituição deve oferecer, no CDC, a possibilidade de pagamento antecipado das parcelas ou do saldo devedor total com deságio, ou seja, com redução proporcional nos juros. Se você quiser pagar uma das parcelas antes do vencimento, o banco é obrigado a “tirar os juros” dessa parcela."
      },
      {
        "pergunta": "(2015/EXATUS/BANPARÁ/Técnico Bancário) O Crédito Direto ao Consumidor – CDC - é uma operação de crédito concedida a pessoas físicas ou jurídicas para a aquisição de bens e serviços.<br>Com base nessa afirmação, assinale a alternativa correta sobre o CDC:",
        "alternativas": ["a) O consumidor que contrata o CDC passa a desfrutar imediatamente de um bem que será pago com sua renda futura.", 
        "b) O consumidor que contrata o CDC passa a desfrutar de um bem noventa dias após quitação da primeira parcela de pagamento.", 
        "c) O consumidor que contrata o CDC passa a desfrutar do bem adquirido após trinta dias da quitação da primeira parcela de pagamento.", 
        "d) O consumidor que contrata o CDC passa a desfrutar do bem adquirido após sessenta dias da quitação da terceira parcela de pagamento.", 
        "e) O consumidor que contrata o CDC passa a desfrutar imediatamente de um bem adquirido após o vencimento da segunda parcela."],
        "correta": "a) O consumidor que contrata o CDC passa a desfrutar imediatamente de um bem que será pago com sua renda futura.",
        "explicacao": "O CDC proporciona a obtenção de um bem ou serviço antes mesmo de realizar o pagamento da primeira parcela do crédito. Não existem as carências previstas nas alternativas de “b” a “e”."
      },
      {
        "pergunta": "(2013/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) As operações denominadas Crédito Direto ao Consumidor são caracterizadas",
        "alternativas": ["a) pela não incidência de IOF para contratos com pessoa física.", 
        "b) por destinação ao financiamento de bens e serviços para pessoas físicas ou jurídicas.", 
        "c) pela dispensa da informação do Custo Efetivo Total para clientes correntistas dos bancos.", 
        "d) pela impossibilidade de antecipação de pagamento de parcelas.", 
        "e) pela ausência de gravame no caso de financiamento de veículos usados."],
        "correta": "b) por destinação ao financiamento de bens e serviços para pessoas físicas ou jurídicas.",
        "explicacao": "Analisemos as alternativas. <br>a) pela não incidência de IOF para contratos com pessoa física.<br>Errado. Incide IOF sobre contratos de CDC, inclusive para pessoa física.<br>b) por destinação ao financiamento de bens e serviços para pessoas físicas ou jurídicas.<br>Certo. Essa é a finalidade do CDC.<br>c) pela dispensa da informação do Custo Efetivo Total para clientes correntistas dos bancos.<br>Errado. Os bancos devem informar, obrigatoriamente, o Custo Efetivo Total (CET), que consiste em demonstrar todos os cursos com juros, taxas e impostos.<br>d) pela impossibilidade de antecipação de pagamento de parcelas.<br>Errado demais. É obrigatório oferecer essa possibilidade, com redução proporcional nos juros.<br>e) pela ausência de gravame no caso de financiamento de veículos usados.<br>Errado. O bem financiado pode ser garantia em CDC, e de fato para veículos costuma ocorrer o gravame por meio de alienação fiduciária."
      },
      {
        "pergunta": "(2010/FUNVAPI/BANPARÁ/Técnico Bancário) João recorreu ao banco em que é cliente e contratou um financiamento para aquisição de um computador portátil (notebook). Assinale a opção correta sobre a operação realizada entre João e o banco:",
        "alternativas": ["a) Mobile banking.", 
        "b) Certificado de Depósito Bancário – CDB.", 
        "c) Crédito Direto ao Consumidor – CDC.", 
        "d) Internet banking.", 
        "e) Crédito Direto ao Consumidor com Interveniência – CDC-I."],
        "correta": "c) Crédito Direto ao Consumidor – CDC.",
        "explicacao": "CDC: Crédito Direto ao Consumidor = Modalidade de crédito destinada ao consumidor final para aquisição de bens (incluindo notebooks) ou serviços."
      },
      {
        "pergunta": "(2010/CEBRASPE-CESPE/BASA/Técnico Bancário) Acerca de crédito bancário, julgue o item seguinte. O crédito direto ao consumidor é uma modalidade destinada exclusivamente à compra de bens imóveis comerciais e residenciais, e seus principais clientes são as pessoas físicas.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Errado. Isso é crédito imobiliário. Vimos que o CDC pode ser utilizado para aquisição de bens móveis (como carros) ou até mesmo serviços."
      },
      {
        "pergunta": "(2018/BASA/CESGRANRIO/Técnico Bancário) O crédito rural abrange diversas modalidades de financiamento aos empresários do setor, desde a fase de produção até o abastecimento dos mercados consumidores.<br>A modalidade que assegura aos produtores e cooperativas rurais recursos destinados a financiar o abastecimento doméstico e o armazenamento dos estoques excedentes em períodos de queda dos preços é denominada crédito",
        "alternativas": ["a) geral.", 
        "b) especial.", 
        "c) de investimento.", 
        "d) de custeio.", 
        "e) de comercialização."],
        "correta": "e) de comercialização.",
        "explicacao": "Para despesas de armazenamento e abastecimento doméstico (transporte dentro do país), a modalidade é o crédito de comercialização."
      },
      {
        "pergunta": "(2018/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Em virtude das peculiaridades das atividades agropecuárias, a maior parte dos países disponibiliza um adequado sistema de financiamento aos produtores, abarcando linhas de crédito ao investimento, à produção e à comercialização dos produtos do setor. O Banco do Brasil, particularmente, oferece diversas linhas de crédito adequadas às necessidades dos produtores rurais. Associe as linhas de financiamento disponibilizadas pelo Banco do Brasil aos seus objetivos e características principais, apresentados a seguir.<br>I - Custeio agropecuário<br>II - Pronamp Investimento<br>III - Financiamento de Garantia de Preços ao Produtor (FGPP)<br>IV - BB Agronegócio Giro<br>P - Crédito destinado à aquisição de produtos agropecuários diretamente de produtores rurais, suas associações ou cooperativas de produção agropecuária.<br>Q - Crédito para financiamento de inovações tecnológicas nas propriedades rurais.<br>R - Crédito destinado à cobertura das despesas do dia a dia da produção das atividades agrícolas e pecuárias.<br>S - Crédito rotativo destinado à compra de insumos e matérias-primas relacionadas à produção agropecuária.<br>T - Crédito para financiamento das despesas de investimento, destinado ao médio produtor rural.<br>As associações corretas são:",
        "alternativas": ["a) I – P ; II – T ; III – R ; IV – S", 
        "b) I – R ; II – T ; III – S ; IV – P", 
        "c) I – S ; II – T ; III – P ; IV – R", 
        "d) I – R ; II – T ; III – P ; IV – S", 
        "e) I – R ; II – Q ; III – P ; IV – S"],
        "correta": "d) I – R ; II – T ; III – P ; IV – S",
        "explicacao": "Lembre-se que o Pronamp é para o médio produtor, e assim ligamos II com T, e eliminamos a letra “e”.<br>Em seguida, podemos nos apoiar no nome “BB Agronegócio Giro” para concluir que se trata de uma modalidade de capital de giro, ou seja, um crédito rotativo. Assim, fechamos IV com S, ficando com apenas as letras “a” e “e” como possíveis gabaritos.<br>Como a diferença entre elas é apenas em relação ao item I, resta lembrarmos que a modalidade custeio serve para arcar com despesas comuns da produção rural, em um ciclo produtivo, e pode ser para atividades agrícolas ou pecuárias. Então: I e R nos dão o gabarito."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) Produto oferecido no mercado que consiste na reunião de pessoas para aquisição de bens por meio de autofinanciamento é o(a)",
        "alternativas": ["a) Crédito.", 
        "b) Financiamento.", 
        "c) Consórcio.", 
        "d) Capitalização.", 
        "e) Cooperativa."],
        "correta": "c) Consórcio.",
        "explicacao": "Essa é para lembrar o conceito de consórcio."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) A respeito dos consórcios, considere os itens a seguir e assinale a alternativa que estabelece corretamente a correspondência com os conceitos.<br>Itens<br>I. Fundo comum.<br>II. Fundo de reserva.<br>III. Taxa de administração.<br>IV. Carta de crédito<br>Conceitos<br>X. Remuneração da administradora de consórcios<br>Y. Destina-se à aquisição dos bens mediante contemplação<br>W. Dá direito à aquisição do bem ou serviço previsto no contrato<br>Z. Cobertura para eventos como inadimplência e seguros",
        "alternativas": ["a) I-Y, II-Z, III-X, IV-W", 
        "b) I-Z, II-Y, III-X, IV-W", 
        "c) I-Y, II-X, III-W, IV-Z", 
        "d) I-W, II-Z, III-Y, IV-W", 
        "e) I-Y, II-Z, III-W, IV-X"],
        "correta": "a) I-Y, II-Z, III-X, IV-W",
        "explicacao": "Questão boa para relembrar alguns dos principais conceitos relacionados ao consórcio, sendo que a letra “a” estabelece as correspondências corretas."
      },
      {
        "pergunta": "(2021/PROF. CELSO NATALE) A respeito das atribuições do Banco Central do Brasil, estabelecidas na legislação em vigor, assinale a opção correta.",
        "alternativas": ["a) Compete ao Banco Central, com o apoio da Comissão de Valores Mobiliários (CVM), supervisionar as administradoras de consórcios.", 
        "b) As administradoras do setor de consórcios são fiscalizadas e autorizadas a funcionar pelo Banco Central do Brasil.", 
        "c) Os bancos múltiplos com carteira comercial podem atuar como administradores de consórcios de bens, desde que designem diretor responsável exclusivamente pela atividade.", 
        "d) O mercado cambial é fiscalizado exclusivamente pela CVM.", 
        "e) O Banco Central não pode intervir nas empresas operadoras de consórcios ou decretar sua liquidação extrajudicial."],
        "correta": "b) As administradoras do setor de consórcios são fiscalizadas e autorizadas a funcionar pelo Banco Central do Brasil.",
        "explicacao": "Vamos analisar cada uma das alternativas.<br>a) Compete ao Banco Central, com o apoio da Comissão de Valores Mobiliários (CVM), supervisionar as administradoras de consórcios.<br>Errado. A CVM não presta esse tipo de apoio.<br>b) As administradoras do setor de consórcios são fiscalizadas e autorizadas a funcionar pelo Banco Central do Brasil.<br>Certo. O BCB é responsável por autorizar o funcionamento e fiscalizar as administradoras de consórcio, podendo inclusive intervir ou decretar sua liquidação extrajudicial.<br>c) Os bancos múltiplos com carteira comercial podem atuar como administradores de consórcios de bens, desde que designem diretor responsável exclusivamente pela atividade.<br>Errado. Apenas administradoras de consórcios podem fazer isso.<br>d) O mercado cambial é fiscalizado exclusivamente pela CVM.<br>Errado. O mercado cambial (assunto de outra aula), é fiscalizado pelo BCB.<br>e) O Banco Central não pode intervir nas empresas operadoras de consórcios ou decretar sua liquidação extrajudicial.<br>Errado. Ele pode sim, em caso de descumprimento de limites regulamentares, de situação patrimonial deteriorada ou de irregularidades."
      },
      {
        "pergunta": "(2006/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) Analise: O princípio básico do ______ é o de que o lucro vem da ______ de um bem e não da sua ______. Preenchem correta e respectivamente as lacunas acima:",
        "alternativas": ["a) leasing, utilização, propriedade", 
        "b) vendor, fabricação, venda", 
        "c) crédito direto ao consumidor, utilização, compra", 
        "d) cheque especial, aquisição, fabricação", 
        "e) compror, utilização, compra"],
        "correta": "a) leasing, utilização, propriedade",
        "explicacao": "O princípio básico do leasing é que o lucro vem da utilização, e não da propriedade. Por isso, nessa modalidade, o arrendatário não é dono do bem, mas pode utilizá-lo."
      },
      {
        "pergunta": "(2022/BASA/CESGRANRIO/BASA/Técnico Bancário) N negocia determinado bem através de contrato de leasing. Nos termos dessa espécie contratual, é possível a aquisição do referido bem no final do contrato pelo",
        "alternativas": ["a) custo médio calculado pelo credor", 
        "b) percentual de prestações previsto", 
        "c) preço residual avençado", 
        "d) prêmio acordado pelas partes", 
        "e) valor total do bem"],
        "correta": "c) preço residual avençado",
        "explicacao": "Aqui, a banca apenas troca o termo mais comum “Valor residual garantido (VRG)” por um equivalente.<br>Avençado significa algo como “acordado”, “combinado”, e certamente é o que ocorre com o VRG, determinado no início de contrato.<br>Lembrando como funciona o leasing financeiro:<br>A arrendadora (Sociedade de Arrendamento Mercantil adquire o bem escolhido de um fornecedor (como um veículo, por exemplo) e o entrega para uso do arrendatário (o cliente).<br>Durante o prazo definido, o arrendatário faz pagamento de parcelas e, ao final, poderá ou não exercer o direito de compra do bem por um valor residual garantido (VRG) previamente estabelecido (avençado)."
      },
      {
        "pergunta": "(2014/CESGRANRIO/BASA/Técnico Científico - Tecnologia) As sociedades de arrendamento mercantil são supervisionadas pelo Banco Central do Brasil e realizam operações de arrendamento de bens móveis e imóveis.<br>Uma das principais operações de arrendamento mercantil é denominada",
        "alternativas": ["a) Leasing", 
        "b) Factoring", 
        "c) Hot Money", 
        "d) Corporate finance", 
        "e) Commercial papers"],
        "correta": "a) Leasing",
        "explicacao": "Na verdade, essa questão é imprecisa. Afinal, “arrendamento mercantil” é um sinônimo de “leasing”. Veja o que diz o próprio Banco Central:<br>“As operações de arrendamento mercantil podem ser divididas em duas modalidades: leasing financeiro e leasing operacional. A diferença básica é que no leasing financeiro o prazo é usualmente maior e o arrendatário tem a possibilidade de adquirir o bem por um valor préestabelecido.”<br>No mesmo sentido, Assaf Neto:<br>“As sociedades de arrendamento mercantil têm por objetivo a realização de operações de arrendamento mercantil (leasing) de bens nacionais, adquiridos de terceiros e destinados ao uso de empresas arrendatárias.”<br>Portanto, Leasing não é uma das principais operações de arrendamento mercantil. Leasing é arrendamento mercantil.<br> Mas é o tipo de questão que a gente não discute. A gente acerta e pontua."
      },
      {
        "pergunta": "(2012/CESGRANRIO/CEF/Técnico Bancário Novo) As sociedades de arrendamento mercantil são constituídas sob a forma de sociedade anônima, devendo constar obrigatoriamente na sua denominação social a expressão “Arrendamento Mercantil”.<br>Uma das operações típicas realizadas por essas sociedades é o(a)",
        "alternativas": ["a) leasing", 
        "b) factoring", 
        "c) underwriting", 
        "d) câmbio internacional", 
        "e) venda de ações"],
        "correta": "a) leasing",
        "explicacao": "Repetitiva, né? Pois está aqui para demonstrar que a banca “gosta” desse assunto, cobrando de forma praticamente idêntica em concursos diferentes. E esses não foram os únicos..."
      },
      {
        "pergunta": "(2015/QUADRIX/CRM-TO/Analista Contábil) O Dicionário Internacional de Economia e Finanças da Forense Universitária conceitua Banco como a “instituição que tem como atividade básica receber do público, sob a forma de depósitos ou sob outras formas, fundos que serão empregados em operações de desconto, de crédito ou aplicações financeiras”. Informa ainda que “a atividade bancária inclui ainda a possibilidade para os bancos de criar moeda escritural e a faculdade de ativar diversos meios para a concessão de créditos, seja por meio de criação de moeda bancária ou da transformação de depósitos à vista ou de poupança líquida em empréstimos”. <br>A “operação através da qual um banco paga ao portador de um título comercial seu valor, antes do vencimento, mediante uma dedução do referido valor”, é denominada:",
        "alternativas": ["a) Desconto de títulos.", 
        "b) Redesconto.", 
        "c) Entesouramento.", 
        "d) Empréstimo.", 
        "e) Autofinanciamento."],
        "correta": "a) Desconto de títulos.",
        "explicacao": "O enunciado descreve o “desconto de títulos” (letra “a”). Redesconto é um instrumento relacionado ao mercado monetário, utilizado pelo Banco Central para controlar a oferta de moeda. Entesouramento é o ato de acumular recursos, acima do necessário, como uma empresa com sobra de caixa ou o cofrinho de uma criança. Sobre empréstimo falamos bastante, e autofinanciamento é algo que podemos dizer sobre o consórcio."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BASA/Técnico Bancário) Os bancos oferecem diversas modalidades de crédito para as empresas ajustarem seu fluxo de caixa. Uma dessas modalidades é o desconto de títulos, que consiste na",
        "alternativas": ["a) antecipação de um direito (recebível), seja um boleto ou um cheque, feito pelo banco ao cliente, mediante a cobrança de uma taxa de juros.", 
        "b) prorrogação do vencimento de títulos (deveres) dos seus clientes para uma data futura, mediante a cobrança de uma taxa de juros.", 
        "c) liquidação antecipada de títulos dos clientes com um desconto nos juros proporcional ao prazo de antecipação.", 
        "d) geração de descontos em tarifas e taxas bancárias para os clientes que realizarem os pagamentos de títulos pela internet.", 
        "e) alienação de recebíveis atrelados a bens móveis e imóveis com desconto na taxa de juros."],
        "correta": "a) antecipação de um direito (recebível), seja um boleto ou um cheque, feito pelo banco ao cliente, mediante a cobrança de uma taxa de juros.",
        "explicacao": "O desconto de títulos é, de fato, a antecipação de um recebível, feita pelo banco, mediante a cobrança de juros. Ou seja, a letra “a” é quase certa. Quase, porque o boleto não é um título. É apenas um instrumento de pagamento. Não formaliza um direito ou obrigação de pagar, e nenhum banco vai descontar um boleto. Enfim, a banca pecou nesse sentido, mas esse é um dos casos em que marcamos a mais correta (ou menos errada). <br>Em “b”, temos uma recomposição de dívida. <br>Em “c”, o erro é que não há liquidação antecipada do título: o vencimento continua o mesmo. <br>Em “d”, há apenas um incentivo à digitalização, que tenta induzir você ao erro com a palavra “desconto”. <br>Por fim, em “e” ocorre uma portabilidade: o cliente leva seu financiamento para o banco que oferece juros menores."
      },
      {
        "pergunta": "(2018/FADESP/BANPARÁ/Técnico Bancário) Refere-se a uma operação de crédito bancário com um valor limite. Normalmente é movimentada pelo cliente através de seus cheques, desde que não haja saldo disponível em sua conta corrente de movimentação. À medida que entram recursos na conta corrente do cliente, eles são usados para cobrir o saldo devedor. Essas características dizem respeito ao(às)",
        "alternativas": ["a) Hot Money.", 
        "b) Crédito Rotativo.", 
        "c) Contas Garantidas.", 
        "d) Banco Virtual.", 
        "e) transferências automáticas de fundos."],
        "correta": "c) Contas Garantidas.",
        "explicacao": "O enunciado descreve, corretamente, as contas garantidas (letra “c”). Contudo, apenas pontuo que a movimentação por cheques está cada vez mais em desuso, sendo o cartão de débito e os canais digitais as formas de movimentação principais de contas garantidas, atualmente."
      },
      {
        "pergunta": "(2011/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) A operação de empréstimo bancário denominada hot money é caracterizada como:",
        "alternativas": ["a) de médio prazo.", 
        "b) isenta de IOF.", 
        "c) crédito direto ao consumidor.", 
        "d) de prazo mínimo de 1 dia útil.", 
        "e) destinada à aquisição de bens."],
        "correta": "d) de prazo mínimo de 1 dia útil.",
        "explicacao": "Vamos ver cada uma das alternativas.<br>a) de médio prazo.<br>Errado! Hot money é operação de curto ou curtíssimo prazo.<br>b) isenta de IOF.<br>Nada disso. Por ser operação financeira, incide IOF.<br>c) crédito direto ao consumidor.<br>Não é para o consumidor, e sim para empresas.<br>d) de prazo mínimo de 1 dia útil.<br>Isso mesmo! O prazo mínimo é de um dia útil.<br>e) destinada à aquisição de bens.<br>Errado. É para necessidade de caixa."
      },
      {
        "pergunta": "(2008/CESGRANRIO/CEF/Técnico Bancário Novo - Administrativa) A operação bancária de empréstimo a curtíssimo prazo, geralmente de um dia e no máximo de dez dias, que visa a atender às necessidades imediatas de caixa de seus clientes, e tem como referencial a taxa CDI acrescida de um spread e impostos é o",
        "alternativas": ["a) hot money.", 
        "b) mobile banking.", 
        "c) factoring.", 
        "d) certificado de depósito bancário.", 
        "e) crédito rotativo."],
        "correta": "a) hot money.",
        "explicacao": "O enunciado descreve o hot money:<br>• Prazo curto (um a dez dias), e note o “geralmente”, ou seja, ela não crava que o prazo máximo é de dez dias.<br>• Necessidades imediatas de caixa.<br>• Juros com base no CDI + spread (e impostos, mas estes estariam inclusos no spread)."
      },
      {
        "pergunta": "(2010/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) A operação bancária de vendor finance é a prática de financiamento de vendas com base no princípio da",
        "alternativas": ["a) obtenção de receitas, que viabiliza vantagens para o cliente em uma transação comercial.", 
        "b) cessão de crédito, que permite a uma empresa vender seu produto a prazo e receber à vista o pagamento do Banco, mediante o pagamento de juros.", 
        "c) concentração do risco de crédito, que fica por conta da empresa compradora em troca de uma redução da taxa de juros na operação do financiamento das vendas.", 
        "d) troca ou negociação de títulos de curto prazo por recebíveis de longo prazo, sem custos para ambas as partes.", 
        "e) retenção de crédito lastreado por títulos públicos e vinculado a transações comerciais, garantindo ao vendedor o recebimento total de sua duplicata."],
        "correta": "b) cessão de crédito, que permite a uma empresa vender seu produto a prazo e receber à vista o pagamento do Banco, mediante o pagamento de juros.",
        "explicacao": "A questão é conceitual, e descreve, em seu enunciado, a operação de vendor finance (letra “b”).<br>Acredito que “a” está errada pois não há obtenção de receitas, mas pode haver redução de custos (com impostos).<br>Em “c”, temos exatamente o oposto do que ocorre no vendor, onde os riscos são reduzidos ao incluir vendedor e comprador.<br>As demais alternativas fogem ao escopo deste assunto."
      },
      {
        "pergunta": "(2006/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) A empresa XYZ possui um bom conceito de crédito junto ao seu banco e opera com clientes que dificilmente atrasam seus pagamentos, mas, devido a investimentos realizados recentemente visando o aumento da produção, atualmente não dispõe de recursos próprios para financiar suas vendas. A operação por meio da qual o banco poderá viabilizar as vendas a prazo da empresa XYZ recebe a denominação de",
        "alternativas": ["a) factoring.", 
        "b) crédito direto ao consumidor.", 
        "c) leasing.", 
        "d) warrants.", 
        "e) vendor finance."],
        "correta": "e) vendor finance.",
        "explicacao": "Temos neste enunciado a descrição de algumas características do vendor finance, especialmente no que diz respeito aos bons clientes, falta de recursos próprios para financiá-los e viabilização de vendas a prazo."
      },
      {
        "pergunta": "(2012/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Atualmente, os bancos possuem diversos tipos de produtos para financiar as relações comerciais, desde as realizadas por microempresas até as realizadas por grandes empresas.<br>Qual é o nome da operação realizada quando pequenas indústrias vendem para grandes lojas comerciais e estas procuram os bancos para dilatar o prazo de pagamento mediante a retenção de juros?",
        "alternativas": ["a) Compror Finance", 
        "b) Vendor Finance", 
        "c) Capital de Giro", 
        "d) Contrato de Mútuo", 
        "e) Crédito Rotativo"],
        "correta": "a) Compror Finance",
        "explicacao": "Note que quem está procurando o banco é o comprador (grandes lojas). Por isso, desta vez, estamos diante do compror finance."
      },
      {
        "pergunta": "(2008/CESGRANRIO/BNDES/Profissional Básico - Engenharia) Os Certificados de Depósito Bancário (CDB) são títulos emitidos pelos Bancos com o objetivo de",
        "alternativas": ["a) capitalizar as empresas de capital aberto que fazem parte do portfolio do banco.", 
        "b) pagar indenizações e multas fiscais.", 
        "c) captar recursos que serão normalmente repassados na forma de empréstimos.", 
        "d) captar recursos de curtíssimo prazo de outros Bancos.", 
        "e) captar recursos exclusivamente com taxas de juros pré-fixadas."],
        "correta": "c) captar recursos que serão normalmente repassados na forma de empréstimos.",
        "explicacao": "<br>a) capitalizar as empresas de capital aberto que fazem parte do portfolio do banco.<br>Errado. Isso pode ser feito com ações ou debêntures.<br>b) pagar indenizações e multas fiscais.<br>Errado. Isso é feito com provisões contábeis sobre recursos próprios.<br>c) captar recursos que serão normalmente repassados na forma de empréstimos.<br>Certo!<br>d) captar recursos de curtíssimo prazo de outros Bancos.<br>Errado. Isso é feito com os CDIs (fácil confundir, né?), assuntos para a aula sobre mercadointerbancário.<br>e) captar recursos exclusivamente com taxas de juros pré-fixadas.<br>Errado. Os CDBs podem ser pós-fixados, e normalmente são, com percentuais do CDI."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Investimentos) Em relação à distribuição de dividendos, julgue o seguinte item. O CDB é emitido pelas instituições financeiras como forma de captação de recursos.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "A banca deu como correta essa questão. Acredito que dizer que “CDB é emitido pelas instituições financeiras” pode parecer que é emitido por todas, o que não é verdade. Apenas alguns tipos de bancos e financeiras (SCFI) podem emitir CDBs. Cooperativas, por exemplo, não podem."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Investimentos) Em relação à distribuição de dividendos, julgue o seguinte item. O CDB é uma forma de investir no Tesouro Direto.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Bem, essa está claramente errada. CDB é, para o cliente, uma forma de investir e receber juros de uma instituição bancária."
      },
      {
        "pergunta": "(2021/CESGRANRIO/BANCO DO BRASIL/Escriturário) Dentre as escolhas mais populares de investimentos, a caderneta de poupança é uma das opções mais utilizadas pelos brasileiros, sendo considerada um investimento de renda fixa. São também investimentos de renda fixa",
        "alternativas": ["a) as Ações", 
        "b) as Opções", 
        "c) as Commodities", 
        "d) os CDB", 
        "e) os ETF de Ações"],
        "correta": "d) os CDB",
        "explicacao": "Todas as alternativas, com exceção da “d” (nosso gabarito), trazem modalidades de investimento de renda variável."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Investimentos) Em relação à distribuição de dividendos, julgue o seguinte item. Com o CDB pré-fixado, o investidor conhece o indicador que servirá de referência para a rentabilidade do seu papel.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "É no CDB pós-fixado que o investidor conhece o indicador. No pré-fixado não é indicador, é uma taxa predeterminada."
      },
      {
        "pergunta": "(2021/INSTITUTO AOCP/FUNPRESP-JUD/Analista - Investimentos) Em relação à distribuição de dividendos, julgue o seguinte item. O indicador mais utilizado para os CDBs pós-fixados é o CDI.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "O Certificado de Depósito Bancário (CDB) é um título de renda fixa – emitido por bancos comerciais, bancos de investimentos ou bancos múltiplos – adquirido por pessoas físicas ou jurídicas.<br>Rentabilidade:<br>▶ Pré-fixada (exemplo, 7% ao ano)<br>▶ Pós-fixada: normalmente, tem por referência o CDI (taxa de depósitos interbancários)."
      },
      {
        "pergunta": "(2022/INSTITUTO AOCP/BANESE/Técnico Bancário - Informática) [adaptada] Em relação aos produtos financeiros (ativos e passivos) disponíveis, assinale a alternativa correta.",
        "alternativas": ["a) O Certificado de Depósito Bancário e o Recibo de Depósito Bancário podem ser transferidos, a qualquer momento, para outros investidores.", 
        "b) O hot money são operações de curto prazo e é utilizado para financiar o caixa das empresas. Tem como referencial a taxa CDI e o spread cobrado, sendo isento do IOF.", 
        "c) A Letra de Câmbio é um título de crédito utilizado pelas Sociedades de Crédito, Financiamento e Investimento (as Financeiras), destinado à captação de recursos para realização de financiamento de operações de crédito.", 
        "d) Commercial papers são títulos privados bancários, emitidos para compensar o depósito compulsório realizado pelos bancos junto ao BACEN.", 
        "e) A caderneta de poupança é uma aplicação popular e possui como principais atrativos a liquidez imediata e a isenção de IR para pessoas físicas e jurídicas."],
        "correta": "c) A Letra de Câmbio é um título de crédito utilizado pelas Sociedades de Crédito, Financiamento e Investimento (as Financeiras), destinado à captação de recursos para realização de financiamento de operações de crédito.",
        "explicacao": "A letra “c” é nosso gabarito, e descreve perfeitamente a Letra de Câmbio (que não tem relação com moeda estrangeira)."
      },
      {
        "pergunta": "(2018/CESGRANRIO - Técnico Científico (BASA)/Tecnologia da Informação/2018 O mercado financeiro capta recursos junto ao público, mediante a emissão de diversos títulos de crédito, diferenciados por características, tais como o tipo de emissor (bancos, entidades de crédito e financiamento, governos, etc.), formas de remuneração (renda fixa ou variável), dentre outras. Existe, por exemplo, um título de renda fixa, emitido pelas sociedades de crédito, financiamento e investimento (“financeiras”), destinado à captação de recursos que serão utilizados, sobretudo, no financiamento de operações de crédito entre financiadoras e comerciantes.<br>O título descrito acima é o(a)",
        "alternativas": ["a) certificado de depósito bancário (CDB)", 
        "b) título do Tesouro Nacional", 
        "c) letra financeira do Tesouro (LFT)", 
        "d) caderneta de poupança", 
        "e) letra de câmbio"],
        "correta": "e) letra de câmbio",
        "explicacao": "Mais uma vez, infelizmente, a banca comete uma imprecisão. Mas também, outra vez, é o tipo de questão que acertamos, e não discutimos.<br>Embora a Letra de Câmbio seja o instrumento de captação das Financeiras – e por isso o gabarito é a letra “e” –, esse título não é emitido pela Financeira, mas sim pelo devedor.<br>Por exemplo: se você quiser dinheiro emprestado comprar, digamos, uma máquina para sua empresa, você pode emitir uma LC para a “Nu Financeira S.A” (uma SCFI). Se a Nu Financeira aceitar, ela será “aceitante” da LC, e não emitente! Você, devedor, é quem emite. E quem emprestar o dinheiro para você será o investidor, também chamado de “adquirente” da LC.<br>Enfim, a letra “e” ainda é a melhor alternativa, já que apenas o governo pode emitir “b” e “c”, apenas bancos comerciais podem emitir “a” e contas de poupança não podem ser abertas por Financeiras."
      },
      {
        "pergunta": "(2018/CESGRANRIO/BASA/Técnico Científico - Tecnologia da Informação) As sucessivas reduções na taxa básica de juros, a Selic, impactam a decisão dos investidores com relação à poupança. Sobre as cadernetas de poupança tem-se que",
        "alternativas": ["a) têm a remuneração composta pela Taxa Referencial e por uma remuneração adicional de 0,5% ao mês, se a Selic for maior que 8,5%.", 
        "b) têm a remuneração creditada no último dia útil de cada mês.", 
        "c) têm incidência do Imposto de Renda.", 
        "d) são passíveis de cobrança de taxas administrativas.", 
        "e) não são garantidas pelo FGC."],
        "correta": "a) têm a remuneração composta pela Taxa Referencial e por uma remuneração adicional de 0,5% ao mês, se a Selic for maior que 8,5%.",
        "explicacao": "De acordo com a “regra nova” (de 2012, então nem é tão nova assim) caso a Selic esteja acima de 8,5% a poupança paga 0,5% ao mês + TR, como consta na letra “a”. Mas vamos aproveitar as demais alternativas para fixar alguns conceitos."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Tradicionalmente, o rendimento da Caderneta de Poupança sempre foi determinado pela variação da TR (Taxa Referencial) mais juros de 0,5% ao mês. Entretanto, os depósitos realizados a partir de 04/05/2012 têm rendimento vinculado à meta da taxa Selic.<br>Desde então, se esta meta for igual ou menor que 8,5% ao ano, os juros da Caderneta de Poupança são",
        "alternativas": ["a) aumentados para 130% da Selic", 
        "b) aumentados para 130% da Selic mais a TR", 
        "c) aumentados para 100% da Selic", 
        "d) reduzidos para 70% da Selic", 
        "e) reduzidos para 70% da Selic mais a TR"],
        "correta": "d) reduzidos para 70% da Selic",
        "explicacao": "A questão quer saber apenas sobre os juros da poupança, que ela define como sendo de 0,5% ao mês. E esses juros é que são reduzidos para 70% da Selic (a TR continua lá) quando ela estiver abaixo de 8,5%, ou seja, os juros passam a ser limitados a 70% da Selic."
      },
      {
        "pergunta": "(2014/CESGRANRIO/BASA/Técnico Científico - Tecnologia da Informação) A caderneta de poupança é um dos investimentos mais populares do Brasil, principalmente por ser um investimento de baixo risco. <br>A poupança é regulada pelo Banco Central, e, atualmente, com a meta da taxa Selic superior a 8,5%, sua remuneração é de",
        "alternativas": ["a) 0,3% ao mês, mais a variação do CDB", 
        "b) IGPM (Índice Geral de Preços do Mercado), mais TR (Taxa Referencial)", 
        "c) TR (Taxa Referencial), mais 0,5% ao mês", 
        "d) 0,5% ao mês", 
        "e) 6% ao ano"],
        "correta": "c) TR (Taxa Referencial), mais 0,5% ao mês",
        "explicacao": "A remuneração da poupança, com selic superior a 8,5%, é composta da TR (Taxa Referencial), mais 0,5% ao mês."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BASA/Técnico Bancário) Os rendimentos sobre depósitos de poupança realizados após 04/05/2012 são compostos de duas parcelas: <br>I - a remuneração básica, dada pela Taxa Referencial - TR, e <br>II - a remuneração adicional, correspondente a: a) x% ao mês, enquanto a meta da taxa Selic ao ano for superior a y%; ou b) z% da meta da taxa Selic ao ano, mensalizada, vigente na data de início do período de rendimento, enquanto a meta da taxa Selic ao ano for igual ou inferior a y%. <br>Para que o texto acima corresponda à remuneração da poupança tal como descrito pelo Banco Central do Brasil, os valores de x, y e z são, respectivamente",
        "alternativas": ["a) 0,5 ; 8,5 e 60", 
        "b) 0,6 ; 12 e 70", 
        "c) 0,5 ; 12 e 70", 
        "d) 0,5 ; 8,5 e 70", 
        "e) 0,6 ; 8,5 e 60"],
        "correta": "d) 0,5 ; 8,5 e 70",
        "explicacao": "Os valores correspondentes a x, y e z estão na letra “d”."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BANCO DO BRASIL/Escriturário) O mercado de seguros é cada vez mais crescente no Brasil. As seguradoras oferecem uma gama diferenciada de produtos e subprodutos para atender a essa grande demanda. <br>O seguro de acidentes pessoais, por exemplo, garante o pagamento de indenização em caso de",
        "alternativas": ["a) colisão do automóvel do segurado com veículos de terceiros, desde que esteja estipulado na apólice.", 
        "b) perda total do veículo sem danos ao segurado, desde que especificado na apólice.", 
        "c) paralisação das atividades laborais do segurado durante o período de uma eventual internação hospitalar causada por doença crônica.", 
        "d) invalidez permanente, total ou parcial, por acidente, ou indenização ao beneficiário em caso de falecimento do segurado.", 
        "e) incêndio, enchente ou qualquer outro tipo de fenômeno climático que danifique a residência do segurado."],
        "correta": "d) invalidez permanente, total ou parcial, por acidente, ou indenização ao beneficiário em caso de falecimento do segurado.",
        "explicacao": "<br>a) colisão do automóvel do segurado com veículos de terceiros, desde que esteja estipulado na apólice.<br>Errado. Essa é uma possiblidade do seguro de automóvel: cobertura de danos causados a terceiros.<br>b) perda total do veículo sem danos ao segurado, desde que especificado na apólice.<br>Errado. Também é uma cobertura possível no seguro de automóvel.<br>c) paralisação das atividades laborais do segurado durante o período de uma eventual internação hospitalar causada por doença crônica.<br>Errado. Isso é o chamado “afastamento” do INSS.<br>d) invalidez permanente, total ou parcial, por acidente, ou indenização ao beneficiário em caso de falecimento do segurado.<br>Certo! O seguro de acidentes pessoais é semelhante ao seguro de vida, mas, como o nome indica, só cobre eventos causados por acidentes.<br>e) incêndio, enchente ou qualquer outro tipo de fenômeno climático que danifique a residência do segurado.<br>Errado. Esse é o seguro residencial."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BASA/Técnico Bancário) Os planos de seguro têm o objetivo de gerar proteção patrimonial às pessoas físicas ou jurídicas. <br>Em um seguro de veículo, se o segurado trocar de carro ou incluir algum item em sua apólice, ele deverá solicitar a seguradora um ",
        "alternativas": ["a) endosso na apólice.", 
        "b) reembolso de prêmio.", 
        "c) estorno de pagamento.", 
        "d) cancelamento de apólice.", 
        "e) pedido de prêmio."],
        "correta": "a) endosso na apólice.",
        "explicacao": "O endosso é como chamamos as alterações contratuais, inclusive do objeto segurado em um seguro de veículos, como quando você troca de carro durante a vigência do seguro."
      },
      {
        "pergunta": "(2012/CESGRANRIO/BANCO DO BRASIL/Escriturário) As seguradoras também se preocupam com os riscos que as cercam por conta da possibilidade de um colapso no mercado ou, até mesmo, pela ocorrência simultânea de muitos sinistros.<br>Nesse sentido, para se aliviar parcialmente do risco de um seguro já feito, a companhia poderá contrair um novo seguro em outra instituição, através de uma operação denominada",
        "alternativas": ["a) corretagem de seguro.", 
        "b) resseguro.", 
        "c) seguro de incêndio.", 
        "d) seguro de veículos.", 
        "e) seguro de vida."],
        "correta": "b) resseguro.",
        "explicacao": "A situação pede um resseguro. Lembrando:<br>Resseguro: operação pela qual o segurador transfere a outro, total ou parcialmente, um risco assumido através da emissão de uma apólice ou um conjunto delas."
      },
      {
        "pergunta": "(2012/FCC/BANCO DO BRASIL/Escriturário) Produto que, após um período de acumulação de recursos, proporciona aos investidores uma renda mensal − que poderá ser vitalícia ou por período determinado − ou um pagamento único, é o",
        "alternativas": ["a) CDB − Certificado de Depósito Bancário.", 
        "b) FIDC − Fundo de Investimento em Direitos Creditórios.", 
        "c) Ourocap − Banco do Brasil.", 
        "d) BB Consórcio de Serviços.", 
        "e) PGBL − Plano Gerador de Benefício Livre."],
        "correta": "e) PGBL − Plano Gerador de Benefício Livre.",
        "explicacao": "O enunciado descreve uma previdência, de forma que o PGBL (letra “e”) se encaixa como gabarito."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) O Plano Gerador de Benefícios Livres (PGBL) é uma aplicação que tem como objetivo a complementação da aposentadoria do seu investidor. Pode-se dizer que o PGBL é bom para o empregado que possui renda tributável e declara o imposto de renda no modelo completo, pois ao investir num PGBL, tem-se restituído o Imposto de Renda (IR) retido na fonte pelo empregador sobre o valor da aplicação. <br>Como a tributação do PGBL ocorre no resgate sobre o(s) seu(s) ",
        "alternativas": ["a) rendimentos, o IR é postergado, mas não há a sua isenção.", 
        "b) rendimentos, o IR é diferido, mas não há a sua isenção.", 
        "c) rendimentos, há isenção do IR.", 
        "d) valor integral, o IR é adiado, mas não há a sua isenção.", 
        "e) valor integral, há isenção do IR."],
        "correta": "d) valor integral, o IR é adiado, mas não há a sua isenção.",
        "explicacao": "No PGBL, a tributação ocorre sobre o valor total, no resgate ou recebimento das parcelas do benefício. Vamos aproveitar para firmar bem isso? <br>O PGBL tem como principal benefício a possibilidade de ter suas contribuições abatidas do imposto de renda, em até 12% da renda bruta tributável. <br>Para tanto, é preciso ser contribuinte do regime geral da previdência e optar pela declaração completa de imposto de renda. <br>Além disso, durante a fase de acumulação (pagamento de contribuições), não há cobrança de Imposto de Renda (até 12% da renda). A cobrança ocorre apenas no resgate, incidindo sobre toda a quantia total resgatada ou sobre as parcelas recebidas como renda."
      },
      {
        "pergunta": "(2015/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Uma cliente bancária está decidida a contratar um plano de previdência privada para si. No entanto, ela está em dúvida se seu perfil está mais adequado ao “Plano Gerador de Benefício Livre” – PGBL ou ao “Vida Gerador de Benefício Livre” - VGBL. <br>Sabendo que a cliente é solteira e que sempre estará isenta de imposto de renda, a escolha adequada seria o",
        "alternativas": ["a) PGBL, pois ela não conta com a vantagem fiscal do VGBL.", 
        "b) VGBL, pois ela não conta com a vantagem fiscal do PGBL.", 
        "c) PGBL, pois ela declara seu imposto de renda no modelo simplificado.", 
        "d) PGBL, pois ela declara seu imposto de renda no modelo completo.", 
        "e) VGBL, pois ela declara seu imposto de renda no modelo completo."],
        "correta": "b) VGBL, pois ela não conta com a vantagem fiscal do PGBL.",
        "explicacao": "Como ela é isenta de pagamento de IR sobre seus rendimentos, ela não conta com a vantagem de abatimento do PGBL, sendo o VGBL a melhor opção."
      },
      {
        "pergunta": "(2013/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Os planos de previdência PGBL (Plano Gerador de Benefício Livre) e VGBL (Vida Gerador de Benefício Livre) são produtos de Previdência Complementar que visam à acumulação de recursos e à transformação de tais recursos em uma renda futura. <br>Na modalidade PGBL, o imposto de renda incide sobre o",
        "alternativas": ["a) ganho das aplicações financeiras.", 
        "b) valor futuro calculado para a data do resgate.", 
        "c) total resgatado ou recebido como renda.", 
        "d) total de rendimentos bruto na data da aplicação.", 
        "e) valor da aplicação inicial."],
        "correta": "c) total resgatado ou recebido como renda.",
        "explicacao": "No PGBL, a tributação ocorre sobre o valor total, no resgate ou recebimento das parcelas do benefício. Vamos aproveitar para firmar bem isso? <br>O PGBL tem como principal benefício a possibilidade de ter suas contribuições abatidas do imposto de renda, em até 12% da renda bruta tributável. <br>Para tanto, é preciso ser contribuinte do regime geral da previdência e optar pela declaração completa de imposto de renda. <br>Além disso, durante a fase de acumulação (pagamento de contribuições), não há cobrança de Imposto de Renda (até 12% da renda). A cobrança ocorre apenas no resgate, incidindo sobre toda a quantia total resgatada ou sobre as parcelas recebidas como renda."
      },
      {
        "pergunta": "(2012/FCC/BANESE/Técnico Bancário) Do sistema de previdência complementar brasileiro fazem parte as entidades fechadas de previdência privada que são ",
        "alternativas": ["a) fundos de pensão para funcionários de uma empresa ou grupo de empresas.", 
        "b) garantidoras dos planos de Vida Gerador de Benefício Livre (VGBL).", 
        "c) exclusivas para trabalhadores de empresas de capital nacional.", 
        "d) planos estruturados como Fundo Gerador de Benefício Livre (PGBL).", 
        "e) vinculadas ao Ministério do Trabalho e Emprego."],
        "correta": "a) fundos de pensão para funcionários de uma empresa ou grupo de empresas.",
        "explicacao": "As entidades fechadas organizam os fundos de pensão para funcionários de uma empresa ou grupo de empresas, ou seja, previdência complementar fechada. A letra “a” é nosso gabarito. <br>Nas letras “b” e “d” temos previdências abertas, ou seja, assunto para as entidades abertas. <br>Em “c” temos uma vedação que não existe. Nada impede que uma empresa de capital estrangeiro (como o Santander ou a Chevrolet) instituam um fundo de pensão para seus funcionários. <br>Por fim, o erro em “e” é simples: por serem entidades de regime privado, não há vinculação com qualquer ministério. "
      },
      {
        "pergunta": "(2013/CESGRANRIO/BASA/Técnico Bancário) Os títulos de capitalização são um investimento com uma característica de poupança a longo prazo remunerados pela TR mais uma taxa de juros ao mês, equiparando-se à inflação. Porém, a característica mais atrativa dos títulos de capitalização é a ",
        "alternativas": ["a) possibilidade de resgate dos valores com rentabilidade acima do mercado.", 
        "b) garantia oferecida para compra de bens imóveis.", 
        "c) geração de créditos fiscais para abatimentos futuros.", 
        "d) rentabilidade diferenciada oferecida na ocasião do resgate.", 
        "e) possibilidade de ganhos de prêmios em dinheiro pelos sorteios periódicos."],
        "correta": "e) possibilidade de ganhos de prêmios em dinheiro pelos sorteios periódicos.",
        "explicacao": "<br>a) possibilidade de resgate dos valores com rentabilidade acima do mercado. <br>Que mercado? De toda forma, a rentabilidade da capitalização perde até para a poupança, uma vez que parte dos recursos é destinado aos prêmios, sequer sendo aplicada. <br>b) garantia oferecida para compra de bens imóveis. <br>Errado. Aqui a questão tenta confundir com a capitalização da modalidade “instrumento de garantia”, que serve para contrato de aluguel, e não de compra. <br>c) geração de créditos fiscais para abatimentos futuros. <br>Errado. Abatimento fiscal é algo fora do escopo do edital, mas apenas para contextualizar, as empresas que pagam vales-alimentação para seus funcionários podem abater esses valores nos impostos que paga. <br>d) rentabilidade diferenciada oferecida na ocasião do resgate. <br>Errado. Sinceramente, não sei o que a alternativa quis dizer. A capitalização possui mesmo rentabilidade diferenciada conforme o momento do resgate antecipado, conforme o prazo de vigência, como vimos nesta tabela:"
      },
      {
        "pergunta": "(2013/CESGRANRIO/BANCO DO BRASIL/Escriturário - Agente Comercial) Os títulos de capitalização são emitidos pelas sociedades de capitalização e têm por objeto o depósito periódico de prestações pecuniárias pelo contratante, o qual terá, depois de cumprido o prazo contratado, os direitos de concorrer a sorteio de prêmios em dinheiro e o de",
        "alternativas": ["a) resgatar o valor do título mediante lance em leilões periódicos.", 
        "b) resgatar parte dos valores depositados corrigidos por uma taxa de juros.", 
        "c) aplicar parte dos recursos em ações das bolsas de valores.", 
        "d) concorrer a imóveis nos feirões da casa própria.", 
        "e) concorrer a prêmios em barras de ouro."],
        "correta": "b) resgatar parte dos valores depositados corrigidos por uma taxa de juros.",
        "explicacao": "<br>a) resgatar o valor do título mediante lance em leilões periódicos. <br>Errado. O que é isso? Parece uma mistura de consórcio com capitalização. Fato é que não existe essa possibilidade de dar lances num título de capitalização. <br>c) aplicar parte dos recursos em ações das bolsas de valores. <br>Errado. Parece-me que a alternativa quer tentar confundir com fundo de investimento ou previdência complementar. <br>d) concorrer a imóveis nos feirões da casa própria. <br>Errado. Esses feirões são realizados pela Caixa para venda (e não sorteio) de imóveis. De toda forma, sem relação com capitalização. <br>e) concorrer a prêmios em barras de ouro. <br>Errado. Os prêmios até podem ser em barras de ouro (em certificados, para ser mais preciso), mas aí a sentença ficaria “(...) os direitos de concorrer a sorteio de prêmios em dinheiro e o de concorrer a prêmios em barras de ouro“. E isso não descreve a capitalização. Ao menos, não tão bem quanto a letra “b”."
      },
      {
        "pergunta": "(2006/FCC/BANCO DO BRASIL/Escriturário - Agente Comercial) A parcela de cada pagamento de um Título de Capitalização que será restituída ao investidor no final do plano é",
        "alternativas": ["a) a quota de carência.", 
        "b) o prêmio.", 
        "c) a reserva técnica.", 
        "d) a quota de administração.", 
        "e) a quota de capitalização (ou provisão matemática)."],
        "correta": "e) a quota de capitalização (ou provisão matemática).",
        "explicacao": "A parcela de cada pagamento que será restituída (com juros) para o investidor, ou melhor, para o subscritor, é a quota de capitalização. Assim, apesar de meio incompleta, está correta a letra “e”. <br>Não existe quota de carência (a), existe prazo de carência, que é o tempo mínimo que o capital fica indisponível para resgate. <br>O prêmio (b), no contexto da capitalização, é aquilo a que os subscritores concorrem nos sorteios. (no contexto do seguro é aquilo que os segurados pagam. Confuso, né?) <br>A reserva técnica (c) aplica-se a seguros, e é a parte dos prêmios que é investida para garantir a cobertura das indenizações. <br>Por fim, a quota de administração (d) pode ser um nome para a quota de carregamento: percentual da contribuição destinado aos custos de despesas com corretagem, colocação e administração do título de capitalização, emissão, divulgação, lucro da sociedade de capitalização e eventuais despesas relativas ao custeio da contemplação obrigatória e da distribuição de bônus. "
      },
      {
        "pergunta": "(2012/CESGRANRIO/CAIXA ECONÔMICA FEDERAL/Técnico Bancário) As Sociedades de Capitalização são entidades constituídas sob a forma de sociedades anônimas, que negociam contratos, denominados títulos de capitalização. <br>Esses títulos têm por objeto a(o)",
        "alternativas": ["a) aquisição de ações de empresas privadas, para investimento em longo prazo, com opção de realizar a venda dessas ações a qualquer tempo.", 
        "b) compra parcelada de um bem em que um grupo de participantes, organizados por uma empresa administradora, rateia o valor do bem desejado pelos meses de parcelamento.", 
        "c) compra de títulos públicos ou privados, mediante depósitos mensais em dinheiro, que serão capitalizados a uma determinada taxa de juros até o final do contrato.", 
        "d) investimento em títulos públicos do governo federal, no qual o investidor poderá optar pelo resgate do Fundo de Garantia (FGTS) ou pelo pagamento em dinheiro.", 
        "e) depósito periódico de prestações pecuniárias pelo contratante, o qual terá o direito de resgatar parte dos valores corrigidos e de concorrer a sorteios de prêmios em dinheiro."],
        "correta": "e) depósito periódico de prestações pecuniárias pelo contratante, o qual terá o direito de resgatar parte dos valores corrigidos e de concorrer a sorteios de prêmios em dinheiro.",
        "explicacao": "Os títulos de capitalização estão corretamente descritos na letra “e”."
      },
      {
        "pergunta": "(2019/FCC/BANRISUL/Escriturário) Frequentemente ofertados aos clientes das redes bancárias, os títulos de capitalização proporcionam",
        "alternativas": ["a) garantia da instituição financeira emissora.", 
        "b) isenção de imposto de renda sobre o valor resgatado que exceda à aplicação.", 
        "c) prazo de validade igual ou superior a seis meses na modalidade tradicional.", 
        "d) possibilidade de transferência durante a vigência, de uma pessoa para outra.", 
        "e) a opção, pelo subscritor, da emissão “ao portador”."],
        "correta": "d) possibilidade de transferência durante a vigência, de uma pessoa para outra.",
        "explicacao": "Vejamos cada uma das alternativas: <br>a) garantia da instituição financeira emissora. <br>Errado. Quem emite títulos de capitalização são as Sociedades de Capitalização, que não são instituições financeiras. <br>b) isenção de imposto de renda sobre o valor resgatado que exceda à aplicação. <br>Errado. Há incidência de imposto de renda, tanto sobre rendimentos que excederem o valor aplicado, quanto sobre as premiações. <br>c) prazo de validade igual ou superior a seis meses na modalidade tradicional. <br>Errado. A vigência mínima é de 12 meses. <br>d) possibilidade de transferência durante a vigência, de uma pessoa para outra. <br>Certo! O subscritor pode negociar seus títulos livremente, comunicando à sociedade emissora. <br>e) a opção, pelo subscritor, da emissão “ao portador”. <br>Errado. Os títulos de capitalização são nominativos, ou seja, deve constar expressamente quem é o subscritor."
      },
      {
        "pergunta": "(2019/IADES/BRB/Escriturário) A pesquisa Febraban de Tecnologia Bancária 2019 revelou que, entre 2017 e 2018, as transações realizadas por meio de canais digitais cresceram 16%, totalizando 60% das transações bancárias. A respeito do uso dos canais digitais, assinale a alternativa correta.",
        "alternativas": ["a) O aumento das transações com movimentação financeira nos canais digitais evidencia o aumento da confiança do cliente na segurança do canal.", 
        "b) A abertura de conta por meio de canal digital somente pode ser efetuada pelo internet banking.", 
        "c) O mobile banking somente pode ser usado para transações sem movimentação financeira. ", 
        "d) São considerados canais digitais o internet banking, o mobile banking e os correspondentes no País.", 
        "e) Internet banking e mobile banking são canais digitais mutuamente excludentes, ou seja, o cliente tem que informar ao banco qual canal quer usar para acessar as transações bancárias."],
        "correta": "a) O aumento das transações com movimentação financeira nos canais digitais evidencia o aumento da confiança do cliente na segurança do canal.",
        "explicacao": "A alternativa “a” contém, de fato, a conclusão da Febraban a respeito do dado, que podemos considerar bastante aceitável."
      },
      {
        "pergunta": "(SP/Auditor Municipal de Controle Interno) A Lei Complementar nº 105/2001 dispõe sobre o sigilo das operações de instituições financeiras. Nos moldes da referida lei, entretanto, o sigilo quanto a contas de depósitos, aplicações e investimentos mantidos em instituições financeiras não pode ser oposto, considerando sua função de fiscalização,",
        "alternativas": ["a) ao Governo Federal", 
        "b) aos Fiscos Estadual e Federal.", 
        "c) à Administração Pública.", 
        "d) ao Banco Central do Brasil.", 
        "e) à Polícia Federal."],
        "correta": "d) ao Banco Central do Brasil.",
        "explicacao": "Os fiscalizadores são o Banco Central do Brasil e Comissão de Valores Mobiliários"
      },
      {
        "pergunta": "(BRDE/Analista de Projetos) Analise as assertivas e assinale a alternativa que aponta as corretas. São consideradas instituições financeiras, para os efeitos da Lei Complementar nº 105/2021, que trata sobre o Sigilo Bancário:<br>I. os bancos de qualquer espécie.<br>II. administradoras de cartões de crédito.<br>III. cooperativas de crédito.<br>IV. associações de poupança e empréstimo.",
        "alternativas": ["a) Apenas I e III.", 
        "b) Apenas II, III e IV.", 
        "c) Apenas I, II e III.", 
        "d) Apenas II e IV.", 
        "e) Apenas I, II, III e IV."],
        "correta": "e) Apenas I, II, III e IV.",
        "explicacao": ""
      },
      {
        "pergunta": "(CEF/Advogado) Nos termos da lei complementar que regula o sigilo das informações guardadas pelas instituições financeiras, considera-se quebra de sigilo a(o)",
        "alternativas": ["a) troca de informações entre instituições financeiras, para fins cadastrais, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.", 
        "b) comunicação, às autoridades competentes, da prática de ilícitos penais ou administrativos, abrangendo o fornecimento de informações sobre operações que envolvam recursos provenientes de qualquer prática criminosa.", 
        "c) revelação de informações sigilosas sem o consentimento expressos dos interessados.", 
        "d) fiscalização pelo Banco Central do Brasil dos atos ilícitos praticados pelos diretores de instituições financeiras.", 
        "e) forneco,emtp de informações constantes de cadastro de emitentes de cheques sem provisão de fundos e de devedores inadimplentes a entidades de proteção ao crédito, observadas as normais baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil;"],
        "correta": "c) revelação de informações sigilosas sem o consentimento expressos dos interessados.",
        "explicacao": ""
      },
      {
        "pergunta": "(Banco Central do Brasil/Analista) A quebra de sigilo bancário, fora das hipóteses autorizadas na Lei Complementar nº 105/01, ",
        "alternativas": ["a) constitui crime e sujeita o responsável a pena de detenção, excluída qualquer outra sanção.", 
        "b) apenas sujeita o servidor público a responder pelos danos decorrentes.", 
        "c) constitui contravenção apenadas com prisão simples.", 
        "d) não constitui crime, sujeitando o responsável a sanções administrativas e civis.", 
        "e) constitui crime e sujeita o responsável a pena de reclusão, sem prejuízo de outras sanções."],
        "correta": "e) constitui crime e sujeita o responsável a pena de reclusão, sem prejuízo de outras sanções.",
        "explicacao": "É crime e sujeita o responsável a pena de reclusão."
      },
      {
        "pergunta": "(2015/VUNESP/CM ARARAS/Analista Financeiro e Orçamentário) Em conformidade com art. 1º da Lei Complementar n.º 105/2001, as instituições financeiras conservarão sigilo em suas operações ",
        "alternativas": ["a) apenas ativas e passivas e estará subordinado ao escopo desta lei o Banco Central do Brasil, em relação às operações que realizar e às informações que obtiver no exercício de suas atribuições.", 
        "b) apenas ativas e serviços prestados.", 
        "c) apenas passivas e serviços prestados.", 
        "d) ativas e passivas e serviços prestados.", 
        "e) ativas e passivas e não estarão subordinadas ao escopo desta lei as empresas de fomento comercial ou factoring."],
        "correta": "d) ativas e passivas e serviços prestados.",
        "explicacao": "As empresas devem conservar o sigilo em suas operações ativas e passivas e serviços prestados."
      },
      {
        "pergunta": "(2015/VUNESP/CM ARARAS/Analista Financeiro e Orçamentário) Em conformidade com art. 1º da Lei Complementar n.º 105/2001, as instituições financeiras conservarão sigilo em suas operações ",
        "alternativas": ["a) apenas ativas e passivas e estará subordinado ao escopo desta lei o Banco Central do Brasil, em relação às operações que realizar e às informações que obtiver no exercício de suas atribuições.", 
        "b) apenas ativas e serviços prestados.", 
        "c) apenas passivas e serviços prestados.", 
        "d) ativas e passivas e serviços prestados.", 
        "e) ativas e passivas e não estarão subordinadas ao escopo desta lei as empresas de fomento comercial ou factoring."],
        "correta": "d) ativas e passivas e serviços prestados.",
        "explicacao": "As empresas devem conservar o sigilo em suas operações ativas e passivas e serviços prestados."
      },
      {
        "pergunta": "(2020/CEBRASPE-CESPE/MPE-CE/Promotor de Justiça) De acordo com a Lei Complementar n.º 105/2001, as instituições financeiras devem conservar o sigilo de suas operações, sendo uma violação desse dever",
        "alternativas": ["a) a revelação de informações sigilosas, ainda que com o consentimento expresso do interessado.", 
        "b) a comunicação, às autoridades competentes, da prática de ilícitos penais ou administrativos, sem ordem judicial.", 
        "c) a troca de informações entre instituições financeiras, para fins cadastrais, ainda que observadas as normas do Banco Central e do Conselho Monetário Nacional.", 
        "d) o fornecimento, a gestores de bancos de dados, de informações financeiras relativas a operações de crédito adimplidas, para formação de histórico de crédito.", 
        "e) a transferência, à autoridade tributária, de informações relativas a operações com cartão de crédito que permitam identificar a natureza dos gastos efetuados."],
        "correta": "e) a transferência, à autoridade tributária, de informações relativas a operações com cartão de crédito que permitam identificar a natureza dos gastos efetuados.",
        "explicacao": "Isso seria violação do sigilo, pois é vedada a inserção de qualquer elemento que permita identificar a sua origem ou a natureza dos gastos nas informações concedidas à administração tributária."
      },
      {
        "pergunta": "((2012/AOCP/BRDE/Banco de Desenvolvimento do ES/Analista de Projetos) Analise as assertivas e assinale a alternativa que aponta as corretas. De acordo com a Lei Complementar n.º 105/2001 que trata sobre o Sigilo Bancário, NÃO constitui violação do dever de sigilo<br>I. a troca de informações entre instituições financeiras, para fins cadastrais, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil. <br>II. o fornecimento de informações constantes de cadastro de emitentes de cheques sem provisão de fundos e de devedores inadimplentes, a entidades de proteção ao crédito, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.<br>III. a comunicação, às autoridades competentes, da prática de ilícitos penais ou administrativos, abrangendo o fornecimento de informações sobre operações que envolvam recursos provenientes de qualquer prática criminosa.<br>IV. a revelação de informações sigilosas sem o consentimento expresso dos interessados.",
        "alternativas": ["a) Apenas I e III.", 
        "b) Apenas II, III e IV.", 
        "c) Apenas I, II e III.", 
        "d) Apenas II e IV.", 
        "e) I, II, III e IV."],
        "correta": "c) Apenas I, II e III.",
        "explicacao": "Entre os itens listados, apenas a revelação de informações sigilosas sem o consentimento expresso dos interessados (Item IV) constitui violação do sigilo, tornando a letra “c” nosso gabarito."
      },
      {
        "pergunta": "(2019/IADES/BANCO DE BRASÍLIA/Advogado) Nos contratos bancários, de acordo com o que determina a lei, as instituições financeiras conservarão sigilo em suas operações ativas e passivas e nos serviços prestados. No entanto, segundo a lei, não constitui violação do dever de sigilo.",
        "alternativas": ["a) a troca de informações entre instituições financeiras, para fins cadastrais e de oferta de serviços e produtos, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.", 
        "b) a comunicação às autoridades competentes da prática de ilícitos penais, civis e (ou) administrativos, abrangendo o fornecimento de informações acerca de operações que envolvam recursos provenientes de qualquer prática criminosa.", 
        "c) o fornecimento de informações constantes de cadastro de emitentes de cheques sem provisão de fundos e de devedores inadimplentes a entidades de proteção ao crédito, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.", 
        "d) a revelação de informações não sigilosas com o consentimento expresso dos interessados.", 
        "e) o fornecimento de dados financeiros e de pagamentos relativos a operações de crédito e obrigações de pagamento adimplidas ou em andamento de pessoas naturais ou jurídicas, a qualquer interessado, para formação de histórico de crédito, nos termos de lei específica."],
        "correta": "c) o fornecimento de informações constantes de cadastro de emitentes de cheques sem provisão de fundos e de devedores inadimplentes a entidades de proteção ao crédito, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.",
        "explicacao": "Entre os itens listados, apenas a revelação de informações sigilosas sem o consentimento expresso dos interessados (Item IV) constitui violação do sigilo, tornando a letra “c” nosso gabarito."
      },
      {
        "pergunta": "(2019/IADES/BANCO DE BRASÍLIA/Advogado) [adaptada] Acerca da Lei Complementar no 105/2001, que dispõe quanto ao sigilo das operações de instituições financeiras, assinale a alternativa correta.",
        "alternativas": ["a) O dever de sigilo não é aplicável à BRB Distribuidora de Títulos e Valores Mobiliários, tendo em vista que ela não é considerada instituição financeira.", 
        "b) O Fisco não pode requisitar diretamente ao BRB informações a respeito da movimentação bancária dos respectivos clientes, independentemente de autorização judicial.", 
        "c) Mediante a decisão fundamentada do respectivo presidente, uma CPI da Câmara Legislativa do Distrito Federal pode requisitar ao BRB informações a respeito da movimentação bancária de clientes da instituição financeira.", 
        "d) As informações fornecidas à administração tributária devem ficar restritas a informes relacionados com a identificação dos titulares das operações e os montantes globais mensalmente movimentados.", 
        "e) O dever de sigilo não é aplicável às empresas de fomento mercantil (factoring), tendo em vista que elas não são consideradas instituições financeira ."],
        "correta": "d) As informações fornecidas à administração tributária devem ficar restritas a informes relacionados com a identificação dos titulares das operações e os montantes globais mensalmente movimentados.",
        "explicacao": "Entre os itens listados, apenas a revelação de informações sigilosas sem o consentimento expresso dos interessados (Item IV) constitui violação do sigilo, tornando a letra “c” nosso gabarito."
      },
      {
        "pergunta": "(2019/MPE-SC/Promotor de Justiça) As sociedades de arrendamento mercantil são consideradas instituições financeiras, para os efeitos da Lei Complementar n. 105/2001, constituindo violação do dever de sigilo a troca de informações sigilosas com o consentimento expresso dos interessados.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Se houver consentimento, não há violação. Simples assim. (lembre-se do open banking)"
      },
      {
        "pergunta": "(2015/FCC/SEFAZ-PE/Julgador Administrativo Tributário do Tesouro Estadual) De acordo com a Lei Complementar no 105/2001, NÃO constitui violação do dever de sigilo<br>I. a troca de informações entre instituições financeiras, para fins cadastrais, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil<br>II. o fornecimento de informações constantes de cadastro de emitentes de cheques sem provisão de fundos e de devedores inadimplentes, a entidades de proteção ao crédito, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil.<br>III. a comunicação, às autoridades competentes, da prática de ilícitos penais ou administrativos, abrangendo o fornecimento de informações sobre operações que envolvam recursos provenientes de qualquer prática criminosa.<br>Está correto o que se afirma em",
        "alternativas": ["a) I, II e III.", 
        "b) I, apenas.", 
        "c) II, apenas.", 
        "d) I e II, apenas.", 
        "e) III, apenas."],
        "correta": "a) I, II e III.",
        "explicacao": "Nesse caso, todas as hipóteses trazidas estão listadas como exceção na LC 105/2001."
      },
      {
        "pergunta": "(2015/FUNDATEC/BRDE/Banco de Desenvolvimento do ES/Analista de Projetos) De acordo com o Art. 5º da Lei Complementar nº 105/2001, o Poder Executivo disciplinará, inclusive quanto à periodicidade e aos limites de valor, os critérios segundo os quais as instituições financeiras informarão à administração tributária da União, as operações financeiras efetuadas pelos usuários de seus serviços. Consideram-se operações financeiras, para os efeitos desse artigo:<br>I. Contratos de mútuo. <br>II. Aquisições de moeda estrangeira.<br>III. Operações de arrendamento mercantil.<br>IV. Operações com cartão de crédito.<br>V. Conversões de moeda estrangeira em moeda nacional. <br>VI. Operações com ouro. <br>Quais estão corretas? ",
        "alternativas": ["a) Apenas I, III e V.", 
        "b) Apenas I, III e VI.", 
        "c) Apenas IV, V e VI.", 
        "d) Apenas I, II, III e V.", 
        "e) I, II, III, IV, V e VI."],
        "correta": "e) I, II, III, IV, V e VI.",
        "explicacao": "Todas os itens estão previstos como operações financeiras para fins de fornecimento de informações ao fisco."
      },
      {
        "pergunta": "(2006/ESAF/CGU/Analista de Finanças e Controle) A quebra do sigilo das operações ativas e passivas das instituições financeiras pode ser decretada, quando necessária para apuração de qualquer ilícito, especialmente nos seguintes casos de crime: <br>I. contra o sistema financeiro nacional. <br>II. contra a Administração Pública. <br>III. enriquecimento ilícito <br>IV. praticado por organização criminosa. <br>V. lavagem de dinheiro. <br>Estão corretas",
        "alternativas": ["a) as afirmativas I, II, III, IV e V.", 
        "b) apenas as afirmativas I, II, III e IV.", 
        "c) apenas as afirmativas II, III, IV e V.", 
        "d) apenas as afirmativas I, II, IV e V.", 
        "e) apenas as afirmativas I, II, III e V."],
        "correta": "d) apenas as afirmativas I, II, IV e V.",
        "explicacao": "não consta nada sobre (III) enriquecimento ilícito. Embora seja uma possibilidade, não está na lista do “especialmente” trazida pela lei."
      },
      {
        "pergunta": "(2006/FCC/PC-MA/Delegado de Polícia) Dentre outras situações e de acordo com a Lei Complementar nº 105/01, a troca de informações entre instituições financeiras, para fins cadastrais, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil,",
        "alternativas": ["a) constitui contravenção penal e ilícito administrativo.", 
        "b) constitui crime e sujeita os responsáveis à pena de reclusão e multa.", 
        "c) constitui crime e sujeita os responsáveis à pena de prisão simples.", 
        "d) constitui crime e sujeita os responsáveis à pena de detenção e multa.", 
        "e) não constitui violação do dever de sigilo."],
        "correta": "e) não constitui violação do dever de sigilo.",
        "explicacao": "Apesar de ser uma questão para delegado, observe que é simples: a troca de informações entre instituições financeiras, para fins cadastrais, inclusive por intermédio de centrais de risco, observadas as normas baixadas pelo Conselho Monetário Nacional e pelo Banco Central do Brasil, não constitui violação do dever de sigilo. "
      }
    ],





    "bancoDeDados": [
      {
        "pergunta": "(CESPE / SEFAZ-SE – 2022) As técnicas de controle de concorrência são usadas para garantir a propriedade de não interferência ou isolamento das transações executadas simultaneamente. Algumas das principais técnicas usadas para controlar a execução concorrente de transações são baseadas no conceito de bloqueio de itens de dados. <br>Considerando os tipos de bloqueios, assinale a opção que contém o esquema de bloqueio que possui dois estados — bloqueado e desbloqueado — e que é considerado muito restritivo para itens de banco de dados, porque no máximo uma transação pode manter um bloqueio em determinado item.",
        "alternativas": [
          "bloqueios compartilhados",
          "bloqueios binários",
          "bloqueios exclusivos",
          "bloqueio em duas fases conservador",
          "bloqueio em duas fases básico"
        ],
        "correta": "bloqueios binários",
        "explicacao": "<br>(a) Errado. Bloqueios compartilhados permitem que um item de dado seja acessado por mais de uma transação para leitura; <br>(b) Correto. Bloqueios binários são simples, mas também muito restritivos para fins de controle de concorrência e, portanto, não são muito utilizados na prática – ele pode ter dois estados ou valores: bloqueado e desbloqueado. Se o valor do bloqueio em X for 1, o item não pode ser acessado. Se for 0, o item pode ser acessado quando solicitado; <br>(c) Errado. Bloqueios compartilhados são sinônimos de bloqueios exclusivos; <br>(d) Errado. Esse tipo de bloqueio bloqueia todos os itens aos quais terá acesso, antes de iniciar o seu processamento. Se algum dos itens não puder ser bloqueado, a transação não bloqueia nenhum item e espera até que todos os itens estejam disponíveis para bloqueio; <br>(e) Errado. Esse tipo de bloqueio é utilizado para garantir escalonamentos serializáveis – as operações de bloqueio e desbloqueio nas transações devem seguir protocolos (Ex: Two-Phase Locking)."
      },
      {
        "pergunta": "(CESPE / Polícia Federal – 2021) Em um sistema gerenciador de banco de dados, as restrições de integridade garantem que os dados possam ser armazenados, consultados e utilizados com confiabilidade. ",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! O objetivo das restrições de integridade é garantir a exatidão e a consistência dos dados em um banco de dados relacional, de tal forma que eles possam ser armazenados, consultados e utilizados com confiabilidade. "
      },
      {
        "pergunta": "(CESPE / Polícia Federal – 2021) Atomicidade refere-se à propriedade de um sistema gerenciador de banco de dados (SGBD) que garante que os dados armazenados sejam indivisíveis. ",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Atomicidade refere-se à propriedade que garante que os dados armazenados as transações sejam indivisíveis. Existe o conceito de atributo simples ou atômico, mas isso ocorre dentro do contexto de modelagem conceitual e, não, no contexto de um Sistema Gerenciador de Banco de Dados (SGBD). O gabarito preliminar veio como errado, mas a banca anulou no definitivo. Eu discordo, mas vida que segue...  "
      },
      {
        "pergunta": "(CESPE / APEX-BRASIL – 2021) Assinale a opção em que o termo apresentado corresponde a uma sequência de instruções de consulta e(ou) atualização de banco de dados: ",
        "alternativas": ["commit", "rollback", "truncate", "transaction"],
        "correta": "transaction",
        "explicacao": "Uma Transação (Transaction) corresponde a uma sequência de instruções de consulta e(ou) atualização de banco de dados."
      },
      {
        "pergunta": "(CESPE / ME – 2020) Um esquema de banco de dados é um conjunto de regras que governa um banco de dados ou todo o conjunto de objetos pertencentes a determinado usuário.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "O esquema é a descrição das regras e objetos de um banco de dados. Se pensarmos no modelo relacional, o esquema definirá nomes das colunas, seus tipos de dados e restrições de integridade."
      },
      {
        "pergunta": "(CESPE / TJ-PA – 2020) Um sistema de banco de dados proporciona a empresas o controle centralizado de todos os seus dados. O funcionamento do banco de dados baseia-se em unidades lógicas de trabalho conhecidas como:",
        "alternativas": ["entidades", "ocorrências", "registros", "tabelas", "transações"],
        "correta": "transações",
        "explicacao": "<br>(a) Errado. Esse é um conceito associado ao modelo entidade-relacionamento. As entidades representam as 'coisas' do mundo real que queremos modelar. Por exemplo: uma loja pode ter o interesse de armazenar informações dos seus clientes e dos seus produtos. Cliente e Produto são entidades do modelo; <br>(b) Errado. Uma ocorrência é uma linha da tabela (também chamada de registro); <br>(c) Errado. Um registro é uma linha da tabela (também chamado de ocorrência); <br>(d) Errado. As tabelas são estruturas compostas por linhas e colunas. São utilizadas para armazenar dados nos bancos relacionais; <br>(e) Correto. Uma transação é uma unidade lógica de trabalho que executa um conjunto de operações no banco de dados. Essas operações podem inserir, remover, modificar ou recuperar dados nas tabelas. Ao final da transação, é possível confirmar as alterações realizadas (COMMIT) ou descartar as alterações (ROLLBACK).."
      },
      {
        "pergunta": "(CESPE / TJ-AM – 2019) Uma das vantagens de utilizar sistema gerenciador de banco de dados é o fato de ele realizar o controle da redundância de dados, o que impede a ocorrência de inconsistências entre os arquivos.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "De fato, ele realiza o controle de redundância de dados. Isso impede a ocorrência de inconsistência entre os arquivos? Eu acho que o ideal seria dizer que isso evita a inconsistência, mas podemos relevar. Lembrando que, às vezes, há motivos comerciais ou técnicos plausíveis para manter várias cópias distintas dos mesmos dados (redundância controlada) como para melhorar o desempenho das consultas."
      },
      {
        "pergunta": "(CESPE / TJ-AM – 2019) Na arquitetura ANSI/SPARC de um SGBD, o nível interno trata do armazenamento físico dos dados, o nível externo trata do modo como os dados são visualizados por usuários individuais, e o nível conceitual oferece uma visão comunitária dos dados.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "<br>Perfeito! O objetivo da arquitetura de três esquemas é separar as aplicações do usuário do banco de dados físico. Nessa arquitetura, os esquemas podem ser definidos nos três níveis a seguir: <br>1. O nível interno tem um esquema interno, que descreve a estrutura do armazenamento físico do banco de dados. O esquema interno usa um modelo de dados físico e descreve os detalhes completos do armazenamento de dados e caminhos de acesso para o banco de dados. <br>2. O nível conceitual tem um esquema conceitual, que descreve a estrutura do banco de dados inteiro para uma comunidade de usuários. O esquema conceitual oculta os detalhes das estruturas de armazenamento físico e se concentra na descrição de entidades, tipos de dados, relacionamentos, operações do usuário e restrições. <br>3. O nível externo ou de visão inclui uma série de esquemas externos ou visões do usuário. Cada esquema externo descreve a parte do banco de dados em que um grupo de usuários em particular está interessado e oculta o restante do banco de dados do grupo de usuários. "
      },
      {
        "pergunta": "(CESPE / STM - 2018) O modelo conceitual, que reflete uma estrutura simplificada do banco de dados, é responsável por registrar como os dados estão armazenados no sistema de gerenciamento de banco de dados (SGBD).",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "O responsável por dizer como os dados estão armazenados no Sistema Gerenciador de Banco de Dados (SGBD) é o Modelo Físico! O Modelo Conceitual é responsável por dizer apenas quais serão os dados armazenados."
      },
      {
        "pergunta": "(CESPE / TCE-PB - 2018) A respeito de SGBD, assinale a opção correta. ",
        "alternativas": ["a) Um SGBD é um software que não prevê as funções de definição, recuperação e alteração de dados, sendo essa tarefa a função básica de um sistema de banco de dados.", 
        "b) A consistência de dados é o princípio que determina a manutenção de determinado dado em vários arquivos diferentes.", 
        "c) Conforme o princípio da atomicidade, caso ocorra erro em determinada transação, todo o conjunto a ela relacionado será desfeito até o retorno ao estado inicial, como se a transação nunca tivesse sido executada.", 
        "d) O controle de concorrência é o princípio que garante e permite a manipulação, no mesmo momento, de um mesmo dado por mais de uma pessoa ou um sistema.", 
        "e) Um SGBD, por definição, não é flexível, dada a dificuldade de mudar a estrutura dos dados quando os requisitos mudam."],
        "correta": "c) Conforme o princípio da atomicidade, caso ocorra erro em determinada transação, todo o conjunto a ela relacionado será desfeito até o retorno ao estado inicial, como se a transação nunca tivesse sido executada.",
        "explicacao": "<br>(a) Errado. Sistema de Banco de Dados = SGBD + BD e as funções de definição, recuperação e alteração de dados são de responsabilidade do SGBD; <br>(b) Errado. Quem determina a manutenção de determinado dado em vários arquivos diferentes é a redundância; <br>(c) Correto. Perfeito! Lembrem-se: uma transação atômica é uma série indivisível e irredutível de operações de banco de dados, de modo que todas elas ocorram completamente ou não ocorram; <br>(d) Errado. O controle de concorrência é na verdade um mecanismo e, não, um princípio. <br>(e) Errado. Pelo contrário, uma das maiores vantagens de um SGBD é sua flexibilidade, permitindo modificar a estrutura dos dados quando requisitos se modificam."
      },
      {
        "pergunta": "(FCC / DPE-RS – 2017) O dicionário de dados de um banco de dados relacional:",
        "alternativas": ["a) não se aplica a tabelas com pequeno número de registros.", 
        "b) não considera o armazenamento da lista de atributos chave das tabelas.", 
        "c) armazena, dentre outras informações, nomes de tabelas e de seus atributos.", 
        "d) ignora os domínios de cada atributo das tabelas.", 
        "e) somente se aplica a tabelas com grande número de atributos."],
        "correta": "c) armazena, dentre outras informações, nomes de tabelas e de seus atributos.",
        "explicacao": "<br>A definição/descrição do banco de dados fica armazenada no próprio banco de dados na forma de um catálogo ou dicionário de dados – esses dados sobre o banco de dados são chamados de metadados. Dito isso, vamos aos itens: <br>(a) Errado, aplica-se a tabelas de quaisquer quantidades de registros; <br>(b) Errado, ele considera o armazenamento de todos os atributos de uma tabela – chave ou não-chave; <br>(c) Correto, armazena diversas informações como nomes de tabelas e seus atributos; <br>(d) Errado, ele armazena os domínios de cada atributo das tabelas; <br>(e) Errado, aplica-se a tabelas de quaisquer quantidades de registros. "
      },
      {
        "pergunta": "(FCC / DPE-SP - 2015) As transações em bancos de dados distribuídos precisam preservar as propriedades conhecidas como ACID. Dentre estas propriedades está a:",
        "alternativas": ["a) Atomicidade", 
        "b) Confidencialidade", 
        "c) Autenticidade", 
        "d) Integridade", 
        "e) Disponibilidade"],
        "correta": "a) Atomicidade",
        "explicacao": "As propriedades ACID são: Atomicidade, Consistência, Isolamento e Durabilidade. A Confidencialidade, Autenticidade, Integridade e Disponibilidade são princípios fundamentais da segurança da informação e nada tem a ver com as propriedades de uma transação."
      },
      {
        "pergunta": "(FCC / SABESP - 2014) Um SGBD possui a capacidade de mudar o esquema interno sem ter de alterar o esquema conceitual, consequentemente não havendo necessidade de alteração do esquema externo. As mudanças no esquema interno podem ser necessárias para que alguns arquivos físicos possam ser reorganizados, por exemplo, pela criação de estruturas de acesso adicionais para aperfeiçoar o desempenho da recuperação ou atualização de dados.<br>Essa característica de um SGBD é denominada:",
        "alternativas": ["a) modelo lógico de dados", 
        "b) modelo físico de dados", 
        "c) independência modular", 
        "d) representação conceitual", 
        "e) independência física de dados"],
        "correta": "e) independência física de dados",
        "explicacao": "A primeira frase já mata a questão: “Um SGBD possui a capacidade de mudar o esquema interno sem ter de alterar o esquema conceitual, consequentemente não havendo necessidade de alteração do esquema externo” – trata-se da independência física de dados. Vejamos: <br> - Independência Física dos Dados: trata da capacidade de alterar o esquema interno sem ter de alterar o esquema conceitual. Logo, os esquemas externos também não precisam ser alterados. O mapeamento nível conceitual para o interno é a chave para a independência física de dados."
      },
      {
        "pergunta": "(FCC / TJ-AP – 2014) Em um determinado momento, a coleção das informações armazenadas em um banco de dados é:",
        "alternativas": ["a) o esquema desse banco de dados", 
        "b) uma instância desse banco de dados", 
        "c) um metamodelo desse banco de dados", 
        "d) o projeto geral desse banco de dados", 
        "e) uma partição desse banco de dados"],
        "correta": "b) uma instância desse banco de dados",
        "explicacao": "A coleção das informações armazenadas em um banco de dados em um determinado momento é também chamada de instância de um banco de dados. Instância (ou Estado) é o conjunto de dados armazenados no banco em um determinado momento de operação. O esquema é a descrição da estrutura dos dados; a instância são os dados em si!"
      },
      {
        "pergunta": "(FCC / TCE-AM – 2012) O modelo conceitual de dados:",
        "alternativas": ["a) é aquele em que os objetos, suas características e relacionamentos têm a representação de acordo com as regras de implementação e limitantes impostos por algum tipo de tecnologia.", 
        "b) é aquele em que os objetos, suas características e relacionamentos têm a representação fiel ao ambiente observado, independente de limitações quaisquer impostas por tecnologias, técnicas de implementação ou dispositivos físicos.", 
        "c) é aquele elaborado respeitando-se e implementando-se conceitos tais como chaves de acesso, controle de chaves duplicadas, itens de repetição (arrays), normalização, ponteiros e integridade referencial, entre outros.", 
        "d) é a fase da modelagem na qual é necessário considerar todas as particularidades de implementação, principalmente o modelo que será utilizado para a implementação futura.", 
        "e) está sempre associado às fases de projeto, contrastando com o modelo lógico, que sempre está associado à fase de análise, quando utilizado com as metodologias de desenvolvimento de sistemas e implementado por ferramentas CASE."],
        "correta": "b) é aquele em que os objetos, suas características e relacionamentos têm a representação fiel ao ambiente observado, independente de limitações quaisquer impostas por tecnologias, técnicas de implementação ou dispositivos físicos.",
        "explicacao": "<br>(a) Errado, o modelo conceitual é independente de tecnologia; <br>(b) Correto; <br>(c) Errado, o modelo conceitual não trata de conceitos como chave de acesso, controle de chaves duplicadas, arrays, normalização, entre outros; <br>(d) Errado, o modelo conceitual é um esboço, logo não precisa considerar todas as particularidades de implementação; <br>(e) Errado, é o inverso – nas fases de análise, busca-se representar o problema e nas fases de projeto, busca-se representar a solução do problema. Logo, a fase de análise está mais ligada ao modelo conceitual enquanto a fase de projeto está mais ligada ao modelo lógico. "
      },
      {
        "pergunta": "(FCC / MPE-SE – 2013) A capacidade de alterar o esquema conceitual sem mudar o esquema externo ou os programas, podendo modificar o esquema conceitual para expandir o banco de dados (adicionando um tipo de registro ou item de dados), variar as restrições ou reduzir o banco de dados (removendo um tipo de registro ou item de dados) é chamada de:",
        "alternativas": ["a) modularidade", 
        "b) modelo conceitual", 
        "c) independência lógica de dados", 
        "d) polimorfismo", 
        "e) agregação"],
        "correta": "c) independência lógica de dados",
        "explicacao": "A capacidade de alterar o esquema conceitual sem mudar o esquema externo ou os programas é chamado de independência lógica de dados. A independência lógica dos dados trata da capacidade de alterar o esquema conceitual sem precisar modificar os esquemas externos ou aplicações. O mapeamento nível externo para o conceitual é a chave para a independência lógica de dados."
      },
      {
        "pergunta": "(FCC / MPE-SE – 2013) A capacidade de alterar o esquema conceitual sem mudar o esquema externo ou os programas, podendo modificar o esquema conceitual para expandir o banco de dados (adicionando um tipo de registro ou item de dados), variar as restrições ou reduzir o banco de dados (removendo um tipo de registro ou item de dados) é chamada de:",
        "alternativas": ["a) modularidade", 
        "b) modelo conceitual", 
        "c) independência lógica de dados", 
        "d) polimorfismo", 
        "e) agregação"],
        "correta": "c) independência lógica de dados",
        "explicacao": "A capacidade de alterar o esquema conceitual sem mudar o esquema externo ou os programas é chamado de independência lógica de dados. A independência lógica dos dados trata da capacidade de alterar o esquema conceitual sem precisar modificar os esquemas externos ou aplicações. O mapeamento nível externo para o conceitual é a chave para a independência lógica de dados."
      },
      {
        "pergunta": "(FCC / TCE-SP - 2010) A propriedade das transações de um SGBD que garante: “ou todas as operações da transação são refletidas corretamente no banco de dados ou nenhuma o será” é a:",
        "alternativas": ["a) Atomicidade", 
        "b) Isolamento", 
        "c) Consistência", 
        "d) Integridade", 
        "e) Durabilidade"],
        "correta": "a) Atomicidade",
        "explicacao": "A propriedade de atomicidade estabelece que: uma transação é uma unidade de processamento atômica que deve ser executada integralmente até o fim ou não deve ser executada de maneira alguma – em conformidade com o enunciado da questão."
      },
      {
        "pergunta": "(FCC / TRT 20 - 2010) Em relação à execução de uma transação em um banco de dados, considere:<br>Para que uma transação seja efetivada, todas as ações que compõem a respectiva unidade de trabalho devem ser concluídas com sucesso. Caso contrário, a ação que constituiu falha e a transação devem ser desfeitas.<br>A afirmação refere-se a uma das quatro propriedades da integridade de uma transação,denominada:",
        "alternativas": ["a) Atomicidade", 
        "b) Isolamento", 
        "c) Durabilidade", 
        "d) Consistência", 
        "e) Efetividade"],
        "correta": "a) Atomicidade",
        "explicacao": "A questão afirma que – para que uma transação seja efetivada, todas as ações que compõem a respectiva unidade de trabalho devem ser concluídas com sucesso ou a ação que constituiu a falha e a transação devem ser desfeitas. Trata-se, evidentemente, da propriedade de atomicidade – que é a propriedade que mais cai em provas de banco de dados."
      },
      {
        "pergunta": "(FCC / TCE-SP – 2009) Considerando que os dados constituem um dos bens mais valiosos de uma empresa, é necessário que haja um papel que tenha a responsabilidade central pelos dados, principalmente entendendo as necessidades empresariais nos altos níveis da organização. Tal papel é mais adequadamente desempenhado pela:",
        "alternativas": ["a) administração de banco de dados", 
        "b) administração de dados", 
        "c) alta administração da organização", 
        "d) análise de sistemas", 
        "e) gerência de sistemas"],
        "correta": "b) administração de dados",
        "explicacao": "A questão trata da padronização dos dados corporativos. Entender a organização e sua relação com as informações de forma a gerenciar os dados de maneira eficiente é reponsabilidade da equipe de administração de dados."
      },
      {
        "pergunta": "(FCC / TCE-SP – 2009) As três visões da arquitetura básica de um SGBD, pela ordem, desde a mais próxima do usuário até a mais distante, são: ",
        "alternativas": ["a) externa, conceitual e interna", 
        "b) externa, interna e conceitual", 
        "c) conceitual, interna e externa", 
        "d) conceitual, externa e interna", 
        "e) interna, conceitual e externa"],
        "correta": "a) externa, conceitual e interna",
        "explicacao": "As três visões da arquitetura básica de um SGBD, pela ordem, desde a mais próxima do usuário até a mais distante, são externa, conceitual e interna."
      },
      {
        "pergunta": "(FGV / SEAD-AP – 2022) Os sistemas gerenciadores de bancos de dados são largamente utilizados em aplicações computacionais, pois oferecem um conjunto de propriedades importantes para a segurança e confiabilidade dos dados, conhecido pela sigla ACID. <br>O propósito da propriedade correspondente à letra I na referida sigla é:",
        "alternativas": ["a) garantir a independência dos dados em relação ao hardware empregado.", 
        "b) garantir a independência dos dados em relação ao sistema gerenciador de dados.", 
        "c) garantir o isolamento das transições quando executadas por processos concomitantes.", 
        "d) permitir a integração de diferentes gerenciadores de bancos de dados.", 
        "e) permitir a inter-relação de diferentes padrões internacionais de codificação de dados."],
        "correta": "c) garantir o isolamento das transições quando executadas por processos concomitantes.",
        "explicacao": "ACID (Atomicidade, Consistência, Isolamento e Durabilidade). O Isolamento trata do conjunto de técnicas que tentam evitar que transações paralelas interfiram umas nas outras, fazendo com que o resultado de várias transações em paralelo seja o mesmo resultado que essas transações teriam caso fossem executadas sequencialmente (uma após a outra)."
      },
      {
        "pergunta": "(FGV / TJ-RO – 2021) No contexto da implementação de bancos de dados, o acrônimo ACID denota o conjunto de propriedades que devem ser observadas por sistemas transacionais. Essas quatro propriedades são:",
        "alternativas": ["a) Amorfabilidade, Concorrência, Integridade e Durabilidade;", 
        "b) Atomicidade, Consistência, Isolamento e Durabilidade;", 
        "c) Atualização, Coesão, Inserção e Deleção;", 
        "d) Auditabilidade, Conformidade, Independência e Distribuição;", 
        "e) Automação, Concorrência, Integridade e Distribuição."],
        "correta": "b) Atomicidade, Consistência, Isolamento e Durabilidade;",
        "explicacao": "<br>[A] – Atomicidade <br>[C] – Consistência<br>[I] – Isolamento<br>[D] – Durabilidade"
      },
      {
        "pergunta": "(FGV / MPE-AL– 2018) O conjunto de programas responsável pelo gerenciamento de uma base de dados e que, entre outras funções, suporta uma linguagem de consulta, gera relatórios e disponibiliza uma interface para que os seus clientes possam incluir, alterar ou consultar dados, é chamado de:",
        "alternativas": ["a) Banco de Dados Relacional (BDR).", 
        "b) Dicionário de Dados (DD).", 
        "c) Modelo Entidade Relacionamento (MER).", 
        "d) Sistema de Suporte à Decisão (SSD).", 
        "e) Sistema Gerenciador de Bancos de Dados (SGBD)."],
        "correta": "e) Sistema Gerenciador de Bancos de Dados (SGBD).",
        "explicacao": "O conjunto de programas responsável pelo gerenciamento de uma base de dados é o Sistema Gerenciador de Bancos de Dados (SGBD)."
      },
      {
        "pergunta": "(FGV / Prefeitura de Paulínia - SP – 2016) A execução de transações de bancos de dados deve observar um conjunto de propriedades, cuja finalidade é a manutenção da integridade dos dados armazenados nas tabelas. Assinale a opção que apresenta as propriedades usualmente implementadas nos sistemas gerenciadores de bancos de dados:",
        "alternativas": ["a) Independência de dados e integridade referencial.", 
        "b) Manutenção de logs e extração de backups.", 
        "c) Segurança, criptografia e sigilo.", 
        "d) Atomicidade, durabilidade, consistência e isolamento.", 
        "e) Performance, segurança e escalabilidade."],
        "correta": "d) Atomicidade, durabilidade, consistência e isolamento.",
        "explicacao": "As propriedades de transações usualmente implementadas nos sistemas gerenciadores de bancos de dados são: ACID (Atomicidade, Consistência, Isolamento e Durabilidade). "
      },
      {
        "pergunta": "(FGV / DPE-RJ – 2014) A sigla DBA é usualmente empregada para designar um profissional que é responsável: ",
        "alternativas": ["a) pela administração, instalação, configuração e monitoramento de instalações de bancos de dados.", 
        "b) pela concepção, desenvolvimento e implantação de sistemas gerenciadores de bancos de dados.", 
        "c) pelo processo de coleta e exploração de dados para geração de novos conhecimentos.", 
        "d) pelo teste e manutenção de sistemas WEB construídos sob a égide de metodologias ágeis.", 
        "e) pelo treinamento e certificação para utilização de gerenciadores de bancos de dados."],
        "correta": "a) pela administração, instalação, configuração e monitoramento de instalações de bancos de dados.",
        "explicacao": "<br>(a) Correto;<br>(b) Errado, quem concebe, desenvolve e implanta SGBD é o programador da empresa produtora do SGBD; <br>(c) Errado, não faz qualquer sentido; <br>(d) Errado, também não faz o mínimo sentido; <br>(e) Errado, ele não é responsável por treinamento e certificação para utilização de gerenciadores de bancos de dados."
      },
      {
        "pergunta": "(FGV / AL-MT – 2013) Características que distinguem a abordagem de bancos de dados relacionais e centralizados da abordagem tradicional, baseada em processamento de arquivos, estão listadas a seguir à exceção de uma. Assinale-a. ",
        "alternativas": ["a) Compartilhamento de dados e processamento de transações multiusuários.", 
        "b) Suporte para múltiplas visões de dados.", 
        "c) Isolamento entre os programas e os dados.", 
        "d) Dados são armazenados e tratados somente como cadeias de caracteres.", 
        "e) Natureza autodescritiva do sistema de bancos de dados."],
        "correta": "d) Dados são armazenados e tratados somente como cadeias de caracteres.",
        "explicacao": "A penúltima opção não está no rol das quatro características, portanto está errada."
      },
      {
        "pergunta": "(FGV / AL-MT – 2013) O modelo de dados abstrato que descreve a estrutura de um banco de dados de forma independente de um SGBD chama-se modelo:",
        "alternativas": ["a) lógico", 
        "b) conceitual", 
        "c) físico", 
        "d) algorítmico", 
        "e) funcional"],
        "correta": "b) conceitual",
        "explicacao": "Se é independente de um SGBD, trata-se do Modelo Conceitual."
      },
      {
        "pergunta": "(FGV / BADESC - 2010) A arquitetura de um SGBD ou a arquitetura de um sistema de banco de dados, também denominada de arquitetura ANSI/SPARC em três níveis, determina que um SGBD descreva como os dados devem ser armazenados e acessados e conter estes mesmos dados de fato armazenados.<br>As terminologias desta arquitetura que contêm essas descrições e os dados de fato armazenados, são respectivamente:",
        "alternativas": ["a) esquema físico e nível físico.", 
        "b) nível físico e esquema físico.", 
        "c) nível físico e esquema conceitual.", 
        "d) nível conceitual e esquema físico.", 
        "e) nível conceitual e esquema conceitual."],
        "correta": "a) esquema físico e nível físico.",
        "explicacao": "A terminologia que contém a descrição do banco de dados é o esquema; já a terminologia que contém os dados de fato armazenados é o nível físico/interno; a descrição respectiva do nível físico é o esquema físico/interno."
      },
      {
        "pergunta": "(FGV / SEFAZ-RJ – 2008) No funcionamento de um sistema de gerenciamento de banco de dados, uma situação de falha ocorre quando dois usuários tentam alterar, simultaneamente, um mesmo registro. Por exemplo, no caso de dois clientes de uma empresa de cartões de crédito tentarem realizar, num dado instante, a liquidação de um mesmo boleto da mesma fatura, um deles receberá uma mensagem de falha. A situação descrita é conhecida por:",
        "alternativas": ["a) Multlock", 
        "b) Crashing", 
        "c) Overlock", 
        "d) Locking", 
        "e) Deadlock"],
        "correta": "e) Deadlock",
        "explicacao": "Questão extremamente polêmica! Um lock ocorre quando um processo bloqueia/trava um determinado registro para que ele não seja alterado por outra transação. Já um deadlock ocorre quando há um lock mútuo, isto é, dois ou mais processos bloqueiam/travam um ao outro, resultando em um impasse porque ambos esperam a liberação um do outro. Ocorre que a questão menciona no exemplo que somente um dos clientes recebeu uma mensagem de falha, logo se trataria de um lock (caso fosse um deadlock, ambos receberiam uma mensagem de falha). Dito isso, meu gabarito seria Locking, mas a banca considerou Deadlock."
      },
      {
        "pergunta": "(FGV / SEFAZ-MS - 2006) A implementação de Sistemas Gerenciadores de Banco de Dados - SGBD proporciona duas grandes vantagens, que consistem em:<br>I. impedir que um determinado código ou chave em uma tabela não tenha correspondência em outra tabela.<br>II. permitir o armazenamento da informação em um único local com acesso descentralizado e, sendo compartilhada com vários sistemas, os usuários estarão utilizando uma informação confiável.<br>Essas vantagens são conhecidas por:",
        "alternativas": ["a) Manutenção de Integridade / Eliminação de Inconsistências.", 
        "b) Independência dos Dados / Eliminação de Redundâncias.", 
        "c) Independência dos Dados / Eliminação de Inconsistências.", 
        "d) Restrições de Segurança / Eliminação de Inconsistências.", 
        "e) Restrições de Segurança / Eliminação de Redundâncias."],
        "correta": "a) Manutenção de Integridade / Eliminação de Inconsistências.",
        "explicacao": "Impedir que um determinado código ou chave em uma tabela não tenha correspondência em outra tabela é uma restrição de integridade – que a questão chamou de manutenção de integridade. Ela é especificada entre duas tabelas e utilizada para manter a consistência entre linhas nas duas tabelas.<br>Permitir o armazenamento da informação em um único local com acesso descentralizado e, sendo compartilhada com vários sistemas, os usuários estarão utilizando uma informação confiável – trata-se de uma eliminação de inconsistências. A inconsistência ocorre quando um mesmo campo tem valores diferentes em sistemas diferentes.<br>Exemplo: o estado civil de uma pessoa é solteiro em um sistema e casado em outro. Isto ocorre porque esta pessoa atualizou o campo em um sistema e não o atualizou em outro. Quando o dado é armazenado em um único local e compartilhado pelos sistemas, este problema não ocorre. Dessa forma, trata-se de Manutenção de Integridade/Eliminação de Inconsistências. "
      },
      {
        "pergunta": "(FADESP / SEFA-PA – 2022) A informação armazenada do catálogo do Sistema Gerenciador de Banco de Dados (SGBD), que possui a estrutura de cada arquivo, o tipo e o formato de armazenamento de cada item de dados, é chamada de:",
        "alternativas": ["a) recovery", 
        "b) data center", 
        "c) data mining", 
        "d) metadados", 
        "e) índices"],
        "correta": "d) metadados",
        "explicacao": "As informações do catálogo são dados sobre os próprios dados (estrutura, tipo, formato, etc), logo são chamadas de metadados."
      },
      {
        "pergunta": "(FADESP / SEFA-PA – 2022) Sobre as características de um Sistema Gerenciador de Banco de Dados (SGBD), julgue verdadeira (V) ou falsa (F) cada uma das afirmativas a seguir.<br>I. Um SGBD tem como propriedade a dependência dos dados do programa. A estrutura dos arquivos de dados é armazenada no catálogo do SGDB separadamente dos programas de acesso.<br>II. Um SGDB multiusuário precisa oferecer suporte para definir múltiplas visões dos dados. Por exemplo, uma visão pode ser um subconjunto do banco de dados ou conter um dado virtual que é derivado dos arquivos do banco de dados.<br>III. Um SGDB precisa garantir que as transações concorrentes sejam realizadas de maneira correta, ou seja, quando vários usuários tentarem atualizar o mesmo dado é preciso garantir o controle de concorrência para que o resultado das operações seja correto.<br>A sequência correta é:",
        "alternativas": ["a) I - F; II - V; III - V", 
        "b) I - F; II - F; III - V", 
        "c) I - V; II - V; III - V", 
        "d) I - F; II - F; III - F", 
        "e) I - V; II - V; III - F"],
        "correta": "a) I - F; II - V; III - V",
        "explicacao": "(I) Errado, SGBD tem como propriedade a independência dos dados do programa; (II) Correto; (III) Correto. "
      },
      {
        "pergunta": "(QUADRIX / Prefeitura de Jataí – 2019) Com relação aos conceitos e às definições de banco de dados, assinale a alternativa correta:",
        "alternativas": ["a) Um banco de dados não é formado por um conjunto de arquivos, mas sim por um conjunto de dados com as mesmas características.", 
        "b) Um banco de dados é um conjunto de dados organizados, com o objetivo de armazenamento persistente dos dados, que possui mecanismos de manipulação e recuperação de informações.", 
        "c) Um banco de dados é um conjunto integrado de dados não relacionados logicamente.", 
        "d) A melhor definição para banco de dados é que ele é uma representação estática, visto que os dados não podem sofrer alterações temporais.", 
        "e) O banco de dados é uma estrutura de compartilhamento parcial, ou seja, os dados existentes em um banco de dados não podem ser compartilhados por várias pessoas; apenas uma pessoa por vez pode ter acesso ao banco de dados."],
        "correta": "b) Um banco de dados é um conjunto de dados organizados, com o objetivo de armazenamento persistente dos dados, que possui mecanismos de manipulação e recuperação de informações.",
        "explicacao": "<br>(a) Errado, todo banco de dados digital é formado – em última instância – por um conjunto de arquivos; <br>(b) Correto, ele realmente tem o objetivo de persistir os dados e possui mecanismos de manipulação e recuperação de dados; <br>(c) Errado, os dados são logicamente relacionados; <br>(d) Errado, bancos de dados possuem uma representação dinâmica, podendo alterar dados e modelos para se ajustar ao minimundo que eles descrevem; <br>(e) Errado, os dados do banco de dados são compartilhados entre diferentes grupos de usuários – em geral, cada grupo possui a visão de apenas parte do banco de dados."
      },
      {
        "pergunta": "(QUADRIX / CREA-TO – 2019) Em um banco de dados, é necessária a abstração dos dados, de tal forma que o usuário não se importe com a forma como eles estão armazenados.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Abstração é a retirada/redução de detalhes. Um banco de dados abstrai a complexidade de como os dados estão efetivamente armazenados. Em outras palavras, o usuário não se preocupa com a maneira como os dados estão fisicamente armazenados – ele se preocupa apenas com os valores dos dados em si."
      },
      {
        "pergunta": "(CETREDE / Prefeitura de Itaitinga – 2019) Antigamente, os bancos de dados eram manuais. Atualmente com a difusão tecnológica a grande maioria dos bancos de dados são digitais. Eles compõem um conjunto estruturado de dados que obedecem a um modelo de dados e são armazenados em formato digital – em um hardware (geralmente, um servidor da rede – storage). NÃO é vantagem de um banco de dados, ",
        "alternativas": ["a) maior volume de dados armazenado.", 
        "b) ocupar maior espaço físico.", 
        "c) maior velocidade de acesso aos dados.", 
        "d) permite o compartilhamento de informações.", 
        "e) persistência dos dados: depois de muitos anos, ainda podem ser acessados."],
        "correta": "b) ocupar maior espaço físico.",
        "explicacao": "<br>(a) Errado, essa é uma vantagem de bancos de dados; <br>(b) Correto, essa não é uma vantagem de bancos de dados porque, na verdade, eles ocupam menor espaço físico podendo armazenar mais dados em um espaço menor; <br>(c) Errado, essa é uma vantagem de bancos de dados; <br>(d) Errado, essa é uma vantagem de bancos de dados; <br>(e) Errado, essa é uma vantagem de bancos de dados."
      },
      {
        "pergunta": "(IADES / CRN3 – 2019) No que se refere aos conceitos gerais de banco de dados, assinale a alternativa correta.",
        "alternativas": ["a) Os dados, independentes ou não, de um banco de dados formam necessariamente uma informação.", 
        "b) Os projetistas, também conhecidos como administradores do banco de dados (database administrators), são os usuários iniciantes ou paramétricos do sistema.", 
        "c) Um banco de dados não representa um aspecto do mundo real.", 
        "d) Uma planilha do Microsoft Excel ou uma lista de contatos (nome, telefone e e-mail) de uma agenda configuram um banco de dados.", 
        "e) A edição ou a alteração dos dados de um banco de dados é muito onerosa ao administrador, o que torna comum a prática de sua total exclusão."],
        "correta": "d) Uma planilha do Microsoft Excel ou uma lista de contatos (nome, telefone e e-mail) de uma agenda configuram um banco de dados.",
        "explicacao": "<br>(a) Errado, dados e informações são conceitos distintos e os dados não formam necessariamenteinformações; <br>(b) Errado, os projetistas não são usuários iniciantes; <br>(c) Errado, um banco de dados representa uma porção do mundo real, que pode ser chamado de minimundo ou Universo de Discurso. Qualquer alteração sofrida por esse minimundo deve ser refletida no banco de dados; <br>(d) Correto, eles podem ser considerados um banco de dados; <br>(e) Errado, não é necessariamente onerosa – pode ser, inclusive, extremamente simples. "
      },
      {
        "pergunta": "(IDCAP / Prefeitura de Canaã – 2019) A coleção de informações armazenadas de um banco de dados é chamada de:",
        "alternativas": ["a) Parâmetros", 
        "b) Instância", 
        "c) Esquema", 
        "d) Arquitetura", 
        "e) Projeto"],
        "correta": "b) Instância",
        "explicacao": "A coleção de informações armazenadas de um banco de dados é chamada de instância. Instância (ou Estado) é o conjunto de dados armazenados no banco e um determinado momento de operação – o esquema é a descrição da estrutura dos dados; a instância são os dados em si!"
      },
      {
        "pergunta": "(SUGEP / UFRPE – 2019) O padrão de ANSI/SPARC para arquitetura de SGBD define uma arquitetura em três níveis. São eles:",
        "alternativas": ["a) nível interno, nível de usuário e nível físico.", 
        "b) nível interno, nível externo e nível conceitual.", 
        "c) nível externo, nível de tabelas e nível físico.", 
        "d) nível conceitual, nível de usuário e nível de arquivos.", 
        "e) nível de tabelas, nível de arquivos e nível de visão."],
        "correta": "b) nível interno, nível externo e nível conceitual.",
        "explicacao": "Os três níveis são: nível interno, nível externo e nível conceitual."
      },
      {
        "pergunta": "(CONSULPLAN / TRF 2ª REGIÃO - 2017) Em banco de dados relacional à arquitetura mais difundida na literatura é a Arquitetura “Three-Schema” (também conhecida como arquitetura ANSI/SPARC), proposta por Tsichritzis & Klug em 1978. A arquitetura “three-schema” pode ser utilizada para explicar conceitos de independência de dados, que podem ser definidos como a capacidade de alterar o esquema de um nível sem ter que alterar o esquema no próximo nível superior. Um SGBD é uma coleção de arquivos e programas inter-relacionados permitindo a consulta e modificação de dados, no qual é possível ter uma abstração dos dados em 3 níveis; na arquitetura ANSI/SPARC são conhecidos como:",
        "alternativas": ["a) Lógico, físico e hierárquico.", 
        "b) Interno, conceitual e externo.", 
        "c) Relacional, rede e hierárquico.", 
        "d) Conceitual, relacional e hierárquico."],
        "correta": "b) Interno, conceitual e externo.",
        "explicacao": "A Arquitetura ANSI/SPARC (Três Esquemas) se divide em três níveis independentes de abstração de dados: interno, conceitual e externo."
      },
      {
        "pergunta": "(INSTITUTO AOCP / EBSERH - 2015) A técnica utilizada para a especificação e explorar estrutura orientada a dados para um banco de dados é chamada de Modelagem de dados. Para entender como os modelos de dados podem ser usados na prática, depara-se com três estilos básicos de modelos de dados. Quais são esses estilos?",
        "alternativas": ["a) Modelos Conceituais, Modelos Lógicos e Modelos de Contexto.", 
        "b) Modelos Conceituais, Modelos de Contexto e Modelos Físicos.", 
        "c) Modelos de Contexto, Modelos Lógicos e Modelos Físicos.", 
        "d) Modelos Conceituais, Modelos Lógicos e Modelos Físicos.", 
        "e) Modelos de Aplicações, Modelos de Contexto e Modelos Conceituais."],
        "correta": "d) Modelos Conceituais, Modelos Lógicos e Modelos Físicos.",
        "explicacao": "Existem três modelos que representam a estrutura ou projeto de um banco de dados em diferentes níveis de abstração: Modelo Conceitual, Modelo Lógico e Modelo Físico."
      },
      {
        "pergunta": "(VUNESP / SP-URBANISMO - 2014) Segundo o modelo entidade-relacionamento, utilizado para a modelagem de bancos de dados relacionais,",
        "alternativas": ["a) entre dois conjuntos de entidades distintos só pode haver um único conjunto de relacionamentos.", 
        "b) um conjunto de relacionamentos binários envolve 3 ou mais conjuntos de entidades distintos.", 
        "c) um conjunto de relacionamentos recursivos envolve, pelo menos, dois conjuntos de entidades distintos.", 
        "d) um conjunto de relacionamentos representa a associação entre um ou mais conjuntos de entidades.", 
        "e) um conjunto de relacionamentos deve ligar conjuntos de entidades distintos com o mesmo número de atributos em cada um deles."],
        "correta": "d) um conjunto de relacionamentos representa a associação entre um ou mais conjuntos de entidades.",
        "explicacao": "Antes de comentar é importante mencionar que podemos considerar que conjuntos de entidades podem ser representados como uma única entidade (Ex: conjunto de cachorros pode ser representado como uma Entidade Cachorro) – assim como um conjunto de relacionamentos pode ser representado como um único relacionamento. <br>(a) Errado. Pode haver diversos relacionamentos entre duas entidades (Ex: Homem pratica Esporte; Homem ensina Esporte) – temos dois relacionamentos entre as mesmas duas entidades; <br>(b) Errado. Um conjunto de relacionamentos binários envolve dois conjuntos de entidades distintos e, não, três ou mais; <br>(c) Errado. Um conjunto de relacionamentos recursivos (auto-relacionamento) possui apenas um conjunto de entidades; <br>(d) Correto. Um conjunto de relacionamentos realmente representa a associação entre um ou mais conjuntos de entidades;<br>(e) Errado. Não é obrigatório ligar conjuntos de entidades distintos nem com o mesmo número de atributos em cada um deles."
      },
      {
        "pergunta": "(IBFC / EBSERH – 2016) Em Engenharia de Software, o modelo de dados para descrever os dados ou aspectos de informação de um domínio de negócio ou seus requerimentos de processo, de uma maneira abstrata que em última análise se presta a ser implementada em um banco de dados, como um banco de dados relacional é caracterizado pelo:",
        "alternativas": ["a) Modelo Hierárquico de Dados", 
        "b) Modelo Visão Controlador", 
        "c) Modelo OSI", 
        "d) Modelo de Dados em Rede", 
        "e) Modelo Entidade Relacionamento"],
        "correta": "e) Modelo Entidade Relacionamento",
        "explicacao": "Vamos ficar de olho nas palavras-chave: modelo de dados; descrever dados; maneira abstrata; banco de dados relacional. E agora vamos examinar os itens: <br>(a) Errado. Modelo Hierárquico pode ser implementado em bancos de dados hierárquicos e, não, bancos de dados relacionais; <br>(b) Errado. Esse sequer é um modelo de banco de dados, mas de projeto de desenvolvimento de software; <br>(c) Errado. Modelo OSI é um modelo de arquitetura de protocolos de uma rede de computadores – não tem nenhuma relação com banco de dados; <br>(d) Errado. Modelo de Dados em Rede pode ser implementado em bancos de dados em rede e, não, bancos de dados relacionais; <br>(e) Correto. Modelo Entidade-Relacionamento é um modelo de dados utilizado para descrever dados do domínio do negócio de maneira abstrata por um banco de dados relacional."
      },
      {
        "pergunta": "(VUNESP / DESENVOLVESP – 2014) No modelo entidade-relacionamento, empregado na modelagem de bancos de dados relacionais, é correto afirmar que a representação de um relacionamento binário:",
        "alternativas": ["a) envolve um único conjunto de entidades por duas vezes.", 
        "b) envolve dois conjuntos de entidades.", 
        "c) possui um domínio composto por valores numéricos e textuais.", 
        "d) possui pelo menos um atributo composto.", 
        "e) possui dois atributos descritivos."],
        "correta": "b) envolve dois conjuntos de entidades.",
        "explicacao": "<br>(a) Errado. Esse seria um auto-relacionamento ou relacionamento recursivo; <br>(b) Correto. Um relacionamento binário envolve dois conjuntos de entidades; <br>(c) Errado. O grau do relacionamento não tem nenhuma relação com seu domínio; <br>(d) Errado. O grau do relacionamento não tem nenhuma relação com atributos compostos; <br>(e) Errado. O grau do relacionamento não tem nenhuma relação com atributos descritivos."
      },
      {
        "pergunta": "(FCC / TRT – 1ª RJ - 2014) Considerando o modelo entidade-relacionamento utilizado na modelagem de dados de Bancos de Dados relacionais, um conjunto de entidades deve possuir atributos. Um atributo denominado composto é aquele que tem como característica:",
        "alternativas": ["a) um tamanho mínimo correspondente a 100 caracteres alfabéticos.", 
        "b) ocupar, no mínimo 30 bytes para o armazenamento, em cada registro.", 
        "c) sempre, em sua composição, partes numéricas e partes literais.", 
        "d) não ser armazenado internamente nos arquivos do banco de dados.", 
        "e) poder ser dividido em subpartes menores que ainda apresentem significado."],
        "correta": "e) poder ser dividido em subpartes menores que ainda apresentem significado.",
        "explicacao": "Um atributo denominado composto é aquele que tem como característica poder ser dividido em subpartes menores que ainda apresentem significado. Um exemplo clássico é o endereço – eu morava no seguinte endereço: CLN 316 Bloco E Apt 212 (sim, aqui em Brasília o endereço é meio maluco mesmo). Notem que o atributo endereço pode ser dividido em subpartes menores com significado: Quadra: CLN 316; Bloco: E; Apartamento: 212. Nenhum dos outros itens faz sentido!"
      },
      {
        "pergunta": "(FCC / TRT – 1ª RJ - 2014) No modelo entidade-relacionamento utilizado para modelar Bancos de Dados relacionais, quando se indica que há um conjunto de relacionamentos do tipo muitos para muitos entre 2 conjuntos de entidades A e B, significa que:",
        "alternativas": ["a) os conjuntos de entidades A e B possuem diversos atributos com a possibilidade de terem valores nulos.", 
        "b) uma entidade do conjunto B está associada a apenas uma entidade do conjunto A, mas uma entidade do conjunto A está associada a várias entidades do conjunto B.", 
        "c) uma entidade do conjunto A está sempre associada a mais de uma entidade de conjunto B e vice-versa.", 
        "d) uma entidade do conjunto A pode estar associada a várias entidades do conjunto B e viceversa.", 
        "e) os conjuntos de entidades A e B possuem, cada um deles, número igual de atributos."],
        "correta": "d) uma entidade do conjunto A pode estar associada a várias entidades do conjunto B e viceversa.",
        "explicacao": "Quando se indica que há um conjunto de relacionamentos do tipo muitos para muitos entre dois conjuntos de entidades A e B, significa que uma entidade do conjunto A pode estar associada a várias entidades do conjunto B e vice-versa. Em outras palavras, uma entidade do conjunto A pode estar associada a várias entidades do conjunto B e uma entidade do conjunto B pode estar associada a várias entidades do conjunto A. Professor, qual é o problema da Letra C? Galera, notem a palavra “sempre”! Uma entidade do conjunto A está sempre associada a mais de uma entidade do conjunto B? Não, ela pode estar associada a zero ou mais entidades do conjunto B! Logo, não é sempre mais de uma!"
      },
      {
        "pergunta": "(FUNCAB / MDA – 2014) Existem diversas notações para o Modelo Entidade-Relacionamento. A notação original foi proposta por Peter Chen e é composta de entidades, relacionamentos, atributos, representados, respectivamente, por:",
        "alternativas": ["a) retângulos, losangos e círculos.", 
        "b) retângulos, círculos e losangos.", 
        "c) losangos, retângulos e círculos.", 
        "d) círculos, losangos e retângulos.", 
        "e) círculos, retângulos e losangos."],
        "correta": "a) retângulos, losangos e círculos.",
        "explicacao": "Retângulos são representados por entidades, losangos representados por são relacionamentos e círculos representados por são atributos."
      },
      {
        "pergunta": "(FUNCAB / MDA – 2014) Existem diversas notações para o Modelo Entidade-Relacionamento. A notação original foi proposta por Peter Chen e é composta de entidades, relacionamentos, atributos, representados, respectivamente, por:",
        "alternativas": ["a) retângulos, losangos e círculos.", 
        "b) retângulos, círculos e losangos.", 
        "c) losangos, retângulos e círculos.", 
        "d) círculos, losangos e retângulos.", 
        "e) círculos, retângulos e losangos."],
        "correta": "a) retângulos, losangos e círculos.",
        "explicacao": "Retângulos são representados por entidades, losangos representados por são relacionamentos e círculos representados por são atributos."
      },
      {
        "pergunta": "(CESPE / STJ – 2015) O relacionamento no modelo entidade-relacionamento é uma associação intuitiva entre entidades, cujo número de entidades envolvidas é conhecido como hierarquia.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Opa! O número de entidades envolvidas em uma relação é conhecido como grau (do relacionamento) e, não, hierarquia."
      },
      {
        "pergunta": "(VUNESP / EMPLASA – 2014) Considerando o modelo entidade-relacionamento utilizado para a modelagem de bancos de dados relacionais, um atributo A de um conjunto de entidades pode ser calculado em função de outros atributos desse mesmo conjunto de entidades. Nesse caso, o atributo A recebe a denominação de atributo:",
        "alternativas": ["a) derivado", 
        "b) externo", 
        "c) interno", 
        "d) postergado", 
        "e) restrito"],
        "correta": "a) derivado",
        "explicacao": "O Atributo A recebe a denominação de atributo derivado. Um atributo derivado – também chamado de calculado – é aquele que pode ser derivado ou obtido a partir de outros atributos ou relacionamentos, logo ele não precisa ser armazenado no banco de dados (Ex: Idade)."
      },
      {
        "pergunta": "(CESPE / TJ SE – 2014) No modelo entidade-relacionamento, um tipo particular de entidade fraca ocorre quando um atributo identificador de uma entidade inclui o atributo identificador da outra entidade.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "O identificador de uma entidade fraca é composto pelo atributo identificador da entidade forte mais um atributo identificador da entidade fraca (chamado de chave parcial no modelo lógico). Elas – em conjunto – identificam uma entidade fraca. Detalhe: desconheço outro tipo de entidade fraca – acho que o examinador quis dizer “...um tipo particular de entidade ocorre quanto...”."
      },
      {
        "pergunta": "(CS-UFG / AL-GO – 2015) Na Assembleia Legislativa de Goiás, deputados têm assessores exclusivos para auxiliar seu trabalho. ASSESSOR é entidade fraca de DEPUTADO e assessores cuidam de assuntos diferenciados ou dos mesmos. Para saber quais assuntos os assessores A1 e A2 tratam para os deputados D1 e D2, é necessário modelar um relacionamento: ",
        "alternativas": ["a) 1:1 entre ASSESSOR e ASSUNTO", 
        "b) 1:N entre ASSESSOR e DEPUTADO", 
        "c) N:N entre ASSESSOR e ASSUNTO", 
        "d) N:N entre ASSESSOR e DEPUTADO"],
        "correta": "c) N:N entre ASSESSOR e ASSUNTO",
        "explicacao": "Vamos analisar a questão: Assessor é realmente uma entidade fraca uma vez que ele não existe sem um Deputado (que é uma entidade forte). Como a questão afirma que os deputados têm assessores exclusivos para auxiliar seu trabalho, um Assessor assessora apenas um Deputado, mas um Deputado é assessorado por vários Assessores – logo há um relacionamento 1:N entre Assessor e Deputado. Por que a Letra B está errada? Porque a questão pergunta quais assuntos os assessores tratam, logo ela quer saber do relacionamento ASSESSOR-ASSUNTO. <br>No entanto, a questão afirma que assessores cuidam de assuntos diferentes ou dos mesmos assuntos. Logo, um Assessor trata de diversos Assuntos e um Assunto é tratado por um ou diversos assessores. Portanto, para saber quais assuntos os assessores A1 e A2 tratam para os deputados D1 e D2, é necessário modelar um relacionamento N:N entre Assessor e Assunto como mostra o diagrama acima."
      },
      {
        "pergunta": "(CESPE / TRE-GO – 2015) Um conjunto de entidades que não possuem atributos suficientes para formar uma chave primária é definido como um conjunto de entidades fortes.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Um conjunto de entidades que não possuem atributos suficientes para formar uma chave primária é definido como um conjunto de entidades fortes fracas. Representado por um duplo retângulo, são aquelas cuja existência depende de outras entidades, uma vez que não fazem sentido de existir individualmente. Sendo rigoroso, a chave primária existe a partir do modelo lógico."
      },
      {
        "pergunta": "(CESPE / TRE-PI – 2016) Considere que existe uma entidade PESSOA com um relacionamento denominado CASAMENTO que pode associar diversas ocorrências na mesma entidade PESSOA. De acordo com as propriedades do diagrama entidade-relacionamento, o conceito desse relacionamento (CASAMENTO) pode ser definido como:",
        "alternativas": ["a) generalização.", 
        "b) relacionamento binário.", 
        "c) autorrelacionamento.", 
        "d) entidade associativa.",
        "e) especialização."],
        "correta": "c) autorrelacionamento.",
        "explicacao": "A questão trata de uma entidade PESSOA em um relacionamento chamado CASAMENTO com diversas ocorrências da mesma entidade PESSOA. Logo, a questão trata do conceito de autorrelacionamento."
      },
      {
        "pergunta": "(ESAF / ESAF – 2015) No projeto de um banco de dados, uma propriedade importante de um relacionamento é a de quantas ocorrências de uma entidade podem estar associadas a uma determinada ocorrência através do relacionamento. Essa propriedade é chamada de:",
        "alternativas": ["a) associatividade.", 
        "b) atributo.", 
        "c) cardinalidade.", 
        "d) identificabilidade.",
        "e) mapeamento E-R."],
        "correta": "c) cardinalidade.",
        "explicacao": "Essa propriedade é chamada de Cardinalidade. Em outras palavras, representa a quantidade de ocorrências ou instâncias de cada entidade presente no relacionamento."
      },
      {
        "pergunta": "(UPENET/IAUPE / FACEPE – 2015) No MER, Normal, Fraca ou Associativa são tipos de:",
        "alternativas": ["a) Entidades", 
        "b) Atributos", 
        "c) Cardinalidade", 
        "d) Instâncias",
        "e) Relacionamentos"],
        "correta": "a) Entidades",
        "explicacao": "Normal, Fraca ou Associativa são tipos de entidades: Entidade Normal (ou apenas Entidade), Entidade Fraca e Entidade Associativa."
      },
      {
        "pergunta": "(IFB / IFB – 2017) Segundo Elmasri (2011), na terminologia formal do modelo relacional, uma linha, um cabeçalho de coluna e a tabela, são chamados, respectivamente, de:",
        "alternativas": ["a) Registro, atributo, domínio", 
        "b) Tupla, atributo e relação", 
        "c) Registro, atributo e relação", 
        "d) Relação, domínio e registro",
        "e) Relação, tupla e registro"],
        "correta": "b) Tupla, atributo e relação",
        "explicacao": "Na terminologia formal do modelo relacional (lógico), uma linha é uma tupla; um cabeçalho de coluna é um atributo; e uma tabela é uma relação."
      },
      {
        "pergunta": "(FCC / TJ-APP – 2014) Uma das formas de se garantir a integridade em um banco de dados é por meio da definição de atributos, como a chave primária que:",
        "alternativas": ["a) sempre é formada por apenas um atributo.", 
        "b) não pode ser composta por atributos numéricos.", 
        "c) não pode ser composta por mais do que 3 atributos.", 
        "d) pode ser composta por mais de 1 atributo.",
        "e) é formada por um único tipo de atributo, que é o que estabelece uma sequência numérica."],
        "correta": "d) pode ser composta por mais de 1 atributo.",
        "explicacao": "<br>(a) Errado. Uma chave primária pode ser composta, isto é, formada por mais de um atributo; <br>(b) Errado. Uma chave primária pode – sim – ser composta por atributos numéricos; <br>(c) Errado. Uma chave primária pode – sim – ser composta por mais de três atributos; <br>(d) Correto. Uma chave primária pode ser composta por mais de um atributo; <br>(e) Errado. Uma chave primária pode ser formada por atributos de diversos tipos."
      },
      {
        "pergunta": "(VUNESP / PRODEST-ES – 2014) Sobre a chave primária de uma tabela de um banco de dados relacional, é correto afirmar que: ",
        "alternativas": ["a) pode conter, no máximo, três atributos.", 
        "b) pode ser composta por mais de um atributo.", 
        "c) não há chave primária em tabelas com até 100 registros.", 
        "d) não pode conter atributos do tipo textual.",
        "e) não pode conter atributos do tipo numérico."],
        "correta": "b) pode ser composta por mais de um atributo.",
        "explicacao": "<br>(a) Errado. Uma chave primária pode conter mais de três atributos; <br>(b) Correto. Uma chave primária pode – sim – ser composta por mais de um atributo; <br>(c) Errado. Uma chave primária pode estar presente em tabelas com infinitos registros; <br>(d) Errado. Uma chave primária pode – sim – conter atributos do tipo textual; <br>(e) Errado. Uma chave primária pode – sim – conter atributos do tipo numérico. "
      },
      {
        "pergunta": "(VUNESP / DESENVOLVESP – 2014) Em um banco de dados relacional deve haver, em cada uma de suas relações, um conjunto de um ou mais atributos que não admite valores iguais, nesse conjunto, para qualquer par de tuplas da relação. Esse conjunto de atributos tem a seguinte denominação: ",
        "alternativas": ["a) abstração", 
        "b) chave primária", 
        "c) domínio", 
        "d) índice",
        "e) instância"],
        "correta": "b) chave primária",
        "explicacao": "Conjunto de um ou mais atributos que não admite valores iguais? Deve estar contida em toda relação? A questão trata claramente das chaves primárias: conjunto de um ou mais atributos cujos valores nunca se repetem para qualquer par de tuplas de uma relação."
      },
      {
        "pergunta": "(FCC / TRE-AP – 2015) Leia, abaixo, a descrição das propriedades de um modelo lógico de dados e assinale a única alternativa que corresponde a essa descrição do modelo. Ao contrário de seus antecessores, não se baseia num paradigma de estruturação de dados particular e sim em um fundamento matemático específico. Representa o Banco de Dados como uma coleção de tabelas, constituídas de atributos e tuplas.",
        "alternativas": ["a) Modelo em Redes", 
        "b) Modelo Hierárquico", 
        "c) Modelo Relacional", 
        "d) Modelo Matemático",
        "e) Modelo Orientado a Objetos"],
        "correta": "c) Modelo Relacional",
        "explicacao": "Fundamenta-se em um modelo matemático específico? Não se baseia em paradigmas de estrutura de dados particular? O Modelo Relacional fornece uma base matemática para a representação e a consulta dos dados fundamentado em lógica de predicados e teoria dos conjuntos."
      },
      {
        "pergunta": "(CESPE / TRE-MT – 2015) Assinale a opção que apresenta corretamente o modelo de dados em que uma linha é chamada de tupla, um cabeçalho de coluna é chamado de atributo e uma tabela é chamada de relação:",
        "alternativas": ["a) modelo de dados XML", 
        "b) modelo relacional de dados", 
        "c) modelo de dados em rede", 
        "d) modelo de dados hierárquico",
        "e) modelo de dados híbrido de registro integrado"],
        "correta": "b) modelo relacional de dados",
        "explicacao": "Essa correspondência de nomenclaturas faz parte do modelo relacional de dados."
      },
      {
        "pergunta": "(CESPE / TCU – 2015) Em um banco de dados estruturado de acordo com o modelo relacional, todos os elementos dos dados são colocados em tabelas bidimensionais, organizados em linhas e colunas, o que simplifica o acesso e a manipulação dos dados. Operações matematicamente conhecidas como de produto cartesiano, de seleção e de projeção também apoiam a manipulação de dados aderentes ao modelo relacional.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! A base do modelo relacional é uma relação, que é basicamente uma tabela bidimensional organizada em linhas e colunas. Além disso, ele fornece uma base matemática para a representação e a consulta dos dados fundamentado em lógica de predicados e teoria dos conjuntos. Dessa forma, operações matematicamente conhecidas da álgebra relacional ajudam a suportar a manipulação de dados (Ex: Produto Cartesiano, Junção, Seleção, Projeção, etc). "
      },
      {
        "pergunta": "(IBFC / Polícia Científica – 2017) No modelo relacional, cada registro de uma tabela tem um identificador único chamado de chave primária. Assinale a alternativa que indica o nome da chave primária quando utilizada como referência em outro registro de outra tabela:",
        "alternativas": ["a) chave secundária", 
        "b) chave derivada", 
        "c) chave estrangeira", 
        "d) chave de ligação",
        "e) chave de índice"],
        "correta": "c) chave estrangeira",
        "explicacao": "O nome da chave primária quando utilizada como referência a um registro de outra tabela é Chave Estrangeira. Elas basicamente fazem referência à chave primária de outra tabela ou até mesmo da própria tabela."
      },
      {
        "pergunta": "(CESPE / MEC – 2015) Chave candidata é um atributo especial capaz de identificar uma instância de determinada entidade de maneira única. Assim, durante a modelagem relacional de dados, todas as chaves candidatas nas entidades em análise se tornam chaves primárias dessas entidades.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "A primeira parte da questão está correta – uma chave candidata é basicamente uma possível chave primária de uma relação. No entanto, apenas uma das chaves candidatas se torna chave primária uma vez que só pode haver uma única chave primária por entidade."
      },
      {
        "pergunta": "(FCM / IFF-RS – 2015) Em um banco de dados relacional, algumas regras são aplicadas às chaves, assim:",
        "alternativas": ["a) não é possível a criação de uma tabela sem chave primária.", 
        "b) a chave primária de uma tabela deve ser sempre única e não nula.", 
        "c) as chaves, primária e estrangeira, de uma tabela, devem ser do tipo numérico.", 
        "d) a cláusula UNIQUE, aplicada à chave estrangeira, é responsável pela integridade referencial do relacionamento.",
        "e) as chaves primárias podem ser compostas por um ou mais atributos, porém as chaves estrangeiras devem ser compostas somente por um atributo."],
        "correta": "b) a chave primária de uma tabela deve ser sempre única e não nula.",
        "explicacao": "<br>(a) Errado. É possível – apesar de não ser uma boa prática – criar uma tabela sem chave primária; <br>(b) Correto. A chave primária deve – sim – ser sempre única e não-nula; <br>(c) Errado. Não existe esse tipo de restrição; <br>(d) Errado. A cláusula UNIQUE é responsável pela restrição de unicidade do relacionamento; <br>(e) Errado. Chaves estrangeiras também podem ser compostas por um ou mais atributos."
      },
      {
        "pergunta": "(IESES / MSGAS – 2015) No projeto de banco de dados relacional, a integridade de entidades é uma característica que necessita ser garantida. Nesse contexto, assinale a alternativa correta:",
        "alternativas": ["a) A integridade de entidades estabelece que o valor da chave primária deve ser um número sequencial auto-incrementado.", 
        "b) A integridade de entidades estabelece que nenhum valor da chave primária pode ser null.", 
        "c) A integridade de entidades é utilizada para manter a consistência entre duas relações, sendo que esta é possível por meio de chaves estrangeiras.", 
        "d) A integridade de entidades estabelece que as chaves primárias devem ser formadas por um único atributo."],
        "correta": "b) A integridade de entidades estabelece que nenhum valor da chave primária pode ser null.",
        "explicacao": "A Restrição de Integridade de Entidade estabelece que nenhum valor de chave primária pode ser NULL (Nulo)."
      },
      {
        "pergunta": "(CESGRANRIO / PETROBRAS – 2014) A álgebra relacional fornece um alicerce formal para as operações do modelo relacional. Um técnico de informática reconhece que essas operações permitem que um usuário especifique solicitações como expressões da álgebra relacional, nas quais a(o): ",
        "alternativas": ["a) operação PROJEÇÃO é usada para escolher um subconjunto das tuplas de uma relação que satisfaça uma condição de seleção.", 
        "b) operação de PROJEÇÃO mantém quaisquer tuplas duplicadas, de modo que o resultado dessa operação é um conjunto de tuplas que pode conter tuplas repetidas.", 
        "c) operação PROJEÇÃO pode selecionar certas colunas da tabela e descartar outras.", 
        "d) operação SELEÇÃO é usada para incluir todas as tuplas de duas relações em uma única relação, sendo que as tuplas duplicadas são eliminadas.",
        "e) resultado da operação SELEÇÃO pode ser visualizado como uma partição vertical da relação original em duas relações: uma tem as colunas (atributos) necessárias e contém o resultado da operação, e a outra contém as colunas descartadas."],
        "correta": "c) operação PROJEÇÃO pode selecionar certas colunas da tabela e descartar outras.",
        "explicacao": "<br>(a) Errado. Essa operação seleciona colunas de uma tabela dada uma condição; <br>(b) Errado. Essa operação elimina duplicatas (tuplas repetidas); <br>(c) Correto. Essa operação seleciona colunas de uma tabela dada uma condição; <br>(d) Errado. Essa operação seleciona tuplas de uma tabela dada uma condição; <br>(e) Errado. Essa operação seleciona tuplas de uma tabela dada uma condição;"
      },
      {
        "pergunta": "(FCC / TJ-AP – 2014) Em um banco de dados, uma maneira de aumentar a segurança é a ocultação de dados de um usuário. Um recurso que pode ser utilizado na ocultação de dados que o usuário não tem necessidade de acessar, denomina-se:",
        "alternativas": ["a) procedure", 
        "b) script", 
        "c) trigger", 
        "d) trilha",
        "e) view"],
        "correta": "e) view",
        "explicacao": "Um recurso que pode ser utilizado na ocultação de dados que o usuário não tem necessidade de acessar, denomina-se view. Ela é um subconjunto do banco de dados, isto é, se você deseja visualizar apenas uma parte dos dados de uma tabela, você pode criar uma visão personalizada dos dados, sendo considerada basicamente uma tabela que é derivada de outras tabelas."
      },
      {
        "pergunta": "(CESPE / MEC – 2015) View é um objeto que permite implementar a segurança em um banco de dados, omitindo dados irrelevantes para algum grupo de usuário. No entanto, não é permitido criar uma view com base na definição de outra view.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "A primeira parte da questão está perfeita, no entanto é permitido – sim – criar uma view com base na definição de outra view."
      },
      {
        "pergunta": "(CESPE / TRE-MT – 2015) O conjunto de um ou mais campos cujos valores, considerando-se a combinação de todos os campos da tupla, nunca se repetem e que podem ser usados como um índice para os demais campos da tabela do banco de dados é denominado de:",
        "alternativas": ["a) domínio", 
        "b) primeira forma normal", 
        "c) dicionário de dados", 
        "d) chave estrangeira",
        "e) chave primária"],
        "correta": "e) chave primária",
        "explicacao": "O conjunto de um ou mais campos cujos valores, considerando-se a combinação de todos os campos da tupla, nunca se repetem e que podem ser usados como um índice para os demais campos da tabela do banco de dados é o conceito clássico de chave primária."
      },
      {
        "pergunta": "(CETAP / MPCM – 2015) Sobre o conceito de chave primária, relacionado a um registro em um banco de dados, selecione a afirmação falsa:",
        "alternativas": ["a) Pode ser formado por um campo ou um conjunto de campos.", 
        "b) Não pode conter valores nulos.", 
        "c) Deve formar um valor único para cada registro.", 
        "d) Pode ser utilizada para relacionar o registro com outras tabelas.",
        "e) Deve ser declarado de um tipo de dados INTEIRO."],
        "correta": "e) Deve ser declarado de um tipo de dados INTEIRO.",
        "explicacao": "<br>(a) Correto. Uma Chave Primária pode ser composta; <br>(b) Correto. Uma Chave Primária não pode conter valores nulos (Restrição de Entidade); <br>(c) Correto. Uma Chave Primária deve ter valores únicos para cada registro (Restrição de Chave); <br>(d) Correto. Uma Chave Primária pode ser Chave Estrangeira de outra tabela; <br>(e) Errado. Uma Chave Primária não precisa ser obrigatoriamente do tipo INTEIRO."
      },
      {
        "pergunta": "(NC-UFPR / ITAIPU BINACIONAL – 2015) Quando uma chave primária de uma tabela é usada como atributo em outra tabela, nessa outra tabela ela será chamada de:",
        "alternativas": ["a) Chave dupla", 
        "b) Chave candidata", 
        "c) Chave importada", 
        "d) Chave estrangeira",
        "e) Chave secundária"],
        "correta": "d) Chave estrangeira",
        "explicacao": "<br>(a) Errado. Essa chave não existe; <br>(b) Errado. Essa chave é uma possível chave primária; <br>(c) Errado. Essa chave não existe; <br>(d) Correto. Essa chave é uma chave primária de outra tabela; <br>(e) Errado. Essa chave é uma chave candidata que não foi escolhida para ser chave primária. "
      },
      {
        "pergunta": "(CESPE / TER-GO – 2015) Uma chave primária identifica um único valor de uma tupla no banco de dados e não possui mais de um atributo na tabela.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Uma chave primária pode ser composta por diversos atributos – não há restrições de quantidade de atributos de uma chave primária."
      },
      {
        "pergunta": "(CESPE / TCE-PA – 2016) Em bancos de dados relacionais, chave estrangeira é aquela que permite uma ligação lógica entre duas tabelas — a chave estrangeira de uma tabela se liga logicamente à chave primária de outra tabela.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! O entendimento do CESPE é de que a chave estrangeira de uma tabela se liga logicamente à chave primária de outra tabela e, não, à chave candidata. "
      },
      {
        "pergunta": "(COVEST / UFPE – 2019) Quais formas normais lidam com Dependência Funcional Parcial e Dependência Funcional Transitiva, respectivamente?",
        "alternativas": ["a) 2ª e 3ª", 
        "b) 3ª e 2ª", 
        "c) 3ª e 4ª", 
        "d) 4ª e 3ª",
        "e) 4ª e 5ª"],
        "correta": "a) 2ª e 3ª",
        "explicacao": "A 2FN lida com dependências funcionais parciais e a 3FN lida com dependências funcionais transitivas."
      },
      {
        "pergunta": "(FCC / TJ/MA – 2019) Uma entidade de ligação possui uma chave primária composta pelos atributos que são chaves primárias nas entidades ligadas a ela. A verificação para saber se os atributos não chave são dependentes total ou parcialmente da chave primária composta, com objetivo de eliminar as dependências funcionais parciais, é feita na:",
        "alternativas": ["a) 5FN", 
        "b) 4FN", 
        "c) 3FN", 
        "d) 1FN",
        "e) 2FN"],
        "correta": "e) 2FN",
        "explicacao": "A verificação para saber se os atributos não chave são dependentes total ou parcialmente da chave primária composta, com objetivo de eliminar as dependências funcionais parciais, é feita na 2FN. Caso uma tabela esteja na 1FN e não tenha dependências funcionais parciais (tenha apenas dependências funcionais totais), ela estará na 2FN."
      },
      {
        "pergunta": "(VUNESP / Câmara de Piracicapa/SP – 2019) Em bancos de dados relacionais, a forma normal que estabelece que os domínios de seus atributos devem ser atômicos (admitir um valor único para cada atributo) é a:",
        "alternativas": ["a) Primeira Forma Normal", 
        "b) Segunda Forma Normal", 
        "c) Terceira Forma Normal", 
        "d) Quarta Forma Normal",
        "e) Quinta Forma Normal"],
        "correta": "a) Primeira Forma Normal",
        "explicacao": "A forma normal que estabelece que os domínios de seus atributos devem ser atômicos é a 1FN."
      },
      {
        "pergunta": "(FCC / TJ-MA – 2019) Ter um campo calculado em uma tabela, ou seja, um campo que é resultante de cálculo com valores de outros campos viola direta e principalmente a:",
        "alternativas": ["a) primeira forma normal (1FN)", 
        "b) quarta forma normal (4FN)", 
        "c) terceira forma normal (3FN)", 
        "d) quinta forma normal (5FN)",
        "e) segunda forma normal (2FN)"],
        "correta": "c) terceira forma normal (3FN)",
        "explicacao": "Ter um campo calculado (também chamado de campo derivado), isto é, aquele que pode ser obtido por meio de outras colunas da tabela viola a 3FN porque atributos não-chave determinam outros atributos não-chave."
      },
      {
        "pergunta": "(VUNESP / Prefeitura de Valinhos – 2019) A definição da primeira forma normal em bancos de dados relacionais estabelece que:",
        "alternativas": ["a) cada conjunto de entidades não pode possuir mais do que cinco atributos.", 
        "b) não deve haver relacionamentos do tipo um para um entre conjuntos de entidades.", 
        "c) não deve haver relacionamentos do tipo muitos para muitos entre conjuntos de entidades.", 
        "d) os domínios de cada conjunto de entidades não podem ser do tipo booleano.",
        "e) os domínios dos atributos de um conjunto de entidades devem ser atômicos."],
        "correta": "e) os domínios dos atributos de um conjunto de entidades devem ser atômicos.",
        "explicacao": "<br>(a) Errado, não há limitação quanto à quantidade de atributos; <br>(b) Errado, não há limitação quanto à cardinalidade; <br>(c) Errado, não há limitação quanto à cardinalidade; <br>(d) Errado, não há limitação quanto ao tipo de dado; (e) Correto, os domínios dos atributos devem ser atômicos para estar na Primeira Forma Normal (1FN)."
      },
      {
        "pergunta": "(QUADRIX / CRM-PR – 2018) Uma dependência funcional transitiva ocorre quando há uma dependência funcional de uma coluna que não seja chave primária para com outra coluna, ou uma combinação de colunas, que também não seja chave primária.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! A dependência funcional transitiva ocorre quando um atributo não-chave depende de outro atributo não-chave."
      },
      {
        "pergunta": "(QUADRIX / CRM-PR – 2018) Após a obtenção do esquema relacional correspondente ao documento a ser normalizado, deve-se aplicar a Quarta Forma Normal (4FN), ou seja, a primeira fase a ser executada no processo de normalização. ",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Opa, a primeira fase a ser executada no processo de normalização é a 1FN."
      },
      {
        "pergunta": "(QUADRIX / CRM-PR – 2018) As dependências parciais não são desejáveis na Segunda Forma Normal (2FN).",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! A 2FN não permite dependências funcionais parciais."
      },
      {
        "pergunta": "(QUADRIX / CRM-PR – 2018) Embora a normalização seja um conjunto de etapas que possibilita o reagrupamento de informações, ela não é destinada a eliminar redundâncias de dados que possam existir nos arquivos.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Pelo contrário, ela é justamente destinada a eliminar redundâncias de dados que possam existir nos arquivos."
      },
      {
        "pergunta": "(CESPE / SEFAZ-RS – 2018) Na elaboração de um projeto de banco de dados, é função da normalização evitar:",
        "alternativas": ["a) a repetição de informações.", 
        "b) a criação de pequenas tabelas.", 
        "c) o armazenamento de dados pessoais.", 
        "d) o procedimento de relacionar dados de diferentes fontes.",
        "e) a extrapolação do tamanho máximo dos campos das tabelas."],
        "correta": "a) a repetição de informações.",
        "explicacao": "A função principal da normalização é minimizar a repetição de informações – nenhum dos outros itens faz qualquer sentido."
      },
      {
        "pergunta": "(CESPE / EBSERH – 2018) Em normalização, a primeira forma normal é caracterizada por uma tabela com a existência obrigatória de uma chave primária e uma chave estrangeira.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Não há nenhuma obrigação de chave estrangeira e a chave primária é obrigatória para qualquer tabela – não há relação com normalização."
      },
      {
        "pergunta": "(CESPE / STM – 2018) A passagem à terceira forma normal (3FN) tem como objetivo principal gerar o modelo lógico de dados; por isso, ela não visa eliminar redundância de dados, como ocorre com as demais formas normais.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Não, a 3FN busca eliminar redundância e, não, gerar modelo lógico de dados."
      },
      {
        "pergunta": "(CESPE / STM – 2018) Uma tabela estará na segunda forma normal (2FN) quando, além de estar na terceira forma normal (3FN), ela contiver dependências funcionais parciais.",
        "alternativas": ["Certo", 
        "Errado"],
        "correta": "Errado",
        "explicacao": "Na verdade, é o contrário: uma tabela estará na terceira forma normal (3FN) quando, além de estar na terceira forma normal (2FN), ela não contiver dependências funcionais parciais."
      },
      {
        "pergunta": "(FCC / DPE-AM – 2018) Uma tabela de um banco de dados relacional está na primeira forma normal se:",
        "alternativas": ["a) o número de atributos dessa tabela for limitado pelo sistema gerenciador de banco de dados.", 
        "b) os atributos do tipo caractere tiverem comprimento máximo de 30 caracteres.", 
        "c) o número de registros dessa tabela for limitado pelo sistema gerenciador de banco de dados.", 
        "d) os domínios de todos atributos dessa tabela forem atômicos.",
        "e) os domínios de todos atributos dessa tabela forem compostos por números inteiros."],
        "correta": "d) os domínios de todos atributos dessa tabela forem atômicos.",
        "explicacao": "<br>(a) Errado, não há limitação quanto à quantidade de atributos; <br>(b) Errado, não há limitação quanto ao tipo de atributo; <br>(c) Errado, não há limitação quanto à quantidade de registros; <br>(d) Correto, todos os atributos devem ser atômicos; <br>(e) Errado, não há limitação quanto ao tipo de atributo."
      },
      {
        "pergunta": "(FCC / DPE-RS – 2017) Observou-se que uma tabela de um banco de dados relacional está na segunda forma normal pois, além de estar na primeira forma normal,",
        "alternativas": ["a) existe um número par de atributos na chave primária da tabela.", 
        "b) cada atributo não chave da tabela é dependente de todos os atributos da chave primária da tabela.", 
        "c) todos atributos da tabela são atômicos (contêm exatamente um valor para cada atributo).", 
        "d) os atributos da chave primária da tabela são do tipo numérico.",
        "e) os atributos não chave da tabela são mutuamente dependentes entre si."],
        "correta": "b) cada atributo não chave da tabela é dependente de todos os atributos da chave primária da tabela.",
        "explicacao": "<br>(a) Errado, não há nenhuma relação com a quantidade de atributos; <br>(b) Correto, todos os atributos não-chave devem possuir uma dependência funcional total com a chave primária; <br>(c) Errado, isso garante apenas a 1FN; <br>(d) Errado, não há nenhuma relação com tipo de dados; <br>(e) Errado, eles não podem ser dependentes entre si."
      },
      {
        "pergunta": "(FUNDEP / UFVJM-MG – 2017) Em um banco de dados relacional, qual forma normal está sendo estabelecida quando todos os valores de colunas são atômicos, eliminando grupos repetidos de dados?",
        "alternativas": ["a) 1ª Forma normal", 
        "b) 2ª Forma normal", 
        "c) 3ª Forma normal", 
        "d) 4ª Forma normal"],
        "correta": "a) 1ª Forma normal",
        "explicacao": "Quando todos os valores de coluna são atômicos, trata-se da 1FN."
      },
      {
        "pergunta": "(AOCP / EBSERH – 2017) Assinale a alternativa que define a Terceira Forma Normal (3FN) de um processo de Normalização de Banco de Dados.",
        "alternativas": ["a) Estar na BCNF e todo o atributo não-chave depender funcionalmente da chave primária.", 
        "b) Estar na 1FN e não possuir atributo não-chave, dependendo de outro atributo não-chave.", 
        "c) Estar no formato de compartilhamento de atributos e possuir chave primária minimalista.", 
        "d) Não conter dependências transitivas e estar na 2FN.",
        "e) Estar na 4FN e não possuir dependência de junção."],
        "correta": "d) Não conter dependências transitivas e estar na 2FN.",
        "explicacao": "<br>(a) Errado, para estar na 3FN não é necessário estar na BCNF; <br>(b) Errado, é necessário estar na 2FN; <br>(c) Errado, esse item não faz qualquer sentido; <br>(d) Correto, para estar na 3FN é necessário estar na 2FN e não possuir dependências transitivas; <br>(e) Errado, não é necessário estar na 4FN nem possuir dependência de junção."
      },
      {
        "pergunta": "(IBFC / EBSERH – 2007) Quanto à normalização de dados, analise as afirmativas abaixo, dê valores Verdadeiro (V) ou Falso (F) e assinale a alternativa que apresenta a sequência correta (de cima para baixo): <br>( ) uma tabela está na primeira forma normal (FN1) quando contém atributos multivalorados.<br>( ) as formas normais são independentes, por exemplo, a FN2 não depende da FN1.<br>( ) eliminar dados redundantes não é um dos objetivos principais da normalização.",
        "alternativas": ["a) V - V - V", 
        "b) V - V - F", 
        "c) V - F - V", 
        "d) F - F - V",
        "e) F - F - F"],
        "correta": "e) F - F - F",
        "explicacao": "<br>(F) Uma tabela está na 1FN quando não contém atributos multivalorados; <br>(F) As formas normais são complementares e dependentes; <br>(F) Esse é o principal objetivo da normalização."
      },
      {
        "pergunta": "(FAURGS / HCPA – 2016) Uma relação está na _____________ se todos os seus atributos são monovalorados e atômicos. <br>Assinale a alternativa que completa, corretamente, a lacuna da afirmação acima.",
        "alternativas": ["a) Primeira Forma Normal", 
        "b) Segunda Forma Normal", 
        "c) Terceira Forma Normal", 
        "d) Quarta Forma Normal",
        "e) Quinta Forma Normal"],
        "correta": "a) Primeira Forma Normal",
        "explicacao": "Uma relação está na Primeira Forma Normal se todos os seus atributos são monovalorados e atômicos."
      },
      {
        "pergunta": "(AOCP / EBSERH – 2016) Além da 1FN, 2FN e 3FN, que são as mais comuns, a literatura de banco de dados ainda traz outras formas normais. Sabendo disso, assinale a alternativa correta que apresenta apenas duas dessas outras formas normais: ",
        "alternativas": ["a) IDF0 e Coad/Yourdon", 
        "b) 5FN e Boyce/Codd", 
        "c) IDF0 e Notação Chen", 
        "d) 4FN e Coad/Yourdon",
        "e) DFD e DER"],
        "correta": "b) 5FN e Boyce/Codd",
        "explicacao": "(a) Errado, nenhuma é uma forma normal; (b) Correto, ambas são formas normais; (c) Errado, nenhuma é uma forma normal; (d) Errado, nenhuma é uma forma normal; (e) Errado, nenhuma é uma forma normal."
      }
    ],





    "ingles": [
      {
        "pergunta": "Colocar aqui a pergunta de inglês ",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      },
      {
        "pergunta": "Colocar aqui a pergunta de inglês ",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      }
    ],





    "desenvolvimentoDeSoftware": [
      {
        "pergunta": "(Inédita/Prof. Felipe Mathias) Julgue o item a seguir. Na programação, um algoritmo é uma sequência lógica de passos, modeladas em torno de um problema - visando dar uma solução a ele, através de passos sequenciais.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! Com um algoritmo elencamos uma sequência lógica de passos, que são executados sequencialmente, visando solucionar determinado problema através da execução de uma tarefa."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Julgue o item a seguir, relativo a algoritmos de linguagem de programação.<br>O pseudocódigo consiste em um texto estruturado com comandos escritos em linguagem humana, no qual se apoia a criação dos algoritmos computacionais.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Exatamente. O pseudocódigo é um texto estruturado, que não segue regras e padrões específicos, usado para descrever a lógica de um algoritmo sem se preocupar com a implementação específica de uma linguagem."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Julgue o item a seguir, relativo a algoritmos de linguagem de programação.<br>Os dados de um algoritmo devem ser definidos por tipos para que seus conteúdos possam ser submetidos a operações corretas, inerentes a cada tipo de dado.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Apesar da definição se dar ora de forma expressa, ora de forma implícita (na tipagem dinâmica), ele sempre deve ser definido, de forma que o interpretador do código consiga fazer as operações de forma correta íntegra. Correta a afirmativa."
      },
      {
        "pergunta": "(VUNESP/EPC/S2023) Considere que, ao se chamar uma função: a) foram passados os valores de variáveis para ela; b) o valor de cada variável na função chamadora é copiado nas variáveis fictícias correspondentes da função chamada; c) as alterações feitas nas variáveis fictícias na função chamada não têm efeito nos valores das variáveis reais na função chamadora. <br>Esse método é conhecido como chamada",
        "alternativas": ["a) cruzada.", 
        "b) exclusiva.", 
        "c) reversa.", 
        "d) por valor.",
        "e) por referência."],
        "correta": "d) por valor.",
        "explicacao": "O método que (b) copia os valores, e (c) cujas alterações não impactam a variável real, é chamado de método de atribuição por valor."
      },
      {
        "pergunta": "Julgue o item abaixo, com base nos conceitos da lógica de programação. <br>A indentação é um processo essencial na construção de códigos. Além de garantir uma melhor leitura do código, algumas linguagens, como Python, utilizam a indentação como forma de garantir a hierarquia dentro do código.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! O processo de indentação ajuda a visualizar melhor a hierarquia dos blocos de comandos, além de ser obrigatória para implementar algumas linguagens, como o Python."
      },
      {
        "pergunta": "calc = 5 % 2<br>imprime(calc)<br>Assinale a opção que apresenta o resultado da execução do pseudocódigo precedente.",
        "alternativas": ["a) 1", 
        "b) 2", 
        "c) 10", 
        "d) 20",
        "e) 25"],
        "correta": "a) 1",
        "explicacao": "O símbolo % se trata da operação 'módulo', que é o resto da divisão."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Julgue o item que se segue, relativo a conceitos de avaliação de expressões. <br>Após o algoritmo a seguir ser executado, os valores das variáveis c e d serão iguais. <br>real d<br>real c<br>d = 6 / -2 + -3 * -2 – 3<br>escreva (d)<br>c = 6 / -2 + 3 * 2 – 3<br>escreva(c)",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "Como tanto d quanto c possuem o mesmo valor (0), a afirmativa está correta."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023)<br>real c, b, d;<br>real x, y;<br>c = 5;<br>b = 8;<br>d = 3;<br>x = (c < b) ou (b < d) e (c < d);<br>y = ((c < b) ou (b < d)) e (c < d);<br>escreva(x);<br>escreva(y);<br>Com base no algoritmo precedente, julgue o item a seguir, relativo a operadores e expressões.<br>Após a execução desse algoritmo, os valores das variáveis x e y serão diferentes.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Como tanto d quanto c possuem o mesmo valor (0), a afirmativa está correta."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Com relação à lógica de programação, julgue o próximo item. A estrutura de controle IF, que pode ser classificada como do tipo iteração, determina o caminho que o algoritmo deve seguir, de acordo com determinada condição.",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Apesar do IF (Se) definir um caminho para o algoritmo seguir, ela não é uma estrutura de iteração, e sim uma estrutura de seleção."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>Se os valores a = 3, b = 4 e c = 8 forem entradas do algoritmo a seguir e o sistema no qual o algoritmo for executado utilizar números decimais com quatro casas de precisão, então a execução do referido algoritmo apresentará em tela o resultado 10.3923.<br>sp = (a + b + c)/2;<br>ar = sp*(sp - a)*(sp - b)*(sp - c);<br>se (ar < 0)<br>   escreva (“Não é possível obter resultado.”);<br>senão<br>   escreva (“Resultado: “);<br>   escreva(raiz_quadrada(ar));<br>fimse",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Como temos um valor de ar menor que 0 (ar < 0), executaremos o bloco Se, tendo como retorno o texto “Não é possível obter resultado”, e não o valor 10.3923."
      },
      {
        "pergunta": "(CEBRASPE/PREF. FORTALEZA/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>Ao final da execução do algoritmo a seguir, o valor 0 será apresentado.<br>constante A = 50<br>enquanto (A > 0)<br>A -= 5;<br>fim enquanto<br>escreva (A);",
        "alternativas": ["Certo", "Errado"],
        "correta": "Errado",
        "explicacao": "Temos uma condição A > 0, ou seja, enquanto A for maior que 0, iremos executar um bloco de código. O bloco de código é a operação A -= 5, que é uma operação de atribuição: cada vez que ela for chamada, retiraremos 5 unidades do valor de A. Portanto, iríamos reduzir o valor de 5 em 5 - teríamos 50, 45, 40... 0.<br>Como estamos tratando de uma constante, não podemos alterar seu valor de forma externa - então o valor da operação escreva (A) (que é similar ao Escrever(A), que estamos fazendo até agora) será 50."
      },
      {
        "pergunta": "(FGV/TCE SP/2023) Marta está definindo um algoritmo para descrever um menu de funções do sistema, apresentando as opções baseadas em números, seguido da leitura da opção, com a saída ocorrendo após a digitação do número zero. <br>Para gerenciar o fluxo de execução, que envolve a exibição do menu e leitura da opção, repetindose até que seja digitada a opção zero, Marta deve utilizar a estrutura de controle:",
        "alternativas": ["a) enquanto - faça;", 
        "b) se - então;", 
        "c) repita - até;", 
        "d) para - faça;",
        "e) se - então - senão."],
        "correta": "c) repita - até;",
        "explicacao": "O fluxo de execução de um código é a ordem com que o interpretador lê esse código e executa operações. Estamos seguindo um fluxo de execução de bloco de código → verificação de condição, até que determinada condição seja verificada como verdadeira. Essa estrutura se caracteriza como uma repetição do tipo Repita...Até."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>No algoritmo a seguir, o comando x = x + 10 é executado quatro vezes.<br>x = 10;<br>para (y = 40; y < 100; y = y + 16)<br>   x = x + 10;<br>fim para",
        "alternativas": ["Certo", "Errado"],
        "correta": "Certo",
        "explicacao": "O Para inicia com a variável em 40, com o limite superior menor que 100, e incrementa o valor em 16 unidades a cada laço. Então, teremos execuções para y igual a 40, 56, 72 e 88. A próxima iteração seria com y = 104, que passa a não obedecer mais à condição de verificação (y < 100). Portanto, de fato, executamos o comando 4 vezes."
      },
      {
        "pergunta": "(VUNESP/TJM SP/2023) Analise o programa a seguir, apresentado na forma de uma pseudolinguagem (Português Estruturado).<br><br>Início<br>    Inteiro: x, y, z, i;<br>    x ← 3;<br>    y ← 3;<br>    z ← 3;<br>    Para i de 1 até 6 faça<br>    [   Se (z = 3)<br>        Então<br>        [<br>            x ← x+1;<br>            y ← y+2;<br>            z ← z-1;<br>        ]<br>        Senão<br>        [<br>            z ← z+1;<br>        ]<br>    ]<br>    z ← x + y + z;<br>Fim.<br>O valor da variável z ao final da execução desse programa será:",
        "alternativas": ["a) 15", 
        "b) 16", 
        "c) 17", 
        "d) 18",
        "e) 19"],
        "correta": "d) 18",
        "explicacao": "muita coisaaa"
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Julgue o item que se segue, relativo a conceitos de avaliação de expressões.<br>Após o algoritmo a seguir ser executado, o valor da variável soma1<br>será maior que o da variável<br>soma2.<br>vetor a[7];<br>real soma1, soma2;<br>inteiro i;<br>a = [1,3,9,27,81,243,729];}<br>soma1 = 0;<br>i = 0;<br>enquanto (i < 7) faça<br>soma1 = soma1 + a[i]<br>i = i + 1<br>fim enquanto<br>soma2 = 1 * (1-3^7)/(1-3)<br>escreva(soma1)<br>escreva(soma2)<br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "A questão traz algumas variáveis, dentre elas um vetor a com 7 elementos. Vamos achar o valor de soma1 e soma2, para verificarmos o apontamento da afirmativa. Vamos começar com o soma1. <br>O loop Enquanto irá somando o valor atual de soma1 com a respectiva posição no vetor. Então, como i = 0, e o aumento a cada laço é incremental, faremos 7 loops (de i = 0 até i = 6).<br>Portanto, o valor final da variável soma1 é 1.093. Na hora da prova, se você tiver entendido a lógica - que estamos somando todos os valores do vetor - a resolução se torna muito mais rápido.<br>Agora, vamos para a soma2.<br>soma2 = 1 * (1 - 2187) / (-2)<br>soma2 = 1 * (-2186) / (-2)<br>soma2 = 1.093<br>Então, o valor de soma2 (1.093) é mesmo que o valor de soma1 (1.093). Sendo assim, afirmativa incorreta."
      },
      {
        "pergunta": "(CEBRASPE/SEPLAN RR/2023) Julgue o item a seguir acerca dos conceitos de estrutura de dados.<br>Sempre que houver uma remoção na estrutura de dados denominada fila, o elemento removido será aquele que está na estrutura há mais tempo.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "A remoção de elemento na estrutura de fila é direcionada ao elemento da “frente”, do começo da fila. Como esse elemento é, de fato, o que está há mais tempo na fila, que teve sua inserção feita primeiro, a alternativa está correta."
      },
      {
        "pergunta": "(IBFC/TRF 5/2024) Estruturas de dados são constantemente utilizadas em algoritmos para resolução de problemas, desde os mais simples aos mais complexos, desta forma, estrutura de dados utiliza o princípio “Último a entrar, primeiro a sair”(LIFO):",
        "alternativas": ["a) Fila", 
        "b) Lista Encadeada", 
        "c) Pilha", 
        "d) Árvore"],
        "correta": "c) Pilha",
        "explicacao": "A estrutura que usa o padrão LIFO (“Last In, First Out”). são as pilhas."
      },
      {
        "pergunta": "(IDCAP/CREA BR/2023) É correto afirmar que a imagem abaixo corresponde a um exemplo de:<br><img src='../dados/imgs/questao_desenvolvimento_1.png' alt='imagem da questão'>",
        "alternativas": ["a) Lista", 
        "b) Árvore",
        "c) Conjunto",
        "d) Matriz", 
        "e) Tabela espelhada"],
        "correta": "d) Matriz",
        "explicacao": "A estrutura apresenta um conjunto de dados elencados em linhas em colunas, cada qual com seu respectivo índice. Essa estrutura caracteriza uma matriz."
      },
      {
        "pergunta": "(AOCP/IFNMG/2022) “Uma variável composta homogênea multidimensional é formada por uma sequência de variáveis, todas do mesmo tipo, com o mesmo identificador (mesmo nome), e alocadas sequencialmente na memória. Uma vez que as variáveis têm o mesmo nome, o que distingue são índices que referenciam sua localização dentro da estrutura. Uma variável desse tipo precisa de um índice para cada uma de suas dimensões”. Essa descrição se refere a qual estrutura de dados?",
        "alternativas": ["a) Registro", 
        "b) Vetor",
        "c) Matriz",
        "d) Pilha", 
        "e) Fila"],
        "correta": "c) Matriz",
        "explicacao": "A estrutura multidimensional descrita pela questão são as matrizes."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) No que concerne a conceitos de algoritmos e blocos de comandos, julgue o item seguinte. <br>As funções são um bloco de código ou comandos constituindo um conjunto específico de instruções repetíveis, que recebem uma ou mais entradas e produzem alguma saída.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! Funções são blocos de código que executam alguma instrução repetível, isso é, pode ser usada repetidamente sem “esgotamento”. Para ser caracterizada como uma função, deve haver um retorno."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Julgue o item a seguir, relativo a algoritmos de linguagem de programação. <br>Na instrução A(i) = FUNC(i), a saída da função FUNC( ) é passada corretamente como parâmetro de entrada (i) para a função A. ",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Na instrução A(i) = FUNC(i), o valor de retorno da função FUNC(i) está sendo atribuído à variável A na posição i, mas não está sendo passado como parâmetro para a função A. A atribuição acontece após a chamada da função FUNC(i), portanto, não está sendo passado como parâmetro de entrada para a função A."
      },
      {
        "pergunta": "(Inédita/Prof. Felipe Mathias) Considere a seguinte função em pseudocódigo:<br><img src='../dados/imgs/questao_desenvolvimento_2.png' alt='imagem da questão'><br>Qual seria o valor retornado pela função soma_fatorial(3)?",
        "alternativas": ["a) 3", 
        "b) 6",
        "c) 9",
        "d) 12"],
        "correta": "c) 9",
        "explicacao": "Portanto, concluímos que o valor de Soma para soma_fatorial(3) é 9. Esse programa é responsável por calcular a soma de todos os fatoriais até de 1 até 3 - portanto, somamos o fatorial de 1 (1), de 2 (2) e de 3 (6)."
      },
      {
        "pergunta": "(CONSULPLAN/Pref. Campos dos Goytacazes/2024) Em programação, sobre a passagem de parâmetros por referência em comparação com a passagem de parâmetros por valor, assinale a afirmativa correta.",
        "alternativas": ["a) A passagem por referência é uma técnica que permite que variáveis sejam executadas em paralelo; ao contrário da passagem por valor.", 
        "b) A passagem de uma referência à memória onde o valor está armazenado; a passagem por valor envolve a cópia do valor real do argumento para a função.",
        "c) A passagem por referência permite modificar o valor da variável passada como argumento, não necessariamente uma variável global; ao contrário da passagem por valor.",
        "d) A passagem por valor é uma técnica que permite modificar o valor de uma variável global a partir de uma função; a passagem por referência mantém a integridade do valor original."],
        "correta": "b) A passagem de uma referência à memória onde o valor está armazenado; a passagem por valor envolve a cópia do valor real do argumento para a função.",
        "explicacao": "Lembre-se, a passagem de parâmetros por referência passa um ponteiro, que aponta para o local na memória onde o dado está armazenado, permitindo a modificação do parâmetro diretamente pela função. Já a passagem por valor traz apenas uma cópia literal do parâmetro."
      },
      {
        "pergunta": "(CEBRASPE/PETROBRAS/2022) Julgue o item subsequente, a respeito de algoritmos para ordenação e pesquisa e de programação recursiva.<br>Uma função é dita recursiva quando, dentro dela, é feita uma ou mais chamada a ela mesma.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! Uma função recursiva é aquela que chama a si mesmo um ou mais vezes dentro de seu próprio bloco de código."
      },
      {
        "pergunta": "(CESGRANRIO/IPEA/2024) Na programação funcional, que é um paradigma suportado pela Linguagem Scala, uma das práticas fundamentais é o uso de funções puras.<br>A principal propriedade que caracteriza uma função pura é a(o)",
        "alternativas": ["a) baixa coesão", 
        "b) ausência de efeitos colaterais",
        "c) incapacidade de chamar outra função",
        "d) alto acoplamento",
        "e) encapsulamento aberto"],
        "correta": "b) ausência de efeitos colaterais",
        "explicacao": "A questão exige conhecimento sobre a linguagem Scala, mas isso é indiferente, já que a definição de uma função pura independe da linguagem. Das alternativas apresentadas, a única que aponta uma característica da função é a letra B, com a ausência de efeitos colaterais."
      },
      {
        "pergunta": "(INQC/CPTRANS/2024) Observe o seguinte algoritmo:<br><img src='../dados/imgs/questao_desenvolvimento_3.png' alt='imagem da questão'><br>A ferramenta utilizada para construção desse algoritmo é:",
        "alternativas": ["a) diagrama de Nassi-Shneiderman", 
        "b) diagrama hierárquico de fluxo",
        "c) pseudocódigo",
        "d) fluxograma"],
        "correta": "c) pseudocódigo",
        "explicacao": "Veja que não temos uma estrutura padrão para de linguagem - estamos usando uma linguagem estruturada apenas para descrever um algoritmo. Isso caracteriza o uso de pseudolinguagem."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Julgue o item a seguir, relativo a algoritmos de linguagem de programação.<br>O pseudocódigo consiste em um texto estruturado com comandos escritos em linguagem humana, no qual se apoia a criação dos algoritmos computacionais.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! O objetivo da pseudolinguagem, ou pseudocódigo, é estruturar algoritmos de programação através de uma linguagem natural, humana, para que qualquer um possa entender a “lógica” por detrás do programa."
      },
      {
        "pergunta": "(CEBRASPE/CAU BR/2024) Com relação à lógica de programação, julgue o próximo item. A estrutura de controle IF, que pode ser classificada como do tipo iteração, determina o caminho que o algoritmo deve seguir, de acordo com determinada condição.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Temos 3 estruturas de controle num código:<br>• Estruturas sequenciais<br>• Estruturas de seleção<br>• Estruturas de iteração (ou repetição)<br>O IF, ou Se, é uma estrutura de seleção, que elenca uma série de blocos de código, e um delesserá selecionado para execução conforme determinada condição pré-definida."
      },
      {
        "pergunta": "(IGEDUC/CM V Santo Antão/2024) Julgue o item a seguir. <br>O pseudocódigo é considerado uma linguagem de programação formal e executável, seguindo uma sintaxe e semântica específicas, semelhante a linguagens como Java e Python. Sua principal aplicação é na implementação direta de algoritmos em ambientes de desenvolvimento integrados, sem a necessidade de conversão para outra linguagem de programação ",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Cuidado! O pseudocódigo não conta com uma estrutura definida e, portanto, não é uma linguagem executável. Diferentemente de linguagens como Java e Python."
      },
      {
        "pergunta": "(CEBRASPE/TST/2024)<br>programa principal<br> inteiro i, contagem = 10, limite = 10;<br> para (i = 0; i > limite; i = i + 1) faça<br>  contagem = contagem – 1;<br> fim para<br> imprime(contagem);<br>fim programa<br>Com base no algoritmo precedente, escrito em pseudocódigo, assinale a opção que corresponde ao tipo de estrutura em que se realiza o decréscimo da variável contagem.",
        "alternativas": ["a) estrutura de controle", 
        "b) estrutura de repetição",
        "c) estrutura condicional",
        "d) atributo",
        "e) função"],
        "correta": "b) estrutura de repetição",
        "explicacao": "O bloco de código apresenta uma estrutura Para, que é uma das formas de implementarmos uma estrutura de repetição (iteração), principalmente nos casos em que sabemos a quantidade de laços (iterações, repetições) que queremos realizar."
      },
      {
        "pergunta": "(CEBRASPE/TST/2024) Uma das vantagens do uso de funções predefinidas é",
        "alternativas": ["a) o reaproveitamento de código.", 
        "b) a passagem de parâmetros.",
        "c) o recebimento do retorno das funções.",
        "d) o grau de abstração do sistema.",
        "e) a facilidade de implementação das funções."],
        "correta": "a) o reaproveitamento de código.",
        "explicacao": "Funções pré-definidas fazem parte das funções nominadas, que permitem seu reuso através de uma chamada posterior, utilizando o nome da função - que pode ser nativa à linguagem, ou criada pelo desenvolvedor. Com isso em mente, vamos às alternativas.<br>a) Certo. De fato, uma das maiores vantagens trazidas pelas funções predefinidas é a capacidade de reaproveitar o bloco de código ao longo do programa. <br>b) Errado. Passagem de parâmetros é um processo feito em qualquer tipo de função, não é inerente às funções predefinidas. <br>c) Errado. Toda função retorna determinado valor.<br>d) Errado. A abstração do sistema envolve o foco em partes mais importantes do código - o que não está ligado, necessariamente, às funções predefinidas. <br>e) Errado. Não é porque uma função foi definida previamente que ela será de fácil implementação. Existem funções predefinidas complexas, como as de ordem superior."
      },
      {
        "pergunta": "(IBFC/TRF 5/2024) Sobre Estruturas de Seleção/Condição, analise as afirmativas e dê valores Verdadeiro (V) ou Falso (F).<br>( ) A instrução else é obrigatória em todas as estruturas de condição.<br>( ) A instrução else em uma estrutura de condição é executada quando a condição no if é avaliada como falsa.<br>( ) Estruturas de condição não são necessárias em programação, pois é possível realizar todas as operações sem avaliar condições.<br>Assinale a alternativa que apresenta a sequência correta de cima para baixo.",
        "alternativas": ["a) F - F - F", 
        "b) F - V - F",
        "c) V - F - V",
        "d) V - V - V",
        "e) V - V - F"],
        "correta": "b) F - V - F",
        "explicacao": "Vamos analisar cada item. <br>( ) A instrução else é obrigatória em todas as estruturas de condição. Falso. O else, ou Senão é uma forma de adicionarmos um caso residual - e nem sempre ele é obrigatório, até mesmo no uso de estruturas If (Se) <br>( ) A instrução else em uma estrutura de condição é executada quando a condição no if é avaliada como falsa. Verdadeiro. Numa estrutura if...else, ou Se...senão, a execução do bloco Else só é implementada quando a condição verificada no bloco if for falsa. <br>( ) Estruturas de condição não são necessárias em programação, pois é possível realizar todas as operações sem avaliar condições. Falso. Não temos outra forma de implementar as funcionalidades das estruturas condicionais sem o uso delas - e as condições são partes estruturantes e essenciais de um código."
      },
      {
        "pergunta": "(CEBRASPE/FINEP/2024) Assinale a opção que corresponde ao comando de salto incondicional utilizado em programação estruturada.",
        "alternativas": ["a) goto", 
        "b) struct",
        "c) if",
        "d) else",
        "e) for"],
        "correta": "a) goto",
        "explicacao": "Na execução de um código, dada determinada situação, pode ser interessante (ou obrigatório) que linhas de código sejam puladas para a correta execução de um programa - como, por exemplo, se determinado bloco Se for executado, podemos pular instruções que introduziriam alternativas à execução desse bloco. A instrução que realiza esse “salto” é a goto (vá para)."
      },
      {
        "pergunta": "(CEBRASPE/POLC AL/2023) Julgue o próximo item, no que se refere a estruturas de controle de fluxo.<br>// codigo 1<br>i = 1<br>fim = 7<br>enquanto i < fim faça<br>escreva(i)<br>i = i + 1<br>fim enquanto<br>depois = i<br>// codigo 2<br>fim = 6<br>i = 0<br>enquanto i < fim faça<br> i = i + 1<br> escreva(i)<br>fim enquanto<br>depois = i<br>Considerando a estrutura precedente, é correto afirmar que o código 1 e o código 2 apresentamo mesmo resultado.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Temos dois loops Enquanto. Ambos possuem a mesma estrutura - serão executados enquanto a variável i for menor que a variável fim (i < fim) e, a cada iteração, incrementarão o valor da variável i em 1 unidade. Vamos analisar a saída de cada código [...] Veja que temos a mesma saída - isso acontece pois a escrita do valor da variável acontece antes do incremento no código 1, e depois do incremento no código 2. Sendo assim, correta a afirmativa."
      },
      {
        "pergunta": "(COCP IFMT/IFMT/2023) Segundo Manzano & Oliveira (2016), um laço incondicional, entre outras coisas, é um tipo de laço que é iterativo, porém não é interativo e tem seu funcionamento controlado por uma variável denominada contador. Com essa descrição, o autor se refere ao laço do tipo:",
        "alternativas": ["a) para/fim_para", 
        "b) repita/até_que",
        "c) enquanto/fim_enquanto",
        "d) laço/fim_laço",
        "e) execute/enquanto_for"],
        "correta": "a) para/fim_para",
        "explicacao": "As características que ajudam a identificar qual estrutura de repetição está sendo utilizado é:<br>• É incondicional, isso é, não analisa uma condição para ser executado<br>• Seu funcionamento é controlado por um contador<br>Isso nos denota o uso da estrutura repetitiva Para, que utiliza um contador para verificar quantas iterações serão feitas. Porém, como ele não analisa o resultado da iteração, somente o contador, ele não é um loop interativo."
      },
      {
        "pergunta": "(CEBRASPE/CNMP/2023) Julgue o item subsecutivo, que se referem a conceitos de programação e banco de dados.<br>As estruturas condicionais são utilizadas para testar variáveis lógicas.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito. Quando usamos uma estrutura condicional, por exemplo o Se...então..senão, estamos fazendo uma verificação lógica - isso é, se o valor da sintaxe passada como parâmetro for verdadeiro, executaremos o bloco Se, se for falso, executaremos o Senão."
      },
      {
        "pergunta": "(VUNESP/UNICAMP/2023) O programa a seguir, expresso na forma de uma pseudolinguagem (português estruturado), deve ser analisado e utilizado para responder à questão<br><img src='../dados/imgs/questao_desenvolvimento_4.png' alt='imagem da questão'><br>No programa, o número de vezes que a condição<br>Se (a < b)<br>dentro do loop Para... se mostra verdadeira é:",
        "alternativas": ["a) 1", 
        "b) 2",
        "c) 3",
        "d) 4",
        "e) 5"],
        "correta": "b) 2",
        "explicacao": "Temos um loop Para executado 5 vezes (de i = 1 até i = 5). A cada iteração, se a < b, faremos uma operação incremental em a, e atualizaremos o valor de c com o valor de a + b. Como para nossa análise só importa o valor de a e b, vamos ignorar as interações com a variável c. Vamos ver os laços:<br>Laço 1 - i = 1; a = 0, b = 2<br>Caímos no bloco Se, então, teremos:<br>• a = a + 1<br>• a = 0 + 1 = 1<br>Laço 2 - i = 2; a = 1; b = 2<br>Novamente, caímos no bloco Se. Teremos:<br>• a = a + 1<br>• a = 1 + 1 = 2<br>A partir do laço 3, teremos a = b (2), então não teremos mais o valor Verdadeiro para a condicional Se (a < b). Assim, podemos afirmar que o número de vezes que a condição é considerada verdadeira é igual a 2."
      },
      {
        "pergunta": "(FUNDATEC/IFFAR/2023) Sobre a utilização de estruturas de repetição em algoritmos, assinale a alternativa que apresenta estrutura que executa um conjunto de instruções pelo menos uma vez antes de verificar a validade da condição estabelecida.",
        "alternativas": ["a) repita...até_que", 
        "b) faça...enquanto",
        "c) caso...seja...faça...senão...fim_caso",
        "d) enquanto...faça...fim_enquanto",
        "e) para...de...até...faça...fim_para"],
        "correta": "a) repita...até_que",
        "explicacao": "A estrutura de repetição que sempre executará um bloco de código antes de verificar a condição, fazendo essa verificação após a execução, é o Repita...Até. Cuidado - o Faça...enquanto tem uma estrutura muito similar, também irá executar o bloco ao menos uma vez, mas faz a verificação antes da executá-lo."
      },
      {
        "pergunta": "(CONSULPLAN/IF PA/2023) As estruturas de controle de fluxo são elementos fundamentais da lógica de programação. Assinale, a seguir, um exemplo de estrutura de controle de fluxo em lógica de programação.",
        "alternativas": ["a) Loop", 
        "b) Classe",
        "c) Variável",
        "d) Constante"],
        "correta": "a) Loop",
        "explicacao": "Ferramentas de controle de fluxo são aquelas que interrompem o fluxo “normal” de leitura do código, o fluxo contínuo e sequencial. Uma das formas de controlarmos o fluxo é através das estruturas de repetição, ou loops. Com eles, um determinado bloco de código é executado n vezes, enquanto a condição for verdadeira ou conforme um contador."
      },
      {
        "pergunta": "(CONSUPLAN/IF PA/2023) Qual das seguintes instruções de pseudocódigo seria utilizada para fazer o programa repetir um conjunto de ações até que uma determinada condição seja satisfeita?",
        "alternativas": ["a) SE...ENTÃO", 
        "b) PARA...ATÉ",
        "c) CASO...SEJA",
        "d) ENQUANTO...FAÇA"],
        "correta": "d) ENQUANTO...FAÇA",
        "explicacao": "Uma estrutura, para repetir inúmeras vezes, deve se encaixar no conceito das estruturas de repetição. Dentre as alternativas, temos duas delas - o PARA...ATÉ, e o ENQUANTO...FAÇA. A estrutura que faz uma sequência de repetições até que determinada condição seja implementada é o ENQUANTO...FAÇA. O PARA...ATÉ usará um contador para ter uma quantidade definida de repetições."
      },
      {
        "pergunta": "(FUNDATEC/IFC/2023) Em relação a algoritmos, analise as assertivas abaixo:<br>I. Um algoritmo representa uma sequência de regras.<br>II. Essas regras devem ser executadas em uma ordem preestabelecida.<br>III. Cada algoritmo possui um conjunto finito de regras.<br>IV. Essas regras devem possuir um significado e ser formalizadas segundo alguma convenção.<br>Quais estão corretas?",
        "alternativas": ["Apenas I e II", 
        "b) Apenas I e III",
        "c) Apenas II e IV", 
        "d) Apenas II, III e IV",
        "e) I, II, III e IV"],
        "correta": "e) I, II, III e IV",
        "explicacao": "Vamos analisar cada item.<br>I. Certo. O algoritmo é uma sequência de regras que visa executar determinado programa.<br>II. Certo. A ordem corresponde ao fluxo de execução do código - usualmente sequencial.<br>III. Certo. Os algoritmos possuem regras para definir sua correta interpretação.<br>IV. Certo. Mesmo em pseudocódigo, temos algumas regras e padronizações que devem ser feitas e mantidas, imagine escrever cada função, cada loop de um jeito diferente num mesmo código, isso geraria uma confusão total.<br>Portanto, todos os itens estão corretos."
      },
      {
        "pergunta": "(FUNCER/Pref. São Tomé/2023) Dentro da lógica de programação é uma estrutura que permite executar mais de uma vez o mesmo comando ou conjunto de comandos, de acordo com uma condição ou com um contador. A estrutura de repetição básica abaixo está se referindo:<br><img src='../dados/imgs/questao_desenvolvimento_5.png' alt='imagem da questão'><br>",
        "alternativas": ["a) do while", 
        "b) for",
        "c) while",
        "d) if",
        "e) stop"],
        "correta": "c) while",
        "explicacao": "A estrutura apresentada inicia, em A, com uma verificação se determinado item possui o valor TRUE (verdadeiro) ou FALSE (falso). Se o valor for TRUE, executamos o bloco B e, em seguida, verificamos novamente se seu valor é verdadeiro ou falso. Se o valor for FALSE, seguimos na execução normal do código. Essa estrutura é chamada de WHILE, ou Enquanto. "
      },
      {
        "pergunta": "(CETAP/SEMAS PA/2023) Em que situação a recursividade é apropriada como solução para um problema de programação?",
        "alternativas": ["a) Quando o problema pode ser dividido em subproblemas independentes e semelhantes ao problema inicial.", 
        "b) Quando o problema é simples, ilógico e linear.",
        "c) Quando o problema requer a utilização de laços de repetição.",
        "d) Quando o problema é de natureza elétrica, o que demanda maior capacidade de processamento.",
        "e) Quando o problema requer uma solução iterativa, ou seja, uma sequência de soluções que admitem certa margem de erro, mas que vão melhorando conforme novas iterações são executadas."],
        "correta": "a) Quando o problema pode ser dividido em subproblemas independentes e semelhantes ao problema inicial.",
        "explicacao": "Vamos analisar cada alternativa.<br>a) Certo. A recursividade é a aplicação da “especialização do problema”, já que dividimos uma função, que objetiva “resolver um problema”, em subproblemas independentes a cada recursão.<br>b) Errado. A recursividade exige uma lógica mais complexa, lógica e não-linear.<br>c) Errado. Quando o problema requer laços de repetição, são usados os laços (estruturas de repetição).<br>d) Errado. Problema elétrico? Isso é problema para a engenharia elétrica, não para programação haha<br>e) Errado. Assim como na letra B, se a o problema requer iterações, usa-se uma estrutura que permita iterações - as estruturas de repetição."
      },
      {
        "pergunta": "(CEBRASPE/EMPREL/2023)<br>calc = 5 % 2<br>imprime(calc)<br>Assinale a opção que apresenta o resultado da execução do pseudocódigo precedente.",
        "alternativas": ["a) 1", 
        "b) 2",
        "c) 10",
        "d) 20",
        "e) 25"],
        "correta": "a) 1",
        "explicacao": "A sintaxe 5%2 indica que estamos fazendo um módulo de 5 por 2, e seu retorno será o resto da divisão.<br>Portanto, o valor impresso será equivalente ao resto da divisão de 5 por 2, que é igual a 1."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023)<br><img src='../dados/imgs/questao_desenvolvimento_6.png' alt='imagem da questão'><br>Considerando a estrutura S precedente, inicialmente vazia e armazenada no arranjo S[1 ... 6], julgue o próximo item, a respeito de construção de algoritmos e estrutura de dados.<br>O resultado final das operações na sequência EMPURRA(S, 4), EMPURRA (S, 1), EMPURRA (S, 3), PUXA(S), EMPURRA (S, 8) e PUXA (S) é S[4,1,3,8].",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "A questão traz algumas estruturas condicionais visando preencher uma pilha de dados. - Questão 22 do pdf 1 do estratégia"
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) No que concerne a conceitos de algoritmos e blocos de comandos, julgue o item seguinte.<br>As funções são um bloco de código ou comandos constituindo um conjunto específico de instruções repetíveis, que recebem uma ou mais entradas e produzem alguma saída.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Perfeito! As funções trazem blocos de código, pequenos programas, que podem ser reutilizados em diversos pontos do código. Além disso, para ser caracterizada como uma função, a operação deve produzir alguma saída (retorno)."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>Um loop que sempre se repetirá em um determinado número de vezes é representado pelo código SE ENTÃO SENÃO FIM SE.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "O SE ENTÃO SENÃO é uma estrutura condicional, de seleção, e não um loop. Os loops englobam o PARA, ENQUANTO, FAÇA ENQUANTO, REPITA ATÉ, e outros. Portanto, incorreta a afirmativa."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) No que concerne a conceitos de algoritmos e blocos de comandos, julgue o item seguinte.<br>Algoritmo é uma lista de instruções que conduzem ações especificadas, passo a passo, em rotinas embasadas em hardware ou software.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Um algoritmo é, exatamente, uma lista de instruções que passará determinado valor de entrada por diversas ações e passos, que podem envolver rotinas embasadas em hardware (linguagens de baixo nível) ou em software (linguagens de alto nível). Então, correta a definição."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>Ao final da execução do algoritmo a seguir, o valor 0 será apresentado.<br><img src='../dados/imgs/questao_desenvolvimento_7.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Essa questão tem algumas camadas de conhecimento sendo exploradas. Para começar, podemos afirmar errado pois a variável A é do tipo constante, ou seja, não poderá ser alterada."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>No algoritmo a seguir, o comando x = x + 10 é executado quatro vezes.<br><img src='../dados/imgs/questao_desenvolvimento_8.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "O Para inicia com a variável em 40, com o limite superior menor que 100, e incrementa o valor em 16 unidades a cada laço. Então, teremos execuções para y igual a 40, 56, 72 e 84. A próxima iteração seria com y = 100, que passa a não obedecer mais à condição de verificação (y < 100). Portanto, de fato, executamos o comando 4 vezes."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir. Se os valores a = 3, b = 4 e c = 8 forem entradas do algoritmo a seguir e o sistema no qual o algoritmo for executado utilizar números decimais com quatro casas de precisão, então a execução do referido algoritmo apresentará em tela o resultado 10.3923. <br><img src='../dados/imgs/questao_desenvolvimento_9.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Vamos desenvolver os cálculos.<br>sp = (3 + 4 + 8)/2 = 15/2 = 7.5<br>ar = 7.5 * (7.5 - 3) * (7.5 - 4) * (7.5 - 8) = -59.0625<br>Como temos um valor de ar menor que 0 (ar < 0), executaremos o bloco Se, tendo como retorno o texto “Não é possível obter resultado”, e não o valor 10.3923."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Com relação a estruturas de controle, seleção, repetição e desvio, julgue o item a seguir.<br>Após executado, o algoritmo a seguir apresentará 720 como resultado final.<br><img src='../dados/imgs/questao_desenvolvimento_10.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Temos duas funções - uma função recursiva f(x) e outra função de ordem superior func(a). Estamos chamando primeiramente a função de ordem superior, com func(6). Então, vamos ver o que acontece.<br>Como o parâmetro a = 6, vamos cair no bloco alternativo - vamos retornar a + f(a - 1), ou seja, a + (f5). Sendo assim, precisamos subir para a função f(x) e resolvê-la com x = 5. E nela, novamente, como não atendemos a condição do Se, vamos executar o retorno - f(x-1) * x<br>Laço 1 -  (5) = f(4) * 5<br>Laço 2 - f(4) = f(3) * 4<br>Laço 3 - f(3) = f(2) * 3<br>Laço 4 - f(2) = f(1) * 2<br>Por fim, no laço 5 teremos f(1), e, como x == 1, caímos no bloco base - retornando 1. Como chegamos a um valor, podemos subir somando. Laço 5 - f(1) = 1<br>Laço 4 - f(2) = f(1) * 2 = 1 * 2 = 2<br>Laço 3 - f(3) = f(2) * 3 = 2 * 3 = 6<br>Laço 2 - f(4) = f(3) * 4 = 6 * 4 = 24<br>Laço 1 - f(5) = f(4) * 5 = 24 * 5 = 120<br>Então, encontramos que f(5) é igual a 120. Então é essa a resposta... só que não! Agora temos que voltar para a função que foi chamada inicialmente, a func, nós paramos a execução do bloco com a + f(5). Portanto, teremos a + 120 = 120 + 6 = 126.<br>De toda a forma, a resposta não será 720 - portanto, a afirmativa está incorreta."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) A respeito de recursividade, julgue o próximo item.<br>Uma grande vantagem da utilização da recursividade é o baixo consumo de memória.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "Muito pelo contrário - essa é uma desvantagem da recursividade, já que ela tem um alto consumo de memória. Iremos executar várias iterações dentro de uma só função, o que irá necessitar uma alocação maior de memória."
      },
      {
        "pergunta": "(CEBRASPE/Pref. Fortaleza/2023) Julgue o item que se segue, relativo a conceitos de avaliação de expressões. <br>Após o algoritmo a seguir ser executado, o valor da variável soma1 será maior que o da variável soma2.<br><img src='../dados/imgs/questao_desenvolvimento_11.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Errado",
        "explicacao": "A questão traz algumas variáveis, dentre elas um vetor a com 7 elementos. Vamos achar o valor de soma1 e soma2, para verificarmos o apontamento da afirmativa. Vamos começar com o soma1.<br>O loop Enquanto irá somando o valor atual de soma1 com a respectiva posição no vetor. Então, como i = 0, e o aumento a cada laço é incremental, faremos 7 loops (de i = 0 até i = 6). Vamos ver o primeiro laço:<br>Laço 1 - i = 0:<br>soma1 = soma1 + a[0]<br>soma1 = 0 + 1 = 1<br>Laço 2 - i = 1:<br>soma1 = soma1 + a[1]<br>soma1 = 1 + 3 = 4<br>Laço 3 - i = 2:<br>soma1 = soma1 + a[2]<br>soma1 = 4 + 9 = 13<br>Laço 4 - i = 3:<br>soma1 = soma1 + a[3]<br>soma1 = 13 + 27 = 40<br>Laço 5 - i = 4:<br>soma1= soma1 + a[4]<br>soma1 = 40 + 81 = 121<br>Laço 6 - i = 5<br>soma1 = soma1 + a[5]<br>soma1 = 121 + 243 = 364<br>Laço 7 - i = 6<br>soma1 = soma1 + a[6]<br>soma1 = 364 + 769 = 1039<br>Portanto, o valor final da variável soma1 é 1.039. Na hora da prova, se você tiver entendido a lógica - que estamos somando todos os valores do vetor - a resolução se torna muito mais rápido. Só iríamos somar os valores de a, e encontraríamos o mesmo valor.<br>Agora, vamos para a soma2.<br>soma2 = 1 * (1 - (3^7)) / (1-3)<br>soma2 = 1 * (1 - 2187) / (-2)<br>soma2 = 1 * (-2186) / (-2)<br>soma2 = 1 * 1.093<br>soma2 = 1.093<br>Então, o valor de soma2 (1.093) é maior que o valor de soma1 (1.039). Sendo assim, afirmativa incorreta."
      },
      {
        "pergunta": "(VUNESP/TJM SP/2023) Analise o programa a seguir, apresentado na forma de uma pseudolinguagem (Português Estruturado). <br><img src='../dados/imgs/questao_desenvolvimento_12.png' alt='imagem da questão'><br>O valor da variável z ao final da execução desse programa será:",
        "alternativas": ["a) 15", 
        "b) 16",
        "c) 17",
        "d) 18",
        "e) 19"],
        "correta": "d) 18",
        "explicacao": "Não deixe o tamanho da sintaxe te assustar. Encare com calma, linha por linha, para entender o que está acontecendo. Iniciamos o código declarando 3 variáveis do tipo inteiro, x, y e z - todas com o valor igual a 3. Em seguida, iniciamos um loop Para numa notação um pouco diferente do que vimos, mas basicamente estamos iniciando em 1, indo até 6 com incrementos de uma unidade - ou seja, seria como Para (i = 1, i <= 6; i++) - ou seja, 6 laços.<br>O bloco de código executado a cada laço é um Se...então...senão. A condição Se é z = 3 e, como iniciamos o programa com z = 3, iniciaremos o bloco fazendo as operações elencadas no bloco Se. Vamos lá!<br>Laço 1 - i = 1; z = 3 (bloco Se);<br>x = x + 1 = 3 + 1; x = 4<br>y = y + 2 = 3 + 2; y = 5<br>z = z - 1 = 3 - 1; z = 2 <- como caímos em z diferente de 3, o próximo bloco será no senão.<br>Laço 2 - i = 2; z = 2 (bloco Senão);<br>z = z + 1 = 2 + 1; z = 3<br>Laço 3 - i = 3; z = 3 (Bloco Se)<br>x = x + 1 = 4 +1; x = 5<br>y = y + 2 = 5 + 2; y = 7<br>z = z - 1 = 3 - 1; z = 2<br>Laço 4 - i = 4; z = 2 (bloco Senão)<br>z = z + 1 = 2 + 1; z = 3<br>Laço 5 - i = 5; z = 3 (bloco Se)<br>x = x + 1 = 5 + 1; x = 6<br>y = y + 2 = 7 + 2; y = 9<br>z = z - 1 = 3 - 1; z = 2<br>Laço 6 - i = 6; z = 2 (bloco Senão)<br>z = z + 1 = 2 + 1; z = 3<br>Bom, fizemos os laços, e terminamos com os seguintes valores:<br>x = 6<br>y = 9<br>z = 3<br>Por fim, temos uma nova atribuição de valor à variável z antes de finalizar o programa:<br>z = x + y + z<br>z = 6 + 9 + 3 = 18<br>Portanto, o valor final de Z será igual a 18. "
      },
      {
        "pergunta": "(IDCAP/CREA BR/2023) É uma maneira de resolver problemas decompondo-os repetidamente em subproblemas do mesmo tipo. Um exemplo clássico de uso desse tipo de algoritmo para resolver problemas é a Torre de Hanoi. O trecho acima diz respeito a(o):",
        "alternativas": ["a) Algoritmo de programação dinâmica.", 
        "b) Algoritmo recursivo.",
        "c) Algoritmo backtracking.",
        "d) Algoritmo de força bruta.",
        "e) Algoritmo de divisão e conquista."],
        "correta": "b) Algoritmo recursivo.",
        "explicacao": "Quando decompomos um problema dentro de pequenos problemas menores, estamos fazendo o que é chamado de recursividade. Determinada função, por exemplo, passa a chamar a si diversas vezes, até que seja atingido um bloco base - que interrompe a necessidade da recursão."
      },
      {
        "pergunta": "(FGV/TCE SP/2023) A série de Fibonacci é definida da seguinte forma: o primeiro e o segundo termos valem 1, e os demais são obtidos pela soma de seus dois antecessores. Em termos gráficos, ela define uma espiral, sendo utilizada em diversas áreas, que vão da biologia até o mercado financeiro. Um algoritmo para cálculo do termo de ordem n da série é apresentado a seguir. <br><img src='../dados/imgs/questao_desenvolvimento_13.png' alt='imagem da questão'><br>Executando o algoritmo, se for informado o valor 7 para x, será impressa a mensagem “Fibonacci para o termo:",
        "alternativas": ["a) 7", 
        "b) 21",
        "c) 28",
        "d) 64",
        "e) 128"],
        "correta": "b) 21",
        "explicacao": "Estamos executando a função leia(x) com x = 7. Com isso, executaremos o loop Enquanto com a condição i ≤ 7. Vamos fazer os laços.<br>LAÇO 1 - i = 2<br>• f = a + b; f = 1 + 1; f = 2<br>• a = b; a = 1<br>• b = f; b = 2<br>• i = i + 1; i = 2 + 1; i = 3<br>Um ponto de atenção - quando fazemos b = f, usamos o valor “atualizado” de f, já que ele foi modificado dentro do laço, antes de chamarmos a operação.<br>LAÇO 2 - i = 3<br>• f = a + b; f = 1 + 2; f = 3<br>• a = b; a = 2<br>• b = f; b = 3<br>• i = i + 1; i = 4<br>LAÇO 3 - i = 4<br>• f = a + b; f = 2 + 3; f = 5<br>• a = b; a = 3<br>• b = f; b = 5<br>• i = i + 1; i = 5<br>LAÇO 4 - i = 5<br>• f = a + b; f = 3 + 5; f = 8<br>• a = b; a = 5<br>• b = f; b = 8<br>• i = i + 1; i = 6<br>LAÇO 6 - i = 6<br>• f = a + b; f = 5 + 8; f = 13<br>• a = b; a = 8<br>• b = f; b = 13<br>• i = i + 1; i = 7<br>LAÇO 7 - i = 7<br>• f = a + b; f = 8 + 13; f = 21<br>Como estamos no último laço, os demais valores não nos importam. A saída, que envolve o valor de f, será, portanto, 21."
      },
      {
        "pergunta": "(FGV/TCE SP/2023) Marta está definindo um algoritmo para descrever um menu de funções do sistema, apresentando as opções baseadas em números, seguido da leitura da opção, com a saída ocorrendo após a digitação do número zero. <br>Para gerenciar o fluxo de execução, que envolve a exibição do menu e leitura da opção, repetindose até que seja digitada a opção zero, Marta deve utilizar a estrutura de controle: ",
        "alternativas": ["a) enquanto - faça;", 
        "b) se - então;",
        "c) repita - até;",
        "d) para - faça;",
        "e) se - então - senão."],
        "correta": "c) repita - até;",
        "explicacao": "O fluxo de execução de um código é a ordem com que o interpretador lê esse código e executa operações. Estamos seguindo um fluxo de execução de bloco de código → verificação de condição, até que determinada condição seja verificada como verdadeira. Essa estrutura se caracteriza como uma repetição do tipo Repita...Até."
      },
      {
        "pergunta": "(VUNESP/TRF 3/2023) Um trecho de programa, expresso na forma de uma pseudolinguagem (Português Estruturado), é apresentado a seguir. <br><img src='../dados/imgs/questao_desenvolvimento_14.png' alt='imagem da questão'><br>É correto afirmar que, a variável a, após a execução de desse trecho de programa, terá sido incrementada",
        "alternativas": ["a) 8 vezes.", 
        "b) 54 vezes",
        "c) 336 vezes",
        "d) 112 vezes",
        "e) 6 vezes"],
        "correta": "d) 112 vezes",
        "explicacao": "Ótima questão para entendermos o funcionamento de loops aninhados. Para cada iteração do loop mais externo, serão executadas todas as iterações do loop interno, e do seu loop interno também. Então, basicamente, teremos:<br>• Iteração geral 1 - i = 3<br>o Iteração bloco aninhado 1 - j = 4<br>▪ Iterações internas, de k = 2 a k = 8 (ou seja, 7 iterações).<br>o Iteração bloco aninhado 2 - j = 5<br>▪ Iterações internas, de k = 2 a k = 8 (ou seja, 7 iterações).<br>o Iteração bloco aninhado 3 - j = 6<br>▪ Iterações internas, de k = 2 a k = 8 (ou seja, 7 iterações). o Iteração bloco aninhado 4 - j = 7<br>▪ Iterações internas, de k = 2 a k = 8 (ou seja, 7 iterações).<br>Veja que, para uma iteração do bloco externo, executamos 28 iterações internas. Como vamos de 3 a 6, isso é, temos 4 execuções, executaremos 4 x 28 = 112 iterações.<br>Uma forma mais direta de achar esse valor é multiplicar as vezes que cada bloco Para irá ocorrer - temos 7 no bloco interno, 4 no bloco intermediário e 4 no bloco externo. Então, 7 * 4 * 4 = 112."
      },
      {
        "pergunta": "(CETREDE/UFC/2022) Marque a alternativa correta que apresenta o resultado do algoritmo detalhado a seguir.<br><img src='../dados/imgs/questao_desenvolvimento_15.png' alt='imagem da questão'><br>",
        "alternativas": ["a) 180", 
        "b) 90",
        "c) 120",
        "d) 720"],
        "correta": "d) 720",
        "explicacao": "O primeiro passo para entendermos a questão é entender qual valor está sendo passado para a sub-rotina. Conseguimos identificar nesse trecho:<br>n1 ⟵ 6<br>n2 ⟵ aplica_processamento(n1) Ou seja, vamos chamar a função aplica_processamento com o valor de n1 - assim, x = 6. Como x = 6, caímos no bloco SENÃO, que traz uma função recursiva. Essa função será executada até chegarmos a x = 1, portanto:<br>• Laço 1 = 6 * aplica_processamento(5)<br>• Laço 2 = 5 * aplica_processamento(4)<br>• Laço 3 = 4 * aplica_processamento(3)<br>• Laço 4 = 3 * aplica_processamento(2)<br>• Laço 5 = 2 * aplica_processamento(1)<br>• Laço 6 → aplica_processamento(1) = 1<br>Agora, podemos voltar “subindo” os laços.<br>• Laço 6 = 1<br>• Laço 5 = 2 * 1 = 2<br>• Laço 4 = 3 * 2 = 6<br>• Laço 3 = 4 * 6 = 24<br>• Laço 2 = 5 * 24 = 120<br>• Laço 1 = 6 * 120 = 720<br>Portanto, o retorno da função, dada uma entrada de 6, será de 720."
      },
      {
        "pergunta": "(CEBRASPE/PETROBRAS/2022) Com relação a tipos abstratos de dados, julgue o próximo item. <br>No trecho de código abaixo, o valor final da variável op é 4.<br><img src='../dados/imgs/questao_desenvolvimento_16.png' alt='imagem da questão'><br>",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Temos uma declaração inicial da variável op, que é do tipo inteiro, e depois temos novas declarações. Essas novas declarações substituem o valor original - portanto, de fato, o valor final da variável será 4, equivalente à última atribuição de valor."
      },
      {
        "pergunta": "(CEBRASPE/PETROBRAS/2022) Julgue o item subsequente, a respeito de algoritmos para ordenação e pesquisa e de programação recursiva. <br>Uma função é dita recursiva quando, dentro dela, é feita uma ou mais chamada a ela mesma.",
        "alternativas": ["Certo",
        "Errado"],
        "correta": "Certo",
        "explicacao": "Veja que essa é uma cobrança recorrente - tanto do ponto de vista teórico, que corresponde a quebra do programa em subprogramas, quanto do ponto de vista prático, que corresponde a uma função chamando a si uma ou mais vezes. Portanto, correta a afirmativa."
      },
      {
        "pergunta": "(SELECON/AMAZUL/2022) Na construção de algoritmos estruturados são utilizadas estruturas de controle, como a conhecida por REPITA ... ATÉ ... FIM REPITA. Neste contexto, NÃO é uma afirmativa válida para essa estrutura de controle:",
        "alternativas": ["a) A condição de teste da estrutura é inserida no INÍCIO da estrutura de controle.", 
        "b) A condição de teste da estrutura é inserida no FIM da estrutura de controle.",
        "c) A saída do loop ocorre quando o teste da condição de controle retoma valor VERDADEIRO.",
        "d) A execução do programa permanece no loop se o teste da condição de controle retoma valor FALSO."],
        "correta": "a) A condição de teste da estrutura é inserida no INÍCIO da estrutura de controle.",
        "explicacao": "Vamos analisar cada alternativa.<br>a) Errado. A condição no bloco REPITA...ATÉ é implementada no fim da estrutura de controle, não no início.<br>b) Certo. Vide letra A.<br>c) Certo. A saída do ENQUANTO é feita quando o valor for VERDADEIRO.<br>d) Certo. Se o valor da condição for FALSO, permaneceremos no loop até que esse valor seja VERDADEIRO."
      }
    ],





    "portugues": [
      {
        "pergunta": "Colocar aqui a pergunta de Português",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      },
      {
        "pergunta": "Colocar aqui a pergunta de Português",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      }
    ],





    "matematica": [
      {
        "pergunta": "Colocar aqui a pergunta de Matemática",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      },
      {
        "pergunta": "Colocar aqui a pergunta de Matemática",
        "alternativas": ["a) letra A", 
        "b) letra B", 
        "c) letra C", 
        "d) letra D",
        "e) letra E"],
        "correta": "a) letra A",
        "explicacao": "Colocar aqui o comentário da questão."
      }
    ]
  }